{
    "standard": "CIS Azure Foundations",
    "webLink": "#",
    "version": "1.1.0",
    "domains": [
      {
        "title": "Identity and Access Management",
        "controls": [
          {
            "ref": "1.1",
            "title": "Ensure that corporate login credentials are used (Scored)",
            "summary": "Use corporate login credentials instead of personal accounts, such as Gmail accounts.",
            "applicable": true
          },
          {
            "ref": "1.2",
            "title": "Ensure that multi-factor authentication is enabled for all non-service accounts (Not Scored)",
            "summary": "Setup multi-factor authentication for Google Cloud Platform accounts.",
            "applicable": true
          },
          {
            "ref": "1.3",
            "title": "Ensure that Security Key Enforcement is enabled for all admin accounts (Not Scored)",
            "summary": "Setup Security Key Enforcement for Google Cloud Platform admin accounts.",
            "applicable": true
          },
          {
            "ref": "1.4",
            "title": "Ensure that there are only GCP-managed service account keys for each service account (Scored)",
            "summary": "User managed service accounts should not have user-managed keys.",
            "applicable": true
          },
          {
            "ref": "1.5",
            "title": "Ensure that Service Account has no Admin privileges (Scored)",
            "summary": "A service account is a special Google account that belongs to an application or a VM, instead of to an individual end-user. The application uses the service account to call the service's Google API so that users aren't directly involved. It's recommended not to use admin access for ServiceAccount.",
            "applicable": true
          },
          {
            "ref": "1.6",
            "title": "Ensure that IAM users are not assigned the Service Account User or Service Account Token Creator roles at project level (Scored)",
            "summary": "It is recommended to assign the Service Account User (iam.serviceAccountUser) and Service Account Token Creator (iam.serviceAccountTokenCreator) roles to a user for a specific service account rather than assigning the role to a user at project level.",
            "applicable": true
          },
          {
            "ref": "1.7",
            "title": "Ensure user-managed/external keys for service accounts are rotated every 90 days or less (Scored)",
            "summary": "Service Account keys consist of a key ID (Private_key_Id) and Private key, which are used to sign programmatic requests users make to Google cloud services accessible to that particular service account. It is recommended that all Service Account keys are regularly rotated.",
            "applicable": true
          },
          {
            "ref": "1.8",
            "title": "Ensure that Separation of duties is enforced while assigning service account related roles to users (Not Scored)",
            "summary": "It is recommended that the principle of 'Separation of Duties' is enforced while assigning service-account related roles to users.",
            "applicable": true
          },
          {
            "ref": "1.9",
            "title": "Ensure that Cloud KMS cryptokeys are not anonymously or publicly accessible (Scored)",
            "summary": "It is recommended that the IAM policy on Cloud KMS cryptokeys should restrict anonymous and/or public access.",
            "applicable": true
          },
          {
            "ref": "1.10",
            "title": "Ensure KMS encryption keys are rotated within a period of 90 days (Scored)",
            "summary": "Google Cloud Key Management Service stores cryptographic keys in a hierarchical structure designed for useful and elegant access control management. The format for the rotation schedule depends on the client library that is used. For the gcloud command-line tool, the next rotation time must be in ISO or RFC3339 format, and the rotation period must be in the form INTEGER[UNIT], where units can be one of seconds (s), minutes (m), hours (h) or days (d).",
            "applicable": true
          },
          {
            "ref": "1.11",
            "title": "Ensure that Separation of duties is enforced while assigning KMS related roles to users (Scored)",
            "summary": "It is recommended that the principle of 'Separation of Duties' is enforced while assigning KMS related roles to users.",
            "applicable": true
          },
          {
            "ref": "1.12",
            "title": "Ensure API keys are not created for a project (Not Scored)",
            "summary": "Keys are insecure because they can be viewed publicly, such as from within a browser, or they can be accessed on a device where the key resides. It is recommended to use standard authentication flow instead.",
            "applicable": true
          },
          {
            "ref": "1.13",
            "title": "Ensure API keys are restricted to use by only specified Hosts and Apps (Not Scored)",
            "summary": "Unrestricted keys are insecure because they can be viewed publicly, such as from within a browser, or they can be accessed on a device where the key resides. It is recommended to restrict API key usage to trusted hosts, HTTP referrers and apps.",
            "applicable": true
          },
          {
            "ref": "1.14",
            "title": "Ensure API keys are restricted to only APIs that application needs access (Not Scored)",
            "summary": "API keys are insecure because they can be viewed publicly, such as from within a browser, or they can be accessed on a device where the key resides. It is recommended to restrict API keys to use (call) only APIs required by an application.",
            "applicable": true
          },
          {
            "ref": "1.15",
            "title": "Ensure API keys are rotated every 90 days (Not Scored)",
            "summary": "It is recommended to rotate API keys every 90 days.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Logging and Monitoring",
        "controls": [
          {
            "ref": "2.1",
            "title": "Ensure that Cloud Audit Logging is configured properly across all services and all users from a project (Scored)",
            "summary": "It is recommended that Cloud Audit Logging is configured to track all admin activities and read, write access to user data.",
            "applicable": true
          },
          {
            "ref": "2.2",
            "title": "Ensure that sinks are configured for all log entries (Scored)",
            "summary": "It is recommended to create a sink that will export copies of all the log entries. This can help aggregate logs from multiple projects and export them to a Security Information and Event Management (SIEM).",
            "applicable": true
          },
          {
            "ref": "2.3",
            "title": "Ensure that retention policies on log buckets are configured using Bucket Lock (Scored)",
            "summary": "Enabling retention policies on log buckets will protect logs stored in cloud storage buckets from being overwritten or accidentally deleted. It is recommended to set up retention policies and configure Bucket Lock on all storage buckets that are used as log sinks.",
            "applicable": true
          },
          {
            "ref": "2.4",
            "title": "Ensure log metric filter and alerts exist for project ownership assignments/changes (Scored)",
            "summary": "In order to prevent unnecessary project ownership assignments to users/service-accounts and further misuses of projects and resources, all `roles/Owner` assignments should be monitored.",
            "applicable": true
          },
          {
            "ref": "2.5",
            "title": "Ensure that the log metric filter and alerts exist for Audit Configuration changes (Scored)",
            "summary": "Google Cloud Platform (GCP) services write audit log entries to the Admin Activity and Data Access logs to help answer the questions of, \"who did what, where, and when?\" within GCP projects. Cloud audit logging records information includes the identity of the API caller, the time of the API call, the source IP address of the API caller, the request parameters, and the response elements returned by GCP services. Cloud audit logging provides a history of GCP API calls for an account, including API calls made via the console, SDKs, command-line tools, and other GCP services.",
            "applicable": true
          },
          {
            "ref": "2.6",
            "title": "Ensure that the log metric filter and alerts exist for Custom Role changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for changes to Identity and Access Management (IAM) role creation, deletion and updating activities.",
            "applicable": true
          },
          {
            "ref": "2.7",
            "title": "Ensure that the log metric filter and alerts exist for VPC Network Firewall rule changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for Virtual Private Cloud (VPC) Network Firewall rule changes.",
            "applicable": true
          },
          {
            "ref": "2.8",
            "title": "Ensure that the log metric filter and alerts exist for VPC network route changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for Virtual Private Cloud (VPC) network route changes.",
            "applicable": true
          },
          {
            "ref": "2.9",
            "title": "Ensure that the log metric filter and alerts exist for VPC network changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for Virtual Private Cloud (VPC) network changes.",
            "applicable": true
          },
          {
            "ref": "2.10",
            "title": "Ensure that the log metric filter and alerts exist for Cloud Storage IAM permission changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for Cloud Storage Bucket IAM changes.",
            "applicable": true
          },
          {
            "ref": "2.11",
            "title": "Ensure that the log metric filter and alerts exist for SQL instance configuration changes (Scored)",
            "summary": "It is recommended that a metric filter and alarm be established for SQL instance configuration changes.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Networking",
        "controls": [
          {
            "ref": "3.1",
            "title": "Ensure that 'Secure transfer required' is set to 'Enabled' (Scored)",
            "summary": "Enable data encryption is transit.",
            "applicable": true
          },
          {
            "ref": "3.2",
            "title": "Ensure that storage account access keys are periodically regenerated (Not Scored)",
            "summary": "Regenerate storage account access keys periodically.",
            "applicable": true
          },
          {
            "ref": "3.3",
            "title": "Ensure Storage logging is enabled for Queue service for read",
            "summary": "The Storage Queue service stores messages that may be read by any client who has access to the storage account. A queue can contain an unlimited number of messages, each of which can be up to 64KB in size using version 2011- 08 - 18 or newer. Storage Logging happens server-side and allows details for both successful and failed requests to be recorded in the storage account. These logs allow users to see the details of read, write, and delete operations against the queues. Storage Logging log entries contain the following information about individual requests: Timing information such as start time, end-to-end latency, and server latency, authentication details , concurrency information and the sizes of the request and response messages.",
            "applicable": true
          },
          {
            "ref": "3.4",
            "title": "Ensure that shared access signature tokens expire within an hour (Not Scored)",
            "summary": "Expire shared access signature tokens within an hour.",
            "applicable": true
          },
          {
            "ref": "3.5",
            "title": "Ensure that shared access signature tokens are allowed only over https (Not Scored)",
            "summary": "Shared access signature tokens should be allowed only over HTTPS protocol.",
            "applicable": true
          },
          {
            "ref": "3.6",
            "title": "Ensure that 'Public access level' is set to Private for blob containers (Scored)",
            "summary": "Disable anonymous access to blob containers.",
            "applicable": true
          },
          {
            "ref": "3.7",
            "title": "Ensure default network access rule for Storage Accounts is set to deny (Scored)",
            "summary": "Restricting default network access helps to provide a new layer of security, since storage accounts accept connections from clients on any network. To limit access to selected networks, the default action must be changed.",
            "applicable": true
          },
          {
            "ref": "3.8",
            "title": "Ensure 'Trusted Microsoft Services' is enabled for Storage Account access (Not Scored)",
            "summary": "Some Microsoft services that interact with storage accounts operate from networks that can't be granted access through network rules. To help this type of service work as intended, allow the set of trusted Microsoft services to bypass the network rules. These services will then use strong authentication to access the storage account. If the Allow trusted Microsoft services exception is enabled, the following services: Azure Backup, Azure Site Recovery, Azure DevTest Labs, Azure Event Grid, Azure Event Hubs, Azure Networking, Azure Monitor and Azure SQL Data Warehouse (when registered in the subscription), are granted access to the storage account.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Database Services",
        "controls": [
          {
            "ref": "4.1",
            "title": "Ensure that 'Auditing' is set to 'On' (Scored)",
            "summary": "Enable auditing on SQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.2",
            "title": "Ensure that 'AuditActionGroups' in 'auditing' policy for a SQL server is set properly (Scored)",
            "summary": "Configure the 'AuditActionGroups' property to appropriate groups to capture all the critical activities on the SQL Server and all the SQL databases hosted on the SQL server.",
            "applicable": true
          },
          {
            "ref": "4.3",
            "title": "Ensure that 'Auditing' Retention is 'greater than 90 days' (Scored)",
            "summary": "SQL Server Audit Retention should be configured to be greater than 90 days.",
            "applicable": true
          },
          {
            "ref": "4.4",
            "title": "Ensure that 'Advanced Data Security' on a SQL server is set to 'On' (Scored)",
            "summary": "Enable \"Advanced Data Security\" on critical SQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.5",
            "title": "Ensure that 'Threat Detection types' is set to 'All' (Scored)",
            "summary": "Enable all types of threat detection on SQL servers.",
            "applicable": true
          },
          {
            "ref": "4.6",
            "title": "Ensure that 'Send alerts to' is set (Scored)",
            "summary": "Provide the email address where alerts will be sent when anomalous activities are detected on SQL servers.",
            "applicable": true
          },
          {
            "ref": "4.7",
            "title": "Ensure that 'Email service and co-administrators' is 'Enabled' (Scored)",
            "summary": "Enable service and co-administrators to receive security alerts from the SQL server.",
            "applicable": true
          },
          {
            "ref": "4.8",
            "title": "Ensure that Azure Active Directory Admin is configured (Scored)",
            "summary": "Use Azure Active Directory Authentication for authentication with SQL Database.",
            "applicable": true
          },
          {
            "ref": "4.9",
            "title": "Ensure that 'Data encryption' is set to 'On' on a SQL Database (Scored)",
            "summary": "Enable Transparent Data Encryption on every SQL server.",
            "applicable": true
          },
          {
            "ref": "4.10",
            "title": "Ensure SQL server's TDE protector is encrypted with BYOK (Use your own key) (Scored)",
            "summary": "TDE with BYOK support provides increased transparency and control over the TDE Protector, increased security with an HSM-backed external service, and promotion of separation of duties.",
            "applicable": true
          },
          {
            "ref": "4.11",
            "title": "Ensure 'Enforce SSL connection' is set to 'ENABLED' for MySQL Database Server (Scored)",
            "summary": "Enable SSL connection on MYSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.12",
            "title": "Ensure server parameter 'log_checkpoints' is set to 'ON' for PostgreSQL Database Server (Scored)",
            "summary": "Enable log_checkpoints on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.13",
            "title": "Ensure 'Enforce SSL connection' is set to 'ENABLED' for PostgreSQL Database Server (Scored)",
            "summary": "Enable SSL connection on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.14",
            "title": "Ensure server parameter 'log_connections' is set to 'ON' for PostgreSQL Database Server (Scored)",
            "summary": "Enable log_connections on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.15",
            "title": "Ensure server parameter 'log_disconnections' is set to 'ON' for PostgreSQL Database Server (Scored)",
            "summary": "Enable log_disconnections on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.16",
            "title": "Ensure server parameter 'log_duration' is set to 'ON' for PostgreSQL Database Server (Scored)",
            "summary": "Enable log_duration on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.17",
            "title": "Ensure server parameter 'connection_throttling' is set to 'ON' for PostgreSQL Database Server (Scored)",
            "summary": "Enable connection_throttling on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.18",
            "title": "Ensure server parameter 'log_retention_days' is greater than 3 days for PostgreSQL Database Server (Scored)",
            "summary": "Enable log_retention_days on PostgreSQL Servers.",
            "applicable": true
          },
          {
            "ref": "4.19",
            "title": "Ensure that Azure Active Directory Admin is configured (Scored)",
            "summary": "Use Azure Active Directory Authentication for authentication with SQL Database.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Logging and Monitoring",
        "controls": [
          {
            "ref": "5.1.1",
            "title": "Ensure that a Log Profile exists (Scored)",
            "summary": "Enable log profile for exporting activity logs.",
            "applicable": true
          },
          {
            "ref": "5.1.2",
            "title": "Ensure that Activity Log Retention is set 365 days or greater (Scored)",
            "summary": "Ensure activity log retention is set for 365 days or greater.",
            "applicable": true
          },
          {
            "ref": "5.1.3",
            "title": "Ensure audit profile captures all the activities (Scored)",
            "summary": "The log profile should be configured to export all activities from the control/management plane.",
            "applicable": true
          },
          {
            "ref": "5.1.4",
            "title": "Ensure the log profile captures activity logs for all regions including global (Scored)",
            "summary": "Configure the log profile to export activities from all Azure supported regions/locations including global.",
            "applicable": true
          },
          {
            "ref": "5.1.5",
            "title": "Ensure the storage container storing the activity logs is not publicly accessible (Scored)",
            "summary": "The storage account container containing the activity log export should not be publicly accessible.",
            "applicable": true
          },
          {
            "ref": "5.1.6",
            "title": "Ensure the storage account containing the container with activity logs is encrypted with BYOK (Use Your Own Key) (Scored)",
            "summary": "The storage account with the activity log export container is configured to use BYOK (Use Your Own Key).",
            "applicable": true
          },
          {
            "ref": "5.1.7",
            "title": "Ensure that logging for Azure KeyVault is 'Enabled' (Scored)",
            "summary": "Enable AuditEvent logging for key vault instances to ensure interactions with key vaults are logged and available.",
            "applicable": true
          },
          {
            "ref": "5.2.1",
            "title": "Ensure that Activity Log Alert exists for Create Policy Assignment (Scored)",
            "summary": "Create an activity log alert for the Create Policy Assignment event.",
            "applicable": true
          },
          {
            "ref": "5.2.2",
            "title": "Ensure that Activity Log Alert exists for Create or Update Network Security Group (Scored)",
            "summary": "Create an Activity Log Alert for the \"Create\" or \"Update Network Security Group\" event.",
            "applicable": true
          },
          {
            "ref": "5.2.3",
            "title": "Ensure that Activity Log Alert exists for Delete Network Security Group (Scored)",
            "summary": "Create an activity log alert for the Delete Network Security Group event.",
            "applicable": true
          },
          {
            "ref": "5.2.4",
            "title": "Ensure that Activity Log Alert exists for Create or Update Network Security Group Rule (Scored)",
            "summary": "Create an activity log alert for the Create or Update Network Security Group Rule event.",
            "applicable": true
          },
          {
            "ref": "5.2.5",
            "title": "Ensure that activity log alert exists for the Delete Network Security Group Rule (Scored)",
            "summary": "Create an activity log alert for the Delete Network Security Group Rule event.",
            "applicable": true
          },
          {
            "ref": "5.2.6",
            "title": "Ensure that Activity Log Alert exists for Create or Update Security Solution (Scored)",
            "summary": "Create an activity log alert for the Create or Update Security Solution event.",
            "applicable": true
          },
          {
            "ref": "5.2.7",
            "title": "Ensure that Activity Log Alert exists for Delete Security Solution (Scored)",
            "summary": "Create an activity log alert for the Delete Security Solution event.",
            "applicable": true
          },
          {
            "ref": "5.2.8",
            "title": "Ensure that Activity Log Alert exists for Create or Update or Delete SQL Server Firewall Rule (Scored)",
            "summary": "Create an activity log alert for the Create or Update or Delete SQL Server Firewall Rule event.",
            "applicable": true
          },
          {
            "ref": "5.2.9",
            "title": "Ensure that Activity Log Alert exists for Update Security Policy (Scored)",
            "summary": "Create an activity log alert for the Update Security Policy event.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Networking",
        "controls": [
          {
            "ref": "6.1",
            "title": "Ensure that RDP access is restricted from the internet (Scored)",
            "summary": "Disable RDP access on network security groups from the Internet.",
            "applicable": true
          },
          {
            "ref": "6.2",
            "title": "Ensure that SSH access is restricted from the internet (Scored)",
            "summary": "Disable SSH access on network security groups from the Internet.",
            "applicable": true
          },
          {
            "ref": "6.3",
            "title": "Ensure no SQL Databases allow ingress 0.0.0.0/0 (ANY IP) (Scored)",
            "summary": "Ensure that no SQL Databases allow ingress from 0.0.0.0/0 (ANY IP).",
            "applicable": true
          },
          {
            "ref": "6.4",
            "title": "Ensure that Network Security Group Flow Log retention period is 'greater than 90 days' (Scored)",
            "summary": "Network Security Group Flow Logs should be enabled and the retention period is set to greater than or equal to 90 days.",
            "applicable": true
          },
          {
            "ref": "6.5",
            "title": "Ensure that Network Watcher is 'Enabled' (Scored)",
            "summary": "Enable Network Watcher for Azure subscriptions.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Virtual Machines",
        "controls": [
          {
            "ref": "7.1",
            "title": "Ensure that 'OS disk' are encrypted (Scored)",
            "summary": "Ensure that OS disks (boot volumes) are encrypted, where possible.",
            "applicable": true
          },
          {
            "ref": "7.2",
            "title": "Ensure that 'Data disks' are encrypted (Scored)",
            "summary": "Ensure that data disks (non-boot volumes) are encrypted, where possible.",
            "applicable": true
          },
          {
            "ref": "7.3",
            "title": "Ensure that 'Unattached disks' are encrypted (Scored)",
            "summary": "Ensure that unattached disks in a subscription are encrypted.",
            "applicable": true
          },
          {
            "ref": "7.4",
            "title": "Ensure that only approved extensions are installed (Not Scored)",
            "summary": "Only install organization-approved extensions on VMs.",
            "applicable": true
          },
          {
            "ref": "7.5",
            "title": "Ensure that the latest OS Patches for all Virtual Machines are applied (Not Scored)",
            "summary": "Ensure that the latest OS patches for all virtual machines are applied.",
            "applicable": true
          },
          {
            "ref": "7.6",
            "title": "Ensure that the endpoint protection for all Virtual Machines is installed (Not Scored)",
            "summary": "Install endpoint protection for all virtual machines.",
            "applicable": true
          }
        ]
      },
      {
        "title": "Other Security Considerations",
        "controls": [
          {
            "ref": "8.1",
            "title": "Ensure that the expiration date is set on all keys (Scored)",
            "summary": "Ensure that all keys in Azure Key Vault have an expiration time set.",
            "applicable": true
          },
          {
            "ref": "8.2",
            "title": "Ensure that the expiration date is set on all Secrets (Scored)",
            "summary": "Ensure that all Secrets in the Azure Key Vault have an expiration time set.",
            "applicable": true
          },
          {
            "ref": "8.3",
            "title": "Ensure that Resource Locks are set for mission critical Azure resources (Not Scored)",
            "summary": "Resource Manager Locks provide a way for administrators to lock down Azure resources to prevent deletion of, or modifications to, a resource. These locks sit outside of the Role Based Access Controls (RBAC) hierarchy and, when applied, will place restrictions on the resource for all users. These are very useful when there is have an important resource in a subscription that users should not be able to delete or change and can help prevent accidental and malicious changes or deletion.",
            "applicable": true
          },
          {
            "ref": "8.4",
            "title": "Ensure the key vault is recoverable (Scored)",
            "summary": "The key vault contains object keys, secrets and certificates. Accidental unavailability of a key vault can cause immediate data loss or loss of security functions (authentication, validation, verification, non-repudiation, etc.) supported by the key vault objects.",
            "applicable": true
          }
        ]
      },
      {
        "title": "AppService",
        "controls": [
          {
            "ref": "9.1",
            "title": "Ensure App Service Authentication is set on Azure App Service (Scored)",
            "summary": "Azure App Service Authentication is a feature that can prevent anonymous HTTP requests from reaching the API app, or authenticate those that have tokens before they reach the API app. If an anonymous request is received from a browser, App Service will redirect to a logon page. To handle the logon process, a choice from a set of identity providers can be made, or a custom authentication mechanism can be implemented.",
            "applicable": true
          },
          {
            "ref": "9.2",
            "title": "Ensure web app redirects all HTTP traffic to HTTPS in Azure App Service (Scored)",
            "summary": "Azure Web Apps allows sites to run under both HTTP and HTTPS by default. Web apps can be accessed by anyone using non-secure HTTP links by default. Non-secure HTTP requests can be restricted and all HTTP requests redirected to the secure HTTPS port. It is recommended to enforce HTTPS-only traffic.",
            "applicable": true
          },
          {
            "ref": "9.3",
            "title": "Ensure web app is using the latest version of TLS encryption (Scored)",
            "summary": "The TLS(Transport Layer Security) protocol secures transmission of data over the internet using standard encryption technology. Encryption should be set with the latest version of TLS. App service allows TLS 1.2 by default, which is the recommended TLS level by industry standards, such as PCI DSS.",
            "applicable": true
          },
          {
            "ref": "9.4",
            "title": "Ensure the web app has 'Client Certificates (Incoming client certificates)' set to 'On' (Scored)",
            "summary": "Client certificates allow for the app to request a certificate for incoming requests. Only clients that have a valid certificate will be able to reach the app.",
            "applicable": true
          },
          {
            "ref": "9.5",
            "title": "Ensure that Register with Azure Active Directory is enabled on App Service (Scored)",
            "summary": "Managed service identity in App Service makes the app more secure by eliminating secrets from the app, such as credentials in the connection strings. When registering with Azure Active Directory in the app service, the app will connect to other Azure services securely without the need of username and passwords.",
            "applicable": true
          },
          {
            "ref": "9.6",
            "title": "Ensure that '.Net Framework' version is the latest",
            "summary": "Periodically, newer versions are released for .Net Framework software either due to security flaws or to include additional functionality. Using the latest .Net framework version for web apps is recommended in order to to take advantage of security fixes, if any, and/or new functionalities of the latest version.",
            "applicable": true
          },
          {
            "ref": "9.7",
            "title": "Ensure that 'PHP version' is the latest",
            "summary": "Periodically newer versions are released for PHP software either due to security flaws or to include additional functionality. Using the latest PHP version for web apps is recommended in order to take advantage of security fixes, if any, and/or additional functionalities of the newer version.",
            "applicable": true
          },
          {
            "ref": "9.8",
            "title": "Ensure that 'Python version' is the latest",
            "summary": "Periodically, newer versions are released for Python software either due to security flaws or to include additional functionality. Using the latest Python version for web apps is recommended in order to take advantage of security fixes, if any, and/or additional functionalities of the newer version.",
            "applicable": true
          },
          {
            "ref": "9.9",
            "title": "Ensure that 'Java version' is the latest",
            "summary": "Periodically, newer versions are released for Java software either due to security flaws or to include additional functionality. Using the latest Java version for web apps is recommended in order to take advantage of security fixes, if any, and/or new functionalities of the newer version.",
            "applicable": true
          },
          {
            "ref": "9.10",
            "title": "Ensure that 'HTTP Version' is the latest",
            "summary": "Periodically, newer versions are released for HTTP either due to security flaws or to include additional functionality. Using the latest HTTP version for web apps to take advantage of security fixes, if any, and/or new functionalities of the newer version.",
            "applicable": true
          }
        ]
      }
    ]
  }