{
  "standard": "HITRUST CSF",
  "version": "9.2",
  "webLink": "https://hitrustalliance.net/documents/csf_rmf_related/v9/CSF_v92_Package.zip",
  "sections": [
    {
      "title": "0 - Information Security Management Program",
      "requirements": [
        {
          "ref": "00.a",
          "title": "Information Security Management Program",
          "summary": "An Information Security Management Program (ISMP) shall be defined in terms of the characteristics of the business and established and managed including monitoring, maintenance and improvement."
        }
      ]
    },
    {
      "title": "1 - Access Control",
      "requirements": [
        {
          "ref": "01.a",
          "title": "Access Control Policy",
          "summary": "An access control policy shall be established, documented, and reviewed based on business and security requirements for access."
        },
        {
          "ref": "01.b",
          "title": "User Registration",
          "summary": "Document and implement user registration and deregistration procedures for granting and revoking access. Maintain a current listing of all workforce members (individuals, contractors, vendors, business partners, etc.) with access to covered information (e.g., PHI/PII). Do not use group, shared or generic accounts and passwords. Use multi-factor authentication (MFA)."
        },
        {
          "ref": "01.c",
          "title": "Privilege Management",
          "summary": "The allocation and use of privileges to information systems and services shall be restricted and controlled. Implement least privileged access and role-based access control or stronger mechanism. Default access to 'deny-all'."
        },
        {
          "ref": "01.d",
          "title": "User Password Management",
          "summary": "Passwords shall be controlled through a formal management process. Password policy requirements including length, complexity, age, history, etc. should be defined and enforced."
        },
        {
          "ref": "01.e",
          "title": "Review of User Access Rights",
          "summary": "All access rights shall be regularly reviewed by management via a formal documented process. Maintain a documented list of authorized users of information assets."
        },
        {
          "ref": "01.f",
          "title": "Password Use",
          "summary": "Users are made aware of the organization's password policies and requirements."
        },
        {
          "ref": "01.g",
          "title": "Unattended User Equipment",
          "summary": "Users shall ensure that unattended equipment has appropriate protection, such as terminating active sessions / logging off when finished."
        },
        {
          "ref": "01.h",
          "title": "Clear Desk and Clear Screen Policy",
          "summary": "A clear desk policy for papers and removable storage media and a clear screen policy for information assets shall be adopted."
        },
        {
          "ref": "01.i",
          "title": "Policy on the Use of Network Services",
          "summary": "Users shall only be provided with access to internal and external network services that they have been specifically authorized to use. Authentication and authorization mechanisms shall be applied for users and equipment."
        },
        {
          "ref": "01.j",
          "title": "User Authentication for External Connections",
          "summary": "Authentication of remote users is implemented using a password or passphrase and at least one additional factor/method. VPN is required for remote network access. Monitor remote access and privileged command execution."
        },
        {
          "ref": "01.k",
          "title": "Equipment Identification in Networks",
          "summary": "Identify and authenticate equipment connecting to the networks."
        },
        {
          "ref": "01.l",
          "title": "Remote Diagnostic and Configuration Port Protection",
          "summary": "Access to network equipment is physically protected (e.g. access control to network/server rooms). Access to diagnostic and configuration ports should be controlled and regularly reviewed. Disable unnecessary and non-secure functions, ports, protocols, and/or services."
        },
        {
          "ref": "01.m",
          "title": "Segregation in Networks",
          "summary": "Groups of information services, users, and information systems should be segregated on networks. Internal network perimeters shall be implemented by installing a secure gateway between interconnected networks (internal, external, DMZ, wireless networks) to control access and information flow."
        },
        {
          "ref": "01.n",
          "title": "Network Connection Control",
          "summary": "Network access (e.g. firewall rules) should have default deny rule. Restrict network access in accordance with the access control policy and the requirements of the business applications."
        },
        {
          "ref": "01.o",
          "title": "Network Routing Control",
          "summary": "Security gateways (e.g., a firewall) are used between internal and external networks. Internal IP addresses are protected from external exposure (e.g. using private IP and NAT)."
        },
        {
          "ref": "01.p",
          "title": "Secure Log-on Procedures",
          "summary": "Access to operating systems shall be controlled by a secure log-on procedure. Record logon attempts; limit the number of unsuccessful log-on attempts allowed to six (6) or fewer attempts; enforce a 30-minute or longer account lockout timeout; mask passwords when entered."
        },
        {
          "ref": "01.q",
          "title": "User Identification and Authentication",
          "summary": "All users shall have a unique identifier and authenticated before allowing access to system components or data."
        },
        {
          "ref": "01.r",
          "title": "Password Management System",
          "summary": "Systems for managing passwords shall be interactive and shall ensure quality passwords."
        },
        {
          "ref": "01.s",
          "title": "Use of System Utilities",
          "summary": "The use of utility programs that might be capable of overriding system and application controls shall be restricted and tightly controlled."
        },
        {
          "ref": "01.t",
          "title": "Session Time-out",
          "summary": "Inactive sessions shall shut down after a defined period of inactivity."
        },
        {
          "ref": "01.u",
          "title": "Limitation of Connection Time",
          "summary": "Restrictions on connection times shall be used to provide additional security for high-risk applications."
        },
        {
          "ref": "01.v",
          "title": "Information Access Restriction",
          "summary": "Logical and physical access to information and application systems and functions by users and support personnel shall be restricted in accordance with the defined access control policy."
        },
        {
          "ref": "01.w",
          "title": "Sensitive System Isolation",
          "summary": "Sensitive systems shall have a dedicated and isolated computing environment."
        },
        {
          "ref": "01.x",
          "title": "Mobile Computing and Communications",
          "summary": "A formal policy shall be in place, and appropriate security measures shall be adopted to protect against the risks of using mobile computing and communication devices."
        },
        {
          "ref": "01.y",
          "title": "Teleworking",
          "summary": "The following must be address for teleworking: anti-virus protection, operating system and application patching, and firewall should be enabled."
        }
      ]
    },
    {
      "title": "2 - Human Resources Security",
      "requirements": [
        {
          "ref": "02.a",
          "title": "Roles and Responsibilities",
          "summary": "Security roles and responsibilities of employees, contractors and third-party users shall be defined and documented in accordance with the organization's information security policy."
        },
        {
          "ref": "02.b",
          "title": "Screening",
          "summary": "Background verification checks on all candidates for employment, contractors, and third-party users shall be carried out in accordance with relevant laws, regulations and ethics, and proportional to the business requirements, the classification of the information to be accessed, and the perceived risks."
        },
        {
          "ref": "02.c",
          "title": "Terms and Conditions of Employment",
          "summary": "As part of their contractual obligation, employees, contractors and third-party users shall agree and sign the terms and conditions of their employment contract, which shall include their responsibilities for information security."
        },
        {
          "ref": "02.d",
          "title": "Management Responsibilities",
          "summary": "Management shall require employees, and where applicable contractors and third-party users, to apply security in accordance with established policies and procedures of the organization."
        },
        {
          "ref": "02.e",
          "title": "Information Security Awareness, Education, and Training",
          "summary": "All employees of the organization and contractors and third-party users shall receive appropriate awareness training and regular updates in organizational policies and procedures, as relevant for their job function."
        },
        {
          "ref": "02.f",
          "title": "Disciplinary Process",
          "summary": "There shall be a formal disciplinary process for employees who have violated security policies and procedures."
        },
        {
          "ref": "02.g",
          "title": "Termination or Change Responsibilities",
          "summary": "Responsibilities for performing employment termination or change of employment shall be clearly defined and assigned."
        },
        {
          "ref": "02.h",
          "title": "Return of Assets",
          "summary": "All employees, contractors and third-party users shall return all of the organization's assets in their possession upon termination of their employment, contract or agreement."
        },
        {
          "ref": "02.i",
          "title": "Removal of Access Rights",
          "summary": "The access rights of all employees, contractors and third-party users to information and information assets shall be removed upon termination of their employment, contract or agreement, or adjusted upon a change of employment."
        }
      ]
    },
    {
      "title": "3 - Risk Management",
      "requirements": [
        {
          "ref": "03.a",
          "title": "Risk Management Program Development",
          "summary": "Organizations shall develop and maintain a risk management program to manage risk to an acceptable level."
        },
        {
          "ref": "03.b",
          "title": "Performing Risk Assessments",
          "summary": "Risk Assessments shall be performed to identify and quantify risks."
        },
        {
          "ref": "03.c",
          "title": "Risk Mitigation",
          "summary": "Risks shall be mitigated to an acceptable level."
        },
        {
          "ref": "03.d",
          "title": "Risk Evaluation",
          "summary": "Risks shall be continually evaluated and assessed. The risk management program includes the requirement that risk assessments be re-evaluated at least annually, or when there are significant changes in the environment."
        }
      ]
    },
    {
      "title": "4 - Security Policy",
      "requirements": [
        {
          "ref": "04.a",
          "title": "Information Security Policy Document",
          "summary": "Information security policy documents are developed, published, disseminated and implemented."
        },
        {
          "ref": "04.b",
          "title": "Review of the Information Security Policy",
          "summary": "The information security policy documents shall be reviewed at planned intervals or if significant changes occur to ensure its continuing adequacy and effectiveness."
        }
      ]
    },
    {
      "title": "5 - Organization of Information Security",
      "requirements": [
        {
          "ref": "05.a",
          "title": "Management Commitment to Information Security",
          "summary": "Management shall appoint a senior information security officer and actively support security within the organization through clear direction, demonstrated commitment, explicit assignment, and acknowledgment of information security responsibilities."
        },
        {
          "ref": "05.b",
          "title": "Information Security Coordination",
          "summary": "Information security activities shall be coordinated by representatives from different parts of the organization with relevant roles and job functions."
        },
        {
          "ref": "05.c",
          "title": "Allocation of Information Security Responsibilities",
          "summary": "All information security responsibilities shall be clearly defined."
        },
        {
          "ref": "05.d",
          "title": "Authorization Process for Information Assets and Facilities",
          "summary": "A management authorization process for new information assets (e.g. systems and applications) (see Other Information), and facilities (e.g. data centers or offices where covered information is to be processed) shall be defined and implemented."
        },
        {
          "ref": "05.e",
          "title": "Confidentiality Agreements",
          "summary": "Requirements for confidentiality or non-disclosure agreements reflecting the organization's needs for the protection of information shall be identified and regularly reviewed."
        },
        {
          "ref": "05.f",
          "title": "Contact with Authorities",
          "summary": "Appropriate contacts with relevant authorities shall be maintained."
        },
        {
          "ref": "05.g",
          "title": "Contact with Special Interest Groups",
          "summary": "Appropriate contacts with special interest groups or other specialist security forums and professional associations shall be maintained."
        },
        {
          "ref": "05.h",
          "title": "Independent Review of Information Security",
          "summary": "The organization's approach to managing information security and its implementation (control objectives, controls, policies, processes, and procedures for information security) shall be reviewed independently at planned intervals, at a minimum annually, or when significant changes to the security implementation occur."
        },
        {
          "ref": "05.i",
          "title": "Identification of Risks Related to External Parties",
          "summary": "Organizations must show due diligence managing the information security risks posed by external parties. This includes maintaining an updated list of external vendors, their access to data/systems, contractual and legal agreements, and information security reviews. This list shall contain all in scope vendors and links to the appropriate agreements and review documents."
        },
        {
          "ref": "05.j",
          "title": "Addressing Security When Dealing with Customers",
          "summary": "All identified security requirements shall be addressed before giving customers access to the organization's information or assets."
        },
        {
          "ref": "05.k",
          "title": "Addressing Security in Third Party Agreements",
          "summary": "Agreements with third parties involving accessing, processing, communicating or managing the organization's information or information assets, or adding products or services to information assets shall cover all relevant security requirements."
        }
      ]
    },
    {
      "title": "6 - Compliance",
      "requirements": [
        {
          "ref": "06.a",
          "title": "Identification of Applicable Legislation",
          "summary": "All relevant statutory, regulatory, and contractual requirements and the organization's approach to meet these requirements shall be explicitly defined, documented, and kept up to date for each information system and the organization."
        },
        {
          "ref": "06.b",
          "title": "Intellectual Property Rights",
          "summary": "Detailed procedures shall be implemented to ensure compliance with legislative, regulatory, and contractual requirements on the use of material in respect of which there may be intellectual property rights, and on the use of proprietary software products."
        },
        {
          "ref": "06.c",
          "title": "Protection of Organizational Records",
          "summary": "Important records shall be protected from loss, destruction, and falsification, in accordance with statutory, regulatory, contractual, and business requirements."
        },
        {
          "ref": "06.d",
          "title": "Data Protection and Privacy of Covered Information",
          "summary": "Data protection and privacy shall be ensured as required in relevant legislation, regulations, and contractual clauses."
        },
        {
          "ref": "06.e",
          "title": "Prevention of Misuse of Information Assets",
          "summary": "Users shall be deterred from using information assets for unauthorized purposes."
        },
        {
          "ref": "06.f",
          "title": "Regulation of Cryptographic Controls",
          "summary": "Cryptographic controls shall be used in compliance with all relevant agreements, laws, and regulations."
        },
        {
          "ref": "06.g",
          "title": "Compliance with Security Policies and Standards",
          "summary": "Managers shall ensure that all security procedures within their area of responsibility are carried out correctly to achieve compliance with security policies and standards."
        },
        {
          "ref": "06.h",
          "title": "Technical Compliance Checking",
          "summary": "Information systems shall be regularly checked for compliance with security implementation standards."
        },
        {
          "ref": "06.i",
          "title": "Information Systems Audit Controls",
          "summary": "Audit requirements and activities involving checks on operational systems shall be carefully planned and agreed to, to minimize the risk of disruptions to business processes."
        },
        {
          "ref": "06.j",
          "title": "Protection of Information Systems Audit Tools",
          "summary": "Access to information systems audit tools shall be protected to prevent any possible misuse or compromise."
        }
      ]
    },
    {
      "title": "7 - Asset Management",
      "requirements": [
        {
          "ref": "07.a",
          "title": "Inventory of Assets",
          "summary": "Identify and inventory all assets. The catalog should include key metadata/tags for each asset including owner, classification, data encryption status, and whether the asset contains PII/ePHI. Additionally, production assets containing classified and sensitive data should be encrypted."
        },
        {
          "ref": "07.b",
          "title": "Ownership of Assets",
          "summary": "All information and assets associated with information processing systems shall be owned by a designated part of the organization."
        },
        {
          "ref": "07.c",
          "title": "Acceptable Use of Assets",
          "summary": "Rules for the acceptable use of information and assets associated with information processing systems shall be identified, documented, and implemented."
        },
        {
          "ref": "07.d",
          "title": "Classification Guidelines",
          "summary": "Information shall be classified in terms of its value, legal requirements, sensitivity, and criticality to the organization. While classification and labeling is specifically required for covered information (e.g. PII/PHI), it is a best practice to classify and label all data stores."
        },
        {
          "ref": "07.e",
          "title": "Information Labeling and Handling",
          "summary": "Data must be labeled and handled according to its classification. While classification and labeling is specifically required for covered information (e.g. PII/PHI), it is a best practice to classify and label all data stores."
        }
      ]
    },
    {
      "title": "8 - Physical and Environmental Security",
      "requirements": [
        {
          "ref": "08.a",
          "title": "Physical Security Perimeter",
          "summary": "Security perimeters (barriers such as walls, card-controlled entry gates or manned reception desks) shall be used to protect areas that contain information and information assets."
        },
        {
          "ref": "08.b",
          "title": "Physical Entry Controls",
          "summary": "Secure areas shall be protected by appropriate entry controls to ensure that only authorized personnel are allowed access."
        },
        {
          "ref": "08.c",
          "title": "Securing Offices, Rooms, and Facilities",
          "summary": "Physical security for offices, rooms, and facilities shall be designed and applied."
        },
        {
          "ref": "08.d",
          "title": "Protecting Against External and Environmental Threats",
          "summary": "Physical protection against damage from fire, flood, earthquake, explosion, civil unrest, and other forms of natural or man-made disaster shall be designed and applied."
        },
        {
          "ref": "08.e",
          "title": "Working in Secure Areas",
          "summary": "Physical protection and guidelines for working in secure areas shall be designed and applied."
        },
        {
          "ref": "08.f",
          "title": "Public Access, Delivery, and Loading Areas",
          "summary": "Access points such as delivery and loading areas and other points where unauthorized persons may enter the premises shall be controlled and, if possible, isolated from information processing facilities to avoid unauthorized access."
        },
        {
          "ref": "08.g",
          "title": "Equipment Siting and Protection.",
          "summary": "Equipment shall be sited or protected to reduce the risks from environmental threats and hazards, and opportunities for unauthorized access."
        },
        {
          "ref": "08.h",
          "title": "Supporting Utilities",
          "summary": "Equipment shall be protected from power failures and other disruptions caused by failures in supporting utilities."
        },
        {
          "ref": "08.i",
          "title": "Cabling Security",
          "summary": "Power and telecommunications cabling carrying data or supporting information services shall be protected from interception or damage."
        },
        {
          "ref": "08.j",
          "title": "Equipment Maintenance",
          "summary": "Equipment shall be correctly maintained to ensure its continued availability and integrity."
        },
        {
          "ref": "08.k",
          "title": "Security of Equipment Off-Premises",
          "summary": "Security shall be applied to off-site equipment taking into account the different risks of working outside the organization's premises. Surplus equipment must be stored securely while not in use, and disposed of or sanitized when no longer required. For each disposed device on this list, you should also have corresponding evidence to support the secure removal of data on each device to render information unusable, unreadable, or indecipherable, such as output or screenshot of secure disk wiping."
        },
        {
          "ref": "08.l",
          "title": "Secure Disposal or Re-Use of Equipment",
          "summary": "All items of equipment containing storage media shall be checked to ensure that any covered information and licensed software has been removed or securely overwritten prior to disposal."
        },
        {
          "ref": "08.m",
          "title": "Removal of Property",
          "summary": "Equipment, information or software shall not be taken off site without prior authorization."
        }
      ]
    },
    {
      "title": "9 - Communications and Operations Management",
      "requirements": [
        {
          "ref": "09.a",
          "title": "Documented Operations Procedures",
          "summary": "Operating procedures shall be documented, maintained, and made available to all users who need them."
        },
        {
          "ref": "09.b",
          "title": "Change Management",
          "summary": "Changes to information assets and systems shall be controlled and archived."
        },
        {
          "ref": "09.c",
          "title": "Segregation of Duties",
          "summary": "Separation of duties shall be enforced to reduce opportunities for unauthorized or unintentional modification or misuse of the organization's assets."
        },
        {
          "ref": "09.d",
          "title": "Separation of Development, Test, and Operational Environments",
          "summary": "Development, test, and operational environments shall be separated and controlled to reduce the risks of unauthorized access or changes to the operational system."
        },
        {
          "ref": "09.e",
          "title": "Service Delivery",
          "summary": "It shall be ensured that the security controls, service definitions and delivery levels included in the third-party service delivery agreement are implemented, operated and maintained by the third party."
        },
        {
          "ref": "09.f",
          "title": "Monitoring and Review of Third-Party Services",
          "summary": "The services, reports and records provided by the third party shall be regularly monitored and reviewed, and audits shall be carried out regularly to govern and maintain compliance with the service delivery agreements."
        },
        {
          "ref": "09.g",
          "title": "Managing Changes to Third Party Services",
          "summary": "Changes to the provision of services, including maintaining and improving existing information security policies, procedures and controls, shall be managed, taking account of the criticality of business systems and processes involved and re-assessment of risks."
        },
        {
          "ref": "09.h",
          "title": "Capacity Management",
          "summary": "The availability of adequate capacity and resources shall be planned, prepared, and managed to deliver the required system performance. Projections of future capacity requirements shall be made to mitigate the risk of system overload."
        },
        {
          "ref": "09.i",
          "title": "System Acceptance",
          "summary": "Acceptance criteria for new information systems, upgrades, and new versions shall be established and suitable tests of the system(s) carried out during development and prior to acceptance to maintain security."
        },
        {
          "ref": "09.j",
          "title": "Controls Against Malicious Code",
          "summary": "Detection, prevention, and recovery controls shall be implemented to protect against malicious code, and appropriate user awareness procedures on malicious code shall be provided."
        },
        {
          "ref": "09.k",
          "title": "Controls Against Mobile Code",
          "summary": "Mobile code shall be authorized before its installation and use, and the configuration shall ensure that the authorized mobile code operates according to a clearly defined security policy. All unauthorized mobile code shall be prevented from executing."
        },
        {
          "ref": "09.l",
          "title": "Back-up",
          "summary": "Back-up copies of information and software shall be taken and tested regularly."
        },
        {
          "ref": "09.m",
          "title": "Network Controls",
          "summary": "Networks shall be managed and controlled in order to protect the organization from threats and to maintain security for the systems and applications using the network, including information in transit. Implement firewalls between any wireless networks and the covered information system's environment. Configure these firewalls to deny or control any traffic from a wireless environment into the covered data environment. Firewall rules should default to deny and restrict inbound and outbound traffic to that which is necessary for the covered information system's environment."
        },
        {
          "ref": "09.n",
          "title": "Security of Network Services",
          "summary": "Security features, service levels, and management requirements of all network services shall be identified and included in any network services agreement, whether these services are provided in-house or outsourced."
        },
        {
          "ref": "09.o",
          "title": "Management of Removable Media",
          "summary": "Formal procedures shall be documented and implemented for the management of removable media. Limit the use of removable media to those with a valid business need. Media containing covered information is encrypted. Secure media access and transport."
        },
        {
          "ref": "09.p",
          "title": "Disposal of Media",
          "summary": "Media shall be disposed of securely and safely when no longer required, using formal procedures that are documented."
        },
        {
          "ref": "09.q",
          "title": "Information Handling Procedures",
          "summary": "Procedures for the handling and storage of information shall be established to protect this information from unauthorized disclosure or misuse."
        },
        {
          "ref": "09.r",
          "title": "Security of System Documentation",
          "summary": "System documentation shall be protected against unauthorized access."
        },
        {
          "ref": "09.s",
          "title": "Information Exchange Policies and Procedures",
          "summary": "Formal exchange policies, procedures, and controls shall be in place to protect the exchange of information through the use of all types of communication mediums."
        },
        {
          "ref": "09.t",
          "title": "Exchange Agreements",
          "summary": "Agreements shall be established and implemented for the exchange of information and software between the organization and external parties."
        },
        {
          "ref": "09.u",
          "title": "Physical Media in Transit",
          "summary": "Media containing information shall be protected against unauthorized access, misuse or corruption during transportation beyond the organization's physical boundaries."
        },
        {
          "ref": "09.v",
          "title": "Electronic Messaging",
          "summary": "Information involved in electronic messaging shall be appropriately protected."
        },
        {
          "ref": "09.w",
          "title": "Interconnected Business Information Systems",
          "summary": "Policies and procedures shall be developed and implemented to protect information associated with the interconnection of business information systems."
        },
        {
          "ref": "09.x",
          "title": "Electronic Commerce Services",
          "summary": "Information involved in electronic commerce passing over public networks shall be protected from fraudulent activity, contract dispute, and unauthorized disclosure or modification."
        },
        {
          "ref": "09.y",
          "title": "On-line Transactions",
          "summary": "Information involved in online transactions shall be protected to prevent incomplete transmission, misrouting, unauthorized message alteration, unauthorized disclosure, unauthorized message duplication or replay."
        },
        {
          "ref": "09.z",
          "title": "Publicly Available Information",
          "summary": "The integrity of information being made available on a publicly available system shall be protected to prevent unauthorized modification."
        },
        {
          "ref": "09.aa",
          "title": "Audit Logging",
          "summary": "Audit logs recording user activities, exceptions, and information security events shall be produced and kept for an agreed period to assist in future investigations and access control monitoring."
        },
        {
          "ref": "09.ab",
          "title": "Monitoring System Use",
          "summary": "Implement host-based security controls to monitor system use including authorized access and unauthorized access attempts. Procedures for monitoring use of information processing systems and facilities shall be established to check for use and effectiveness of implemented controls. The results of the monitoring activities shall be reviewed regularly. "
        },
        {
          "ref": "09.ac",
          "title": "Protection of Log Information",
          "summary": "Logging systems and log information shall be protected against tampering and unauthorized access. Implement file integrity monitoring and access control to logs."
        },
        {
          "ref": "09.ad",
          "title": "Administrator and Operator Logs",
          "summary": "System administrator and system operator activities shall be logged and regularly reviewed."
        },
        {
          "ref": "09.ae",
          "title": "Fault Logging",
          "summary": "Faults shall be logged, analyzed, and appropriate remediation action taken."
        },
        {
          "ref": "09.af",
          "title": "Clock Synchronization",
          "summary": "The clocks of all relevant information processing systems within the organization or security domain shall be synchronized with an agreed accurate time source to support tracing and reconstitution of activity timelines."
        }
      ]
    },
    {
      "title": "10 - Information Systems Acquisition, Development, and Maintenance",
      "requirements": [
        {
          "ref": "10.a",
          "title": "Security Requirements Analysis and Specification",
          "summary": "Statements of business requirements for new information systems (developed or purchased), or enhancements to existing information systems shall specify the requirements for security controls."
        },
        {
          "ref": "10.b",
          "title": "Input Data Validation",
          "summary": "Data input to applications and databases shall be validated to ensure that this data is correct and appropriate."
        },
        {
          "ref": "10.c",
          "title": "Control of Internal Processing",
          "summary": "Validation checks shall be incorporated into applications to detect any corruption of information through processing errors or deliberate acts."
        },
        {
          "ref": "10.d",
          "title": "Message Integrity",
          "summary": "Requirements for ensuring authenticity and protecting message integrity in applications shall be identified and controls implemented."
        },
        {
          "ref": "10.e",
          "title": "Output Data Validation",
          "summary": "Data output from an application shall be validated to ensure that the processing of stored information is correct and appropriate to the circumstances."
        },
        {
          "ref": "10.f",
          "title": "Policy on the Use of Cryptographic Controls",
          "summary": "A policy on the use of cryptographic controls for protection of information shall be developed and implemented, and supported by formal procedures."
        },
        {
          "ref": "10.g",
          "title": "Key Management",
          "summary": "Key management shall be in place to support the organization's use of cryptographic techniques."
        },
        {
          "ref": "10.h",
          "title": "Control of Operational Software",
          "summary": "Control the installation of software on operational systems. Maintain information systems according to a current baseline configuration and configure system security parameters to prevent misuse. Implement host-based / local firewalls to monitor and prevent unauthorized access attempts. Endpoint systems shall have anti-malware protection."
        },
        {
          "ref": "10.i",
          "title": "Protection of System Test Data",
          "summary": "Test data shall be selected carefully, and protected and controlled in nonproduction environments."
        },
        {
          "ref": "10.j",
          "title": "Access Control to Program Source Code",
          "summary": "Access to program source code shall be restricted."
        },
        {
          "ref": "10.k",
          "title": "Change Control Procedures",
          "summary": "The implementation of changes, including patches, service packs, and other updates and modifications, shall be controlled by the use of formal change control procedures."
        },
        {
          "ref": "10.l",
          "title": "Outsourced Software Development",
          "summary": "Outsourced software development shall be supervised and monitored by the organization."
        },
        {
          "ref": "10.m",
          "title": "Control of Technical Vulnerabilities",
          "summary": "Timely information about technical vulnerabilities of information systems being used shall be obtained; the organization's exposure to such vulnerabilities evaluated; and appropriate measures taken to address the associated risk. Patches are applied to all systems."
        }
      ]
    },
    {
      "title": "11 - Information Security Incident Management",
      "requirements": [
        {
          "ref": "11.a",
          "title": "Reporting Information Security Events",
          "summary": "Information security events shall be reported through appropriate communications channels as quickly as possible. All employees, contractors and third-party users shall be made aware of their responsibility to report any information security events as quickly as possible."
        },
        {
          "ref": "11.b",
          "title": "Reporting Security Weaknesses",
          "summary": "All employees, contractors, and third-party users of information systems and services shall be required to note and report any observed or suspected security weaknesses in systems or services."
        },
        {
          "ref": "11.c",
          "title": "Responsibilities and Procedures",
          "summary": "Management responsibilities and procedures shall be established to ensure a quick, effective, and orderly response to information security incidents."
        },
        {
          "ref": "11.d",
          "title": "Learning from Information Security Incidents",
          "summary": "There shall be mechanisms in place to enable the types, volumes, and costs of information security incidents to be quantified and monitored."
        },
        {
          "ref": "11.e",
          "title": "Collection of Evidence",
          "summary": "Where a follow-up action against a person or organization after an information security incident involves legal action (either civil or criminal), evidence shall be collected, retained, and presented in support of potential legal action in accordance with the rules for evidence in the relevant jurisdiction(s)."
        }
      ]
    },
    {
      "title": "12 - Business Continuity Management",
      "requirements": [
        {
          "ref": "12.a",
          "title": "Including Information Security in the Business Continuity Management Process",
          "summary": "A managed program and process shall be developed and maintained for business continuity throughout the organization that addresses the information security requirements needed for the organization's business continuity."
        },
        {
          "ref": "12.b",
          "title": "Business Continuity and Risk Assessment",
          "summary": "Events that can cause interruptions to business processes shall be identified, along with the probability and impact of such interruptions and their consequences for information security."
        },
        {
          "ref": "12.c",
          "title": "Developing and Implementing Continuity Plans Including Information Security",
          "summary": "Plans shall be developed and implemented to maintain or restore operations and ensure availability of information, at the required level and in the required time scales, following interruption to, or failure of, critical business processes."
        },
        {
          "ref": "12.d",
          "title": "Business Continuity Planning Framework",
          "summary": "A single framework of business continuity plans shall be maintained to ensure all plans are consistent, to consistently address information security requirements, and to identify priorities for testing and maintenance."
        },
        {
          "ref": "12.e",
          "title": "Testing, Maintaining and Re-Assessing Business Continuity Plans",
          "summary": "Business continuity plans shall be tested and updated regularly, at a minimum annually, to ensure that they are up to date and effective."
        }
      ]
    },
    {
      "title": "13 - Privacy Practices",
      "requirements": [
        {
          "ref": "13.a",
          "title": "Privacy Notice",
          "summary": "Data Subjects have a right to adequate and easily accessible notice of the use and disclosures of their PII that may be made by the PII controller, and of the data subject's rights and the controller’s legal duties with respect to PII."
        },
        {
          "ref": "13.b",
          "title": "Openness and Transparency",
          "summary": "To provide data subjects with clear and easily accessible information about the PII controller’s policies, procedures and practices with respect to the handling of PII."
        },
        {
          "ref": "13.c",
          "title": "Accounting of Disclosures",
          "summary": "To ensure that disclosures of PII, especially to third parties, are recorded. To ensure the PII processor notifies the PII controller of any legally binding requests for disclosure of PII. Provisions for the use of subcontractors to process PII should be specified in the contract between the PII processor and the PII controller."
        },
        {
          "ref": "13.d",
          "title": "Consent",
          "summary": "To make data subjects active participants in the decision-making process regarding the processing of their PII, except as otherwise limited by legislation and regulations, through the exercise of meaningful, informed and freely given consent."
        },
        {
          "ref": "13.e",
          "title": "Choice",
          "summary": "To present to data subjects, where appropriate and feasible, the choice not to allow the processing of their PII, to refuse or withdraw consent or to oppose a specific type of processing, and to explain to data subjects the implications of granting or refusing consent."
        },
        {
          "ref": "13.f",
          "title": "Principle Access",
          "summary": "To give data subjects the ability to access and review their PII and to challenge its accuracy and completeness."
        },
        {
          "ref": "13.g",
          "title": "Purpose Legitimacy",
          "summary": "To ensure that the purpose(s) for processing PII complies with applicable laws and relies on a permissible legal ground."
        },
        {
          "ref": "13.h",
          "title": "Purpose Specification",
          "summary": "To specify the purposes for which PII are collected no later than at the time of PII collection where feasible and limit the subsequence use to the fulfillment of original purposes."
        },
        {
          "ref": "13.i",
          "title": "Collection Limitation",
          "summary": "To limit the collection of PII to that which is within the boundaries of applicable law and strictly necessary for the specified purpose(s)."
        },
        {
          "ref": "13.j",
          "title": "Data Minimization",
          "summary": "To minimize the PII which is processed to what is strictly necessary for the legitimate interest pursued by the PII controller and to limit the disclosure of PII to a minimum number of internal and external parties."
        },
        {
          "ref": "13.k",
          "title": "Use and Disclosure",
          "summary": "To limit the use and disclosure of PII for specific, explicit and legitimate purposes and to fulfill the stated purpose(s) or to abide by applicable laws."
        },
        {
          "ref": "13.l",
          "title": "Retention and Disposal",
          "summary": "To retain PII no longer than necessary to fulfill the stated purpose(s) or to abide by applicable laws."
        },
        {
          "ref": "13.m",
          "title": "Accuracy and Quality",
          "summary": "To ensure that the PII processed is accurate, complete, up-to-date, adequate and relevant for the purpose of use."
        },
        {
          "ref": "13.n",
          "title": "Participation and Redress",
          "summary": "To provide any amendment, correction or removal to PII processors and third parties to whom personal data had been disclosed."
        },
        {
          "ref": "13.o",
          "title": "Compliant Management",
          "summary": "To set up efficient internal complaint handling and redress procedures for use by data subjects."
        },
        {
          "ref": "13.p",
          "title": "Governance",
          "summary": "To establish efficient governance for PII processing."
        },
        {
          "ref": "13.q",
          "title": "Privacy and Impact Assessment",
          "summary": "To establish a privacy impact assessment process and to perform a privacy impact assessment as necessary."
        },
        {
          "ref": "13.r",
          "title": "Privacy Requirements for Contractors and Processors",
          "summary": "To ensure, through contractual or other means, that third party recipients provide at least equivalent levels of PII protection."
        },
        {
          "ref": "13.s",
          "title": "Privacy Monitoring and Auditing",
          "summary": "To monitor and audit PII protection controls and the effectiveness of internal PII protection policy."
        },
        {
          "ref": "13.t",
          "title": "Privacy Protection Awareness and Training",
          "summary": "To provide suitable training and awareness concerning PII protection for the personnel of the PII controller who will have access to PII."
        },
        {
          "ref": "13.u",
          "title": "Privacy Protection Reporting",
          "summary": "To develop, disseminate and update PII protection reports."
        }
      ]
    }
  ],
  "domains": [
    {
      "title": "01 Information Protection Program",
      "description": "Includes the information security management system (ISMS)",
      "controls": [
        {
          "ref": "0101.00a1Organizational.123",
          "summary": "The organization has a formal information protection program based on an accepted industry framework that is reviewed and updated as needed.",
          "requirement": "00.a",
          "applicable": true
        },
        {
          "ref": "0104.02a1Organizational.12",
          "summary": "User security roles and responsibilities are clearly defined and communicated.",
          "requirement": "02.a",
          "applicable": true
        },
        {
          "ref": "0107.02d1Organizational.1",
          "summary": "The organization has an information security workforce improvement program.",
          "requirement": "02.d",
          "applicable": true
        },
        {
          "ref": "0108.02d1Organizational.23",
          "summary": "The organization ensures plans for security testing, training and monitoring activities are developed, implemented, maintained and reviewed for consistency with the risk management strategy and response priorities.",
          "requirement": "02.d",
          "applicable": true
        },
        {
          "ref": "0109.02d1Organizational.4",
          "summary": "Management ensures users are briefed on their security role(s)/responsibilities, conform with the terms and conditions of employment prior to obtaining access to the organizations information systems; are provided with guidelines regarding the security expectations of their roles; are motivated to comply with security policies; and continue to have the appropriate skills and qualifications for their role(s).",
          "requirement": "02.d",
          "applicable": true
        },
        {
          "ref": "0113.04a1Organizational.123",
          "summary": "Information security objectives, approach, scope, importance, goals and principles for the organizations security program are formally identified, communicated throughout the organization to users in a form that is relevant, accessible and understandable to the intended reader, and supported by a controls framework that considers legislative, regulatory, contractual requirements and other policy-related requirements.",
          "requirement": "04.a",
          "applicable": true
        },
        {
          "ref": "0114.04b1Organizational.1",
          "summary": "The security policies are regularly reviewed and updated to ensure they reflect leading practices (e.g., for systems and services development and acquisition), and communicated throughout the organization.",
          "requirement": "04.b",
          "applicable": true
        },
        {
          "ref": "0117.05a1Organizational.1",
          "summary": "A senior-level information security official is appointed and is responsible for ensuring security processes are in place, communicated to all stakeholders, and consider and address organizational requirements.",
          "requirement": "05.a",
          "applicable": true
        },
        {
          "ref": "0118.05a1Organizational.2",
          "summary": "Senior management assigns an individual or group to ensure the effectiveness of the information protection program through program oversight, establish and communicate the organization's priorities for organizational mission, objectives, and activies, review and update of the organization's security plan, compliance with the security plan by the workforce, and to evaluate and accept security risks on behalf of the organization.",
          "requirement": "05.a",
          "applicable": true
        },
        {
          "ref": "0119.05a1Organizational.3",
          "summary": "Security contacts are appointed by name for each major organizational area or business unit.",
          "requirement": "05.a",
          "applicable": true
        },
        {
          "ref": "0120.05a1Organizational.4",
          "summary": "Capital planning and investment requests include the resources needed to implement the security program, employ a business case (or Exhibit 300 and/or 53 for federal government), and the organization ensures the resources are available for expenditure as planned.",
          "requirement": "05.a",
          "applicable": true
        },
        {
          "ref": "0135.02f1Organizational.56",
          "summary": "The organization employs a formal sanctions process for personnel failing to comply with established information security policies and procedures and notifies defined personnel (e.g., supervisors) within a defined time frame (e.g., twenty-four (24) hours) when a formal sanction process is initiated, identifying the individual sanctioned and the reason for the sanction. Further, the organization includes specific procedures for license, registration, and certification denial or revocation and other disciplinary action.",
          "requirement": "02.f",
          "applicable": true
        },
        {
          "ref": "0162.04b1Organizational.2",
          "summary": "The organization ensures individuals may make complaints concerning the information security policies, procedures, or the organization's compliance with its policies and procedures; documents the complaints and requests for changes, and records their disposition, if applicable.",
          "requirement": "04.b",
          "applicable": true
        },
        {
          "ref": "0177.05h1Organizational.12",
          "summary": "An independent review of the organization's information security management program is initiated by management to ensure the continuing suitability, adequacy, and effectiveness of the organization's approach to managing information security.",
          "requirement": "05.h",
          "applicable": true
        },
        {
          "ref": "0178.05h1Organizational.3",
          "summary": "The results of independent security program reviews are recorded and reported to the management official/office initiating the review; and the results are maintained for a predetermined period of time as determined by the organization, but not less than three (3) years.",
          "requirement": "05.h",
          "applicable": true
        },
        {
          "ref": "0179.05h1Organizational.4",
          "summary": "If an independent review identifies that the organization's approach and implementation to managing information security is inadequate or not compliant with the direction for information security stated in the information security policy document, management takes corrective actions.",
          "requirement": "05.h",
          "applicable": true
        }
      ]
    },
    {
      "title": "02 Endpoint Protection",
      "description": "Includes laptops, workstations, storage, (e.g., NAS) and servers",
      "controls": [
        {
          "ref": "0201.09j1Organizational.124",
          "summary": "Anti-virus and anti-spyware are installed, operating and updated on all end-user devices to conduct periodic scans of the systems to identify and remove unauthorized software. Server environments for which the server software developer specifically recommends not installing host-based anti-virus and anti-spyware software are addressed via a network-based malware detection (NBMD) solution.",
          "requirement": "09.j",
          "applicable": true
        },
        {
          "ref": "0202.09j1Organizational.3",
          "summary": "Audit logs of the scans are maintained.",
          "requirement": "09.j",
          "applicable": true
        },
        {
          "ref": "0225.09k1Organizational.1",
          "summary": "Automated controls (e.g. browser settings) are in place to authorize and restrict the use of mobile code (e.g., Java, JavaScript, ActiveX, PDF, postscript, Shockwave movies, and Flash animations).",
          "requirement": "09.k",
          "applicable": true
        },
        {
          "ref": "0226.09k1Organizational.2",
          "summary": "The organization has implemented and regularly updates mobile code protection, including anti-virus and anti-spyware.",
          "requirement": "09.k",
          "applicable": true
        }
      ]
    },
    {
      "title": "03 Portable Media Security",
      "description": "Includes mobile storage (e.g., USB drives, CD-ROMs, DVD-ROMs, bacukup tapes)",
      "controls": [
        {
          "ref": "0301.09o1Organizational.123",
          "summary": "The organization, based on the data classification level, registers media (including laptops) prior to use, places reasonable restrictions on how such media be used, and provides an appropriate level of physical and logical protection (including encryption) for media containing covered information until properly destroyed or sanitized.",
          "requirement": "09.o",
          "applicable": true
        },
        {
          "ref": "0305.09q1Organizational.12",
          "summary": "Media is labeled, encrypted, and handled according to its classification.",
          "requirement": "09.q",
          "applicable": true
        },
        {
          "ref": "0306.09q1Organizational.3",
          "summary": "The status and location of unencrypted covered information is maintained and monitored.",
          "requirement": "09.q",
          "applicable": true
        }
      ]
    },
    {
      "title": "04 Mobile Device Security",
      "description": "Includes smart phones and tablets",
      "controls": [
        {
          "ref": "0401.01x1System.124579",
          "summary": "Mobile computing devices are protected at all times by access controls, usage restrictions, connection requirements, encryption, virus protections, host-based firewalls or equivalent functionality, secure configurations, and physical protections.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "0403.01x1System.8",
          "summary": "The organization monitors for unauthorized connections of mobile devices.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "0404.01x1System.1011",
          "summary": "Specially configured mobile devices are issued for personnel travelling to high risk locations and are checked for malware and physical tampering upon return.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "0405.01y1Organizational.12345678",
          "summary": "Teleworking activities are only authorized if security arrangements and controls that comply with relevant security policies and organizational requirements are in place.",
          "requirement": "01.y",
          "applicable": true
        },
        {
          "ref": "0410.01x1System.12",
          "summary": "If it is determined that encryption is not reasonable and appropriate, the organization documents its rationale and acceptance of risk.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "0415.01y1Organizational.10",
          "summary": "Suitable protections of the teleworking site are in place to protect against the theft of equipment and information, the unauthorized disclosure of information, and unauthorized remote access to the organization's internal systems or misuse of facilities.",
          "requirement": "01.y",
          "applicable": true
        },
        {
          "ref": "0425.01x1System.13",
          "summary": "A documented list of approved application stores has been defined as acceptable for mobile devices accessing or storing entity (client) or cloud service provider-managed client data, and the use of unapproved application stores is prohibited for company-owned and BYOD mobile devices. Non-approved applications or approved applications not obtained through approved application stores are prohibited.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "0429.01x1System.14",
          "summary": "The organization prohibits the circumvention of built-in security controls on mobile devices (e.g., jailbreaking or rooting).",
          "requirement": "01.x",
          "applicable": true
        }
      ]
    },
    {
      "title": "05 Wireless Security",
      "description": "Includes all aspects of corporate and guest wireless networks but does not include protections for devices connected to other networks.",
      "controls": [
        {
          "ref": "0501.09m1Organizational.1",
          "summary": "Vendor defaults for wireless access points are changed prior to authorizing the implementation of the access point.",
          "requirement": "09.m",
          "applicable": true
        },
        {
          "ref": "0502.09m1Organizational.5",
          "summary": "Wireless access points are configured with strong encryption (AES WPA2 at a minimum).",
          "requirement": "09.m",
          "applicable": true
        },
        {
          "ref": "0503.09m1Organizational.6",
          "summary": "Wireless access points are placed in secure locations.",
          "requirement": "09.m",
          "applicable": true
        }
      ]
    },
    {
      "title": "06 Configuration Management",
      "description": "Includes all aspects of configuration management (e.g., configuration item identification, configuration status accounting, change control and configuration audit)",
      "controls": [
        {
          "ref": "0601.06g1Organizational.124",
          "summary": "Annual compliance reviews are conducted by security or audit individuals using manual or automated tools; if non-compliance is found, appropriate action is taken.",
          "requirement": "06.g",
          "applicable": true
        },
        {
          "ref": "0602.06g1Organizational.3",
          "summary": "The results and recommendations of the reviews are documented and approved by management.",
          "requirement": "06.g",
          "applicable": true
        },
        {
          "ref": "0605.10h1System.12",
          "summary": "Only authorized administrators are allowed to implement approved upgrades to software, applications, and program libraries, based on business requirements and the security implications of the release.",
          "requirement": "10.h",
          "applicable": true
        },
        {
          "ref": "0613.06h1Organizational.12",
          "summary": "The organization performs annual checks on the technical security configuration of systems, either manually by an individual with experience with the systems and/or with the assistance of automated software tools, and takes appropriate action if non-compliance is found.",
          "requirement": "06.h",
          "applicable": true
        },
        {
          "ref": "0618.09b1System.1",
          "summary": "Changes to information assets, including systems, networks and network services, are controlled and archived.",
          "requirement": "09.b",
          "applicable": true
        },
        {
          "ref": "0635.10k1Organizational.12",
          "summary": "Managers responsible for application systems are also responsible for the strict control (security) of the project or support environment and ensure that all proposed system changes are reviewed to check that they do not compromise the security of either the system or the operating environment.",
          "requirement": "10.k",
          "applicable": true
        },
        {
          "ref": "0663.10h1System.7",
          "summary": "The operating system has in place supporting technical controls such as antivirus, file integrity monitoring, host-based (personal) firewalls or port filtering tools, and logging as part of its baseline.",
          "requirement": "10.h",
          "applicable": true
        },
        {
          "ref": "0671.10k1System.1",
          "summary": "The organization manages changes to mobile device operating systems, patch levels, and/or applications through a formal change management process.",
          "requirement": "10.k",
          "applicable": true
        }
      ]
    },
    {
      "title": "07 Vulnerability Management",
      "description": "Includes the formal management program (e.g., vulnerabilitiy scanning and patching)",
      "controls": [
        {
          "ref": "0701.07a1Organizational.12",
          "summary": "An inventory of assets and services is maintained.",
          "requirement": "07.a",
          "applicable": true
        },
        {
          "ref": "0702.07a1Organizational.3",
          "summary": "The information lifecycle manages the secure use, transfer, exchange, and disposal of IT-related assets.",
          "requirement": "07.a",
          "applicable": true
        },
        {
          "ref": "0706.10b1System.12",
          "summary": "Applications developed by the organization are based on secure coding guidelines to prevent common vulnerabilities or undergo appropriate testing.",
          "requirement": "10.b",
          "applicable": true
        },
        {
          "ref": "0709.10m1Organizational.1",
          "summary": "Technical vulnerabilities are identified, evaluated for risk and corrected in a timely manner.",
          "requirement": "10.m",
          "applicable": true
        },
        {
          "ref": "0707.10b2System.1",
          "summary": "Applications that store, process or transmit covered information undergo automated application vulnerability testing by a qualified party on an annual basis.",
          "requirement": "10.b",
          "applicable": true
        },
        {
          "ref": "0708.10b2System.2",
          "summary": "System and information integrity requirements are developed, documented, disseminated, reviewed and updated annually.",
          "requirement": "10.b",
          "applicable": true
        }
      ]
    },
    {
      "title": "08 Network Protection",
      "description": "Includes all aspects of perimeter and internal network security",
      "controls": [
        {
          "ref": "0805.01m1Organizational.12",
          "summary": "The organization's security gateways (e.g. firewalls) enforce security policies and are configured to filter traffic between domains, block unauthorized access, and are used to maintain segregation between internal wired, internal wireless, and external network segments (e.g., the Internet) including DMZs and enforce access control policies for each of the domains.",
          "requirement": "01.m",
          "applicable": true
        },
        {
          "ref": "0808.10b2System.3",
          "summary": "For any public-facing Web applications, application-level firewalls are implemented to control traffic. For public-facing applications that are not Web-based, the organization has implemented a network-based firewall specific to the application type.  If the traffic to the public-facing application is encrypted, the device either sits behind the encryption or is capable of decrypting the traffic prior to analysis.",
          "requirement": "10.b",
          "applicable": true
        },
        {
          "ref": "0814.01n1Organizational.12",
          "summary": "The ability of users to connect to the internal network is restricted using a deny-by-default and allow-by-exception policy at managed interfaces according to the access control policy and the requirements of clinical and business applications.",
          "requirement": "01.n",
          "applicable": true
        },
        {
          "ref": "0816.01w1System.1",
          "summary": "The sensitivity of applications/systems is explicitly identified and documented by the application/system owner.",
          "requirement": "01.w",
          "applicable": true
        },
        {
          "ref": "0819.09m1Organizational.23",
          "summary": "A current network diagram (including wireless networks) exists and is updated whenever there are network changes and no less than every six months.",
          "requirement": "09.m",
          "applicable": true
        },
        {
          "ref": "0835.09n1Organizational.1",
          "summary": "Agreed services provided by a network service provider/manager are formally managed and monitored to ensure they are provided securely.",
          "requirement": "09.n",
          "applicable": true
        },
        {
          "ref": "0850.01o1Organizational.12",
          "summary": "Routing controls are implemented through security gateways (e.g., firewalls) used between internal and external networks (e.g., the Internet and 3rd party networks).",
          "requirement": "01.o",
          "applicable": true
        },
        {
          "ref": "0859.09m1Organizational.78",
          "summary": "The organization ensures the security of information in networks, availability of network services and information services using the network, and the protection of connected services from unauthorized access.",
          "requirement": "09.m",
          "applicable": true
        }
      ]
    },
    {
      "title": "09 Transmission Protection",
      "description": "Includes Web and network connections (e.g., VPN, email, chat)",
      "controls": [
        {
          "ref": "0901.09s1Organizational.1",
          "summary": "The organization formally addresses multiple safeguards before allowing the use of information systems for information exchange.",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "0903.10f1Organizational.1",
          "summary": "Encryption is used to protect covered information on mobile/removable media and across communication lines based on pre-determined criteria.",
          "requirement": "10.f",
          "applicable": true
        },
        {
          "ref": "0911.09s1Organizational.2",
          "summary": "The organization establishes terms and conditions, consistent with any trust relationship established with other organizations owning, operating, and/or maintaining external information systems, allowing authorized individuals to (i) access the information system from external information systems; and (ii) process, store or transmit organization-controlled information using external information systems.",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "0912.09s1Organizational.4",
          "summary": "Cryptography is used to protect the confidentiality and integrity of remote access sessions to the internal network and to external systems.",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "0913.09s1Organizational.5",
          "summary": "Strong cryptography protocols are used to safeguard covered information during transmission over less trusted / open public networks.",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "0914.09s1Organizational.6",
          "summary": "The organization ensures that communication protection requirements, including the security of exchanges of information, are the subject of policy development and compliance audits.",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "0925.09v1Organizational.1",
          "summary": "Legal considerations, including requirements for electronic signatures, are addressed.",
          "requirement": "09.v",
          "applicable": true
        },
        {
          "ref": "0926.09v1Organizational.2",
          "summary": "Approvals are obtained prior to using external public services, including instant messaging or file sharing.",
          "requirement": "09.v",
          "applicable": true
        },
        {
          "ref": "0927.09v1Organizational.3",
          "summary": "Stronger levels of authentication are implemented to control access from publicly accessible networks.",
          "requirement": "09.v",
          "applicable": true
        },
        {
          "ref": "0928.09v1Organizational.45",
          "summary": "Stronger controls are implemented to protect certain electronic messages, and electronic messages are protected throughout the duration of its end-to-end transport path using cryptographic mechanisms unless protected by alternative measures.",
          "requirement": "09.v",
          "applicable": true
        },
        {
          "ref": "0929.09v1Organizational.6",
          "summary": "The organization never sends unencrypted sensitive information by end-user messaging technologies (e.g., email, instant messaging, and chat).",
          "requirement": "09.v",
          "applicable": true
        },
        {
          "ref": "0938.09x1Organizational.1",
          "summary": "The organization takes specific steps to ensure the confidentiality and integrity of electronic commerce are maintained.",
          "requirement": "09.x",
          "applicable": true
        },
        {
          "ref": "0943.09y1Organizational.1",
          "summary": "Data involved in electronic commerce and online transactions is checked to determine if it contains covered information.",
          "requirement": "09.y",
          "applicable": true
        },
        {
          "ref": "0944.09y1Organizational.2",
          "summary": "Security is maintained through all aspects of the transaction.",
          "requirement": "09.y",
          "applicable": true
        },
        {
          "ref": "0945.09y1Organizational.3",
          "summary": "Protocols used to communicate between all involved parties are secured using cryptographic techniques (e.g., SSL).",
          "requirement": "09.y",
          "applicable": true
        },
        {
          "ref": "0961.09v1Organizational.7",
          "summary": "The organization does not send PII/PHI over facsimile (FAX), unless it cannot be sent over other, more secure channels, e.g., delivery by hand, secure email.",
          "requirement": "09.v",
          "applicable": true
        }
      ]
    },
    {
      "title": "10 Password Management",
      "description": "Addresses specific issues around the use of traditional passwords.",
      "controls": [
        {
          "ref": "1001.01d1System.24567",
          "summary": "The organization changes passwords for default system accounts, at first logon following the issuance of a secure temporary password, when there is a suspected compromise, and no less than every ninety (90) days for regular accounts or 60 days for privileged (i.e., administrator accounts).",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1010.01d2System.5",
          "summary": "Identification codes used in conjunction with passwords for electronic signatures are protected.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1002.01d1System.1",
          "summary": "Passwords are not displayed when entered.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1003.01d1System.3",
          "summary": "User identities are verified prior to performing password resets.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1004.01d1System.8913",
          "summary": "The organization maintains a list of commonly-used, expected or compromised passwords, and updates the list at least every 180 days and when organizational passwords are suspected to have been compromised, either directly or indirectly; verifies, when users create or update passwords, that the passwords are not found on the organization-defined list of commonly-used, expected or compromised passwords; allows users to select long passwords and passphrases, including spaces and all printable characters; and employs automated tools to assist the user in selecting strong passwords and authenticators.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1005.01d1System.1011",
          "summary": "<p>The organization transmits passwords only when cryptographically-protected and stores passwords using an approved hash algorithm.</p>",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1006.01d2System.1",
          "summary": "Passwords are not included in automated log-on processes.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1007.01d2System.2",
          "summary": "Passwords are encrypted during transmission and storage on all system components.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1008.01d2System.3",
          "summary": "Users sign a statement acknowledging their responsibility to keep passwords confidential.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1009.01d2System.4",
          "summary": "Temporary passwords are unique and not guessable.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1014.01d1System.12",
          "summary": "The organization avoids the use of third parties or unprotected (clear text) electronic mail messages for the dissemination of passwords.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1015.01d1System.14",
          "summary": "Users acknowledge receipt of passwords.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1022.01d1System.15",
          "summary": "Password policies, applicable to mobile devices, are documented and enforced through technical controls on all company devices or devices approved for BYOD usage, and prohibit the changing of password/PIN lengths and authentication requirements.",
          "requirement": "01.d",
          "applicable": true
        },
        {
          "ref": "1027.01d2System.6",
          "summary": "Electronic signatures that are not based upon biometrics employ at least two distinct identification components that are administered and executed.",
          "requirement": "01.d",
          "applicable": true
        }
      ]
    },
    {
      "title": "11 Access Control",
      "description": "Includes all aspects of access control other than the use of traditional passwords (e.g., provisioning)",
      "controls": [
        {
          "ref": "1106.01b1System.1",
          "summary": "User identities are verified prior to establishing accounts.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1107.01b1System.2",
          "summary": "Default and unnecessary system accounts are removed, disabled, or otherwise secured (e.g., the passwords are changed and privileges are reduced to the lowest levels of access.)",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1108.01b1System.3",
          "summary": "Account managers are notified when users' access rights change (e.g., termination, change in position) and modify the user's account accordingly.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1109.01b1System.479",
          "summary": "User registration and de-registration, at a minimum, communicate relevant policies to users and require acknowledgement (e.g. signed or captured electronically), check authorization and minimum level of access necessary prior to granting access, ensure access is appropriate to the business and/or clinical needs (consistent with sensitivity/risk and does not violate segregation of duties requirements), address termination and transfer, ensure default accounts are removed and/or renamed, remove or block critical access rights of users who have changed roles or jobs, and automatically remove or disable inactive accounts.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1110.01b1System.5",
          "summary": "Users are given a written statement of their access rights, which they are required to sign stating they understand the conditions of access. Guest/anonymous, shared/group, emergency and temporary accounts are specifically authorized and use monitored.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1114.01h1Organizational.123",
          "summary": "Covered or critical business information is not left unattended or available for unauthorized individuals to access, including on desks, printers, copiers, fax machines, and computer monitors.",
          "requirement": "01.h",
          "applicable": true
        },
        {
          "ref": "1115.01h1Organizational.45",
          "summary": "Covered or critical information is protected when using internal or external (e.g., USPS) mail services.",
          "requirement": "01.h",
          "applicable": true
        },
        {
          "ref": "1116.01j1Organizational.145",
          "summary": "Strong authentication methods such as multi-factor, Radius or Kerberos (for privileged access) and CHAP (for encryption of credentials for dialup methods) are implemented for all external connections to the organizations network.",
          "requirement": "01.j",
          "applicable": true
        },
        {
          "ref": "1117.01j1Organizational.23",
          "summary": "Remote access by vendors and business partners (e.g., for remote maintenance) is disabled/deactivated when not in use.",
          "requirement": "01.j",
          "applicable": true
        },
        {
          "ref": "1122.01q1System.1",
          "summary": "Unique IDs that can be used to trace activities to the responsible individual are required for all types of organizational and non-organizational users.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1123.01q1System.2",
          "summary": "Users who performed privileged functions (e.g., system administration) use separate accounts when performing those privileged functions.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1124.01q1System.34",
          "summary": "Shared/group and generic user IDs are only used in exceptional circumstances where there is a clear business benefit, when user functions do not need to be traced, additional accountability controls are implemented, and after approval by management.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1129.01v1System.12",
          "summary": "Access rights to applications and application functions are limited to the minimum necessary using menus.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1135.02i1Organizational.1234",
          "summary": "Upon termination or changes in employment for employees, contractors, third-party users or other workforce arrangement, physical and logical access rights and associated materials (e.g., passwords, keycards, keys, documentation that identify them as current members of the organization) are removed or modified to restrict access within 24 hours and old accounts are closed after 90 days of opening new accounts.",
          "requirement": "02.i",
          "applicable": true
        },
        {
          "ref": "1137.06e1Organizational.1",
          "summary": "Acceptable use agreements are signed by all employees before being allowed access to information assets.",
          "requirement": "06.e",
          "applicable": true
        },
        {
          "ref": "1111.01b2System.1",
          "summary": "Group, shared or generic accounts and passwords (e.g., for first-time log-on) are not used.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1112.01b2System.2",
          "summary": "User identities are verified in person before a designated registration authority with authorization by a designated organizational official (e.g., a supervisor or other individual defined in an applicable security plan) prior to receiving a hardware token.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1125.01q2System.1",
          "summary": "Multi-factor authentication methods are used in accordance with organizational policy, (e.g., for remote network access).",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1127.01q2System.3",
          "summary": "Where tokens are provided for multi-factor authentication, in-person verification is required prior to granting access.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1128.01q2System.5",
          "summary": "Help desk support requires user identification for any transaction that has information security implications.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "1130.01v2System.1",
          "summary": "Access rights from an application to other applications are controlled.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1131.01v2System.2",
          "summary": "Outputs from application systems handling covered information are limited to the minimum necessary and sent only to authorized terminals/locations.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1132.01v2System.3",
          "summary": "Covered information is encrypted when stored in non-secure areas and, if not encrypted at rest, the organization must document its rationale.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1133.01v2System.4",
          "summary": "Actions that can be performed without identification and authentication are permitted by exception.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1134.01v3System.1",
          "summary": "Copy (including print screen), move, print, and storage of sensitive data are prohibited when accessed remotely without a defined business need.",
          "requirement": "01.v",
          "applicable": true
        },
        {
          "ref": "1139.01b1System.68",
          "summary": "Account types are identified (individual, shared/group, system, application, guest/anonymous, emergency and temporary), conditions for group and role membership are established, and, if used, shared/group account credentials are modified when users are removed from the group.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "1143.01c1System.123",
          "summary": "Privileges are formally authorized and controlled, allocated to users on a need-to-use and event-by-event basis for their functional rol (e.g., user or administrator), and documented for each system product/element.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1144.01c1System.4",
          "summary": "The organization explicitly authorizes access to specific security relevant functions (deployed in hardware, software, and firmware) and security-relevant information.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1145.01c2System.1",
          "summary": "Role-based access control is implemented and capable of mapping each user to one or more roles, and each role to one or more system functions.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1146.01c2System.23",
          "summary": "The organization promotes the development and use of programs that avoid the need to run with elevated privileges and system routines to avoid the need to grant privileges to users.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1147.01c2System.456",
          "summary": "Elevated privileges are assigned to a different user ID from those used for normal business use, all users access privileged services in a single role, and such privileged access is minimized.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1148.01c2System.78",
          "summary": "The organization restricts access to privileged functions and all security-relevant information.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1149.01c2System.9",
          "summary": "The organization facilitates information sharing by enabling authorized users to determine a business partner's access when discretion is allowed as defined by the organization and by employing manual processes or automated mechanisms to assist users in making information sharing/collaboration decisions.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1150.01c2System.10",
          "summary": "The access control system for the system components storing, processing or transmitting covered information is set with a default \"deny-all\" setting.",
          "requirement": "01.c",
          "applicable": true
        },
        {
          "ref": "1166.01e1System.12",
          "summary": "User access rights are reviewed after any changes and reallocated as necessary.",
          "requirement": "01.e",
          "applicable": true
        },
        {
          "ref": "1173.01j1Organizational.6",
          "summary": "If encryption is not used for dial-up connections, the CIO or his/her designated representative provides specific written authorization.",
          "requirement": "01.j",
          "applicable": true
        },
        {
          "ref": "1174.01j1Organizational.7",
          "summary": "The organization protects wireless access to systems containing sensitive information by authenticating both users and devices.",
          "requirement": "01.j",
          "applicable": true
        },
        {
          "ref": "1175.01j1Organizational.8",
          "summary": "Remote access to business information across public networks only takes place after successful identification and authentication.",
          "requirement": "01.j",
          "applicable": true
        },
        {
          "ref": "1192.01l1Organizational.1",
          "summary": "Access to network equipment is physically protected.",
          "requirement": "01.l",
          "applicable": true
        },
        {
          "ref": "11109.01q1Organizational.57",
          "summary": "The organization ensures that redundant user IDs are not issued to other users and that all users are uniquely identified and authenticated for both local and remote access to information systems.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11110.01q1Organizational.6",
          "summary": "Non-organizational users (all information system users other than organizational users, such as patients, customers, contractors, or foreign nationals), or processes acting on behalf of non-organizational users, determined to need access to information residing on the organization's information systems, are uniquely identified and authenticated.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11111.01q2System.4",
          "summary": "When PKI-based authentication is used, the information system validates certificates by constructing and verifying a certification path to an accepted trust anchor, including checking certificate status information; enforces access to the corresponding private key; maps the identity to the corresponding account of the individual or group; and implements a local cache of revocation data to support path discovery and validation in case of an inability to access revocation information via the network.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11112.01q2Organizational.67",
          "summary": "The information system employs replay-resistant authentication mechanisms such as nonce, one-time passwords, or time stamps to secure network access for privileged accounts; and, for hardware token-based authentication, employs mechanisms that satisfy minimum token requirements discussed in NIST SP 800-63-2, Electronic Authentication Guideline.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11126.01t1Organizational.12",
          "summary": "A time-out system (e.g. a screen saver) pauses the session screen after 15 minutes of inactivity, closes network sessions after 30 minutes of inactivity, and requires the user to reestablish authenticated access once the session has been paused or closed; or, if the system cannot be modified, a limited form of time-out that clears the screen but does not close down the application or network sessions is used.",
          "requirement": "01.t",
          "applicable": true
        },
        {
          "ref": "11127.01t2Organizational.1",
          "summary": "A time-out system (e.g. a screen saver) pauses the session screen after 2 minutes of inactivity and closes network sessions after 30 minutes of inactivity.",
          "requirement": "01.t",
          "applicable": true
        },
        {
          "ref": "11154.02i1Organizational.5",
          "summary": "Access rights to information assets and facilities is reduced or removed before the employment or other workforce arrangement terminates or changes, depending on the evaluation of risk factors.",
          "requirement": "02.i",
          "applicable": true
        },
        {
          "ref": "11190.01t1Organizational.3",
          "summary": "Bring your own device (BYOD) and/or company-owned devices are configured to require an automatic lockout screen, and the requirement is enforced through technical controls.",
          "requirement": "01.t",
          "applicable": true
        },
        {
          "ref": "11200.01b2Organizational.3",
          "summary": "Identity verification of the individual is required prior to establishing, assigning, or certifying an individual's electronic signature or any element of such signature.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "11208.01q1Organizational.8",
          "summary": "The organization requires that electronic signatures, unique to one individual, cannot be reused by, or reassigned to, anyone else.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11209.01q2Organizational.9",
          "summary": "Electronic signatures based upon biometrics are designed to ensure that they cannot be used by any individual other than their genuine owners.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11210.01q2Organizational.10",
          "summary": "Electronic signatures and handwritten signatures executed to electronic records are linked to their respective electronic records.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11211.01q2Organizational.11",
          "summary": "Signed electronic records contain information associated with the signing in human-readable format.",
          "requirement": "01.q",
          "applicable": true
        },
        {
          "ref": "11219.01b1Organizational.10",
          "summary": "The organization  maintains a current listing of all workforce members (individuals, contractors and Business Associates) with access to PHI.",
          "requirement": "01.b",
          "applicable": true
        },
        {
          "ref": "11220.01b1System.10",
          "summary": "User registration and de-registration formally address establishing, activating, modifying, reviewing, disabling and removing accounts.",
          "requirement": "01.b",
          "applicable": true
        }
      ]
    },
    {
      "title": "12 Audit Logging & Monitoring",
      "description": "Includes all aspects of audit logging and monitoring",
      "controls": [
        {
          "ref": "1201.06e1Organizational.2",
          "summary": "The organization provides notice that the employee's actions may be monitored, and that the employee consents to such monitoring.",
          "requirement": "06.e",
          "applicable": true
        },
        {
          "ref": "1202.09aa1System.1",
          "summary": "A secure audit record is created for all activities on the system (create, read, update, delete) involving covered information.",
          "requirement": "09.aa",
          "applicable": true
        },
        {
          "ref": "1203.09aa1System.2",
          "summary": "Audit records include the unique user ID, unique data subject ID, function performed, and date/time the event was performed.",
          "requirement": "09.aa",
          "applicable": true
        },
        {
          "ref": "1204.09aa1System.3",
          "summary": "The activities of privileged users (administrators, operators, etc.) include the success/failure of the event, time the event occurred, the account involved, the processes involved, and additional information about the event.",
          "requirement": "09.aa",
          "applicable": true
        },
        {
          "ref": "1212.09ab1System.1",
          "summary": "All applicable legal requirements related to monitoring authorized access and unauthorized access attempts are met.",
          "requirement": "09.ab",
          "applicable": true
        },
        {
          "ref": "1229.09c1Organizational.1",
          "summary": "Separation of duties is used to limit the risk of unauthorized or unintentional modification of information and systems.",
          "requirement": "09.c",
          "applicable": true
        },
        {
          "ref": "1270.09ad1System.12",
          "summary": "The organization ensures proper logging is enabled in order to audit administrator activities; and reviews system administrator and operator logs on a regular basis.",
          "requirement": "09.ad",
          "applicable": true
        },
        {
          "ref": "1271.09ad1System.1",
          "summary": "An intrusion detection system managed outside of the control of system and network administrators is used to monitor system and network administration activities for compliance.",
          "requirement": "09.ad",
          "applicable": true
        },
        {
          "ref": "12101.09ab1Organizational.3",
          "summary": "The organization specifies how often audit logs are reviewed, how the reviews are documented, and the specific roles and responsibilities of the personnel conducting the reviews, including the professional certifications or other qualifications required.",
          "requirement": "09.ab",
          "applicable": true
        },
        {
          "ref": "12102.09ab1Organizational.4",
          "summary": "The organization periodically tests its monitoring and detection processes, remediates deficiencies, and improves its processes.",
          "requirement": "09.ab",
          "applicable": true
        },
        {
          "ref": "12103.09ab1Organizational.5",
          "summary": "Information collected from multiple sources is aggregated for review.",
          "requirement": "09.ab",
          "applicable": true
        }
      ]
    },
    {
      "title": "13 Education, Training and Awareness",
      "description": "Includes the education and training of specialized security personnel s well as the standard user; includes an overall, ongoing (continuous) awareness program/campaign",
      "controls": [
        {
          "ref": "1301.02e1Organizational.12",
          "summary": "Employees and contractors receive documented initial (as part of their onboarding within sixty (60) days of hire), annual and ongoing training on their roles related to security and privacy",
          "requirement": "02.e",
          "applicable": true
        },
        {
          "ref": "1306.06e1Organizational.5",
          "summary": "Employees and contractors are informed in writing that violations of the security policies will result in sanctions or disciplinary action.",
          "requirement": "06.e",
          "applicable": true
        },
        {
          "ref": "1307.07c1Organizational.124",
          "summary": "The organization defines rules to describe user responsibilities and acceptable behavior for information system usage, including at a minimum rules for email, internet, mobile devices, social media and facility usage.",
          "requirement": "07.c",
          "applicable": true
        },
        {
          "ref": "1308.09j1Organizational.5",
          "summary": "The organization prohibits users from installing unauthorized software, including data and software from external networks, and ensures users are made aware and trained on these requirements.",
          "requirement": "09.j",
          "applicable": true
        },
        {
          "ref": "1309.01x1System.36",
          "summary": "Personnel using mobile computing devices are trained on the risks, the controls implemented, and their responsibilities, e.g., shoulder surfing, physical protections.",
          "requirement": "01.x",
          "applicable": true
        },
        {
          "ref": "1310.01y1Organizational.9",
          "summary": "Personnel who telework are trained on the risks, the controls implemented, and their responsibilities.",
          "requirement": "01.y",
          "applicable": true
        },
        {
          "ref": "1313.02e1Organizational.3",
          "summary": "The organization provides incident response and contingency training to information system users consistent with assigned roles and responsibilities within ninety (90) days of assuming an incident response role or responsibility; when required by information system changes; and within every three hundred sixty-five (365) days thereafter",
          "requirement": "02.e",
          "applicable": true
        },
        {
          "ref": "1324.07c1Organizational.3",
          "summary": "Employees, contractors and third party system users are aware of the limits existing for their use of the organization's information and assets associated with information processing facilities and resources; and they are responsible for their use of any information resource and of any use carried out under their responsibility.",
          "requirement": "07.c",
          "applicable": true
        },
        {
          "ref": "1325.09s1Organizational.3",
          "summary": "Personnel are appropriately trained on leading principles and practices for all types of information exchange (oral, paper and electronic).",
          "requirement": "09.s",
          "applicable": true
        },
        {
          "ref": "1326.02e1Organizational.4",
          "summary": "The organization provides training on BYOD usage, which includes providing an approved list of  applications, application stores, and application extensions and plugins",
          "requirement": "02.e",
          "applicable": true
        },
        {
          "ref": "1336.02e1Organizational.5",
          "summary": "The organizations security awareness and training program identifies how workforce members are provided security awareness and training and the workforce members who will receive security awareness and training; and describes the types of security awareness and training that is reasonable and appropriate for its workforce members, how workforce members are provided security and awareness training when there is a change in the organizations information systems, and how frequently security awareness and training is provided to all workforce members.",
          "requirement": "02.e",
          "applicable": true
        }
      ]
    },
    {
      "title": "14 Third Party Assurance",
      "description": "Addresses all aspects of managing risk associated with third parties (e.g., vendors, BA's)",
      "controls": [
        {
          "ref": "1401.05i1Organizational.1239",
          "summary": "Access to the organizations information and systems by external parties is not permitted until due diligence has been conducted, the appropriate controls have been implemented, and a contract/agreement reflecting the security requirements is signed acknowledging they understand and accept their obligations.",
          "requirement": "05.i",
          "applicable": true
        },
        {
          "ref": "1402.05i1Organizational.45",
          "summary": "Remote access connections between the organization and external parties are encrypted.",
          "requirement": "05.i",
          "applicable": true
        },
        {
          "ref": "1403.05i1Organizational.67",
          "summary": "Access granted to external parties is limited to the minimum necessary and granted only for the duration required.",
          "requirement": "05.i",
          "applicable": true
        },
        {
          "ref": "1406.05k1Organizational.110",
          "summary": "A standard agreement with third parties is defined and includes the required security controls in accordance with the organization's security policies.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1408.09e1System.1",
          "summary": "Service Level Agreements (SLAs) or contracts with an agreed service arrangement address liability, service definitions, security controls, and other aspects of services management.",
          "requirement": "09.e",
          "applicable": true
        },
        {
          "ref": "1411.09f1System.1",
          "summary": "The results of monitoring activities of third-party services are compared against the Service Level Agreements or contracts at least annually.",
          "requirement": "09.f",
          "applicable": true
        },
        {
          "ref": "1416.10l1Organizational.1",
          "summary": "Where software development is outsourced, formal contracts are in place to address the ownership and security of the code and application.",
          "requirement": "10.l",
          "applicable": true
        },
        {
          "ref": "1428.05k1Organizational.2",
          "summary": "The organization identifies and mandates information security controls to specifically address supplier access to the organization's information and information assets.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1429.05k1Organizational.34",
          "summary": "The organization maintains written agreements (contracts) that include: (i) an acknowledgement that the third party (e.g., a service provider) is responsible for the security of the data and requirements to address the associated information security risks and (ii) requirements to address the information security risks associated with information and communications technology services (e.g., cloud computing services) and product supply chain.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1430.05k1Organizational.56",
          "summary": "The agreement ensures that there is no misunderstanding between the organization and the third party and satisfies the organization as to the indemnity of the third party.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1431.05k1Organizational.7",
          "summary": "The organization establishes personnel security requirements, including security roles and responsibilities, for third-party providers that are coordinated and aligned with internal security roles and responsibilities.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1432.05k1Organizational.89",
          "summary": "The organization ensures a screening process is carried out for contractors and third party users; and, where contractors are provided through an organization, (i) the contract with the organization clearly specifies the organization's responsibilities for screening and the notification procedures they need to follow if screening has not been completed or if the results give cause for doubt or concern and, in the same way, (ii) the agreement with the third party clearly specifies all responsibilities and notification procedures for screening.",
          "requirement": "05.k",
          "applicable": true
        },
        {
          "ref": "1419.05j1Organizational.12",
          "summary": "The organization ensures that customers are aware of their obligations and rights, and accept the responsibilities and liabilities involved in accessing, processing, communicating, or managing the organization's information and information assets.",
          "requirement": "05.j",
          "applicable": true
        },
        {
          "ref": "1420.05j1Organizational.34",
          "summary": "The organization permits an individual to request restriction of the disclosure of the individual's covered information to a business associate for purposes of carrying out payment or health care operations, and is not for purposes of carrying out treatment, and responds to any requests from an individual on the disclosure of the individual's covered information.",
          "requirement": "05.j",
          "applicable": true
        }
      ]
    },
    {
      "title": "15 Incident Management",
      "description": "Includes incident monitoring and detection activities, incident response and breach reporting",
      "controls": [
        {
          "ref": "1501.02f1Organizational.123",
          "summary": "Sanctions are fairly applied to employees following violations of the information security policies once a breach is verified and includes consideration of multiple factors.",
          "requirement": "02.f",
          "applicable": true
        },
        {
          "ref": "1502.02f1Organizational.4",
          "summary": "A list of employees involved in security incidents is maintained with the resulting outcome from the investigation.",
          "requirement": "02.f",
          "applicable": true
        },
        {
          "ref": "1504.06e1Organizational.34",
          "summary": "Management approves the use of information assets and takes appropriate action when unauthorized activity occurs.",
          "requirement": "06.e",
          "applicable": true
        },
        {
          "ref": "1505.11a1Organizational.13",
          "summary": "A formal security incident response program has been established to respond, report (without fear of repercussion), escalate and treat breaches and reported security events or incidents. Organization-wide standards are specified for the time required for system administrators and other personnel to report anomalous events to the incident handling team, the mechanisms for such reporting, and the kind of information that should be included in the incident notification. This reporting includes notifying internal and external stakeholders, the appropriate community Computer Emergency Response Team, and law enforcement agencies in accordance with all legal or regulatory requirements for involving such organizations in computer incidents.",
          "requirement": "11.a",
          "applicable": true
        },
        {
          "ref": "1506.11a1Organizational.2",
          "summary": "There is a point of contact for reporting information security events who is made known throughout the organization, always available, and able to provide adequate and timely response.  The organization also maintains a list of third-party contact information (e.g., the email addresses of their information security offices), which can be used to report a security incident.",
          "requirement": "11.a",
          "applicable": true
        },
        {
          "ref": "1507.11a1Organizational.4",
          "summary": "The organization has implemented an insider threat program that includes a cross-discipline insider threat incident handling team.",
          "requirement": "11.a",
          "applicable": true
        },
        {
          "ref": "1516.11c1Organizational.12",
          "summary": "The organization has implemented an incident handling capability for security incidents that addresses (i) policy (setting corporate direction) and procedures defining roles and responsibilities; (ii) incident handling procedures (business and technical); (iii) communication; (iv) reporting and retention; and (v) references to a vulnerability management program.",
          "requirement": "11.c",
          "applicable": true
        },
        {
          "ref": "1517.11c1Organizational.3",
          "summary": "There is a point of contact who is responsible for coordinating incident responses and has the authority to direct actions required in all phases of the incident response process.",
          "requirement": "11.c",
          "applicable": true
        },
        {
          "ref": "1524.11a1Organizational.5",
          "summary": "Workforce members cooperate with federal or state investigations or disciplinary proceedings.",
          "requirement": "11.a",
          "applicable": true
        },
        {
          "ref": "1525.11a1Organizational.6",
          "summary": "The organization takes disciplinary action against workforce members that fail to cooperate with federal and state investigations.",
          "requirement": "11.a",
          "applicable": true
        },
        {
          "ref": "1560.11d1Organizational.1",
          "summary": "The information gained from the evaluation of information security incidents is used to identify recurring or high-impact incidents, and update the incident response and recovery strategy.",
          "requirement": "11.d",
          "applicable": true
        },
        {
          "ref": "1581.02f1Organizational.7",
          "summary": "The organization ensures individuals are held accountable and responsible for actions initiated under their electronic signatures, to help deter record and signature falsification.",
          "requirement": "02.f",
          "applicable": true
        },
        {
          "ref": "1589.11c1Organizational.5",
          "summary": "The organization test and/or exercise its incident response capability regularly.",
          "requirement": "11.c",
          "applicable": true
        }
      ]
    },
    {
      "title": "16 Business Continuity & Disaster Recovery",
      "description": "Includes all ascpects of contingency, business continuity and disaster recovery (e.g., planning, implementation, exercise/testing)",
      "controls": [
        {
          "ref": "1601.12c1Organizational.1238",
          "summary": "The organization can recover and restore business operations and establish an availability of information in the time frame required by the business objectives and without a deterioration of the security measures.",
          "requirement": "12.c",
          "applicable": true
        },
        {
          "ref": "1602.12c1Organizational.4567",
          "summary": "The contingency program addresses required capacity, identifies critical missions and business functions, defines recovery objectives and priorities, and identifies roles and responsibilities.",
          "requirement": "12.c",
          "applicable": true
        },
        {
          "ref": "1603.12c1Organizational.9",
          "summary": "Copies of the business continuity plans are distributed to key contingency personnel.",
          "requirement": "12.c",
          "applicable": true
        },
        {
          "ref": "1616.09l1Organizational.16",
          "summary": "Backup copies of information and software are made and tests of the media and restoration procedures are regularly performed at appropriate intervals.",
          "requirement": "09.l",
          "applicable": true
        },
        {
          "ref": "1617.09l1Organizational.23",
          "summary": "A formal definition of the level of backup required for each system is defined and documented including how each system will be restored, the scope of data to be imaged, frequency of imaging, and duration of retention based on relevant contractual, legal, regulatory and business requirements.",
          "requirement": "09.l",
          "applicable": true
        },
        {
          "ref": "1618.09l1Organizational.45",
          "summary": "The backups are stored in a physically secure remote location, at a sufficient distance to make them reasonably immune from damage to data at the primary site, and reasonable physical and environmental controls are in place to ensure their protection at the remote location.",
          "requirement": "09.l",
          "applicable": true
        },
        {
          "ref": "1619.09l1Organizational.7",
          "summary": "Inventory records for the backup copies, including content and current location, are maintained.",
          "requirement": "09.l",
          "applicable": true
        },
        {
          "ref": "1620.09l1Organizational.8",
          "summary": "When the backup service is delivered by the third party, the service level agreement includes the detailed protections to control confidentiality, integrity and availability of the backup information.",
          "requirement": "09.l",
          "applicable": true
        },
        {
          "ref": "1634.12b1Organizational.1",
          "summary": "The organization identifies the critical business processes requiring business continuity.",
          "requirement": "12.b",
          "applicable": true
        },
        {
          "ref": "1635.12b1Organizational.2",
          "summary": "Information security aspects of business continuity are (i) based on identifying events (or sequence of events) that can cause interruptions to the organization's critical business processes (e.g., equipment failure, human errors, theft, fire, natural disasters acts of terrorism); (ii) followed by a risk assessment to determine the probability and impact of such interruptions, in terms of time, damage scale and recovery period; (iii) based on the results of the risk assessment, a business continuity strategy is developed to identify the overall approach to business continuity; and (iv) once this strategy has been created, endorsement is provided by management, and a plan created and endorsed to implement this strategy.",
          "requirement": "12.b",
          "applicable": true
        },
        {
          "ref": "1666.12d1Organizational.1235",
          "summary": "The organization creates at a minimum one (1) business continuity plan and ensures each plan (i) has an owner, (ii) describes the approach for continuity, ensuring at a minimum the approach to maintain information or information asset availability and security, and (iii) specifies the escalation plan and the conditions for its activation, as well as the individuals responsible for executing each component of the plan.",
          "requirement": "12.d",
          "applicable": true
        },
        {
          "ref": "1667.12d1Organizational.4",
          "summary": "When new requirements are identified, any existing emergency procedures (e.g., evacuation plans or fallback arrangements) are amended as appropriate.",
          "requirement": "12.d",
          "applicable": true
        },
        {
          "ref": "1668.12d1Organizational.67",
          "summary": "Emergency procedures, manual \"fallback\" procedures, and resumption plans are the responsibility of the owner of the business resources or processes involved; and fallback arrangements for alternative technical services, such as information processing and communications facilities, are the responsibility of the service providers.",
          "requirement": "12.d",
          "applicable": true
        },
        {
          "ref": "1669.12d1Organizational.8",
          "summary": "The business continuity planning framework addresses a specific, minimal set of information security requirements.",
          "requirement": "12.d",
          "applicable": true
        },
        {
          "ref": "1699.09l1Organizational.10",
          "summary": "Workforce members roles and responsibilities in the data backup process are identified and communicated to the workforce; in particular, Bring Your Own Device (BYOD) users are required to perform backups of organizational and/or client data on their devices.",
          "requirement": "09.l",
          "applicable": true
        }
      ]
    },
    {
      "title": "17 Risk Management",
      "description": "Includes risk assessment, analysis, and other risk management-related activities",
      "controls": [
        {
          "ref": "1704.03b1Organizational.12",
          "summary": "The organization performs risk assessments in a consistent way and at planned intervals, or when there are major changes to the organization's environment, and reviews the risk assessment results annually.",
          "requirement": "03.b",
          "applicable": true
        },
        {
          "ref": "1707.03c1Organizational.12",
          "summary": "The organization uses a formal methodology with defined criteria for determining risk treatments and ensuring that corrective action plans for the security program and the associated organizational information systems are prioritized and maintained; and the remedial information security actions necessary to mitigate risk to organizational operations and assets, individuals, and other organizations are documented.",
          "requirement": "03.c",
          "applicable": true
        },
        {
          "ref": "1706.03b1Organizational.3",
          "summary": "Risk assessments include the evaluation of multiple factors that may impact security as well as the likelihood and impact from a loss of confidentiality, integrity and availability of information and systems.",
          "requirement": "03.b",
          "applicable": true
        },
        {
          "ref": "1713.03c1Organizational.3",
          "summary": "The covered entity mitigates any harmful effect that is known to the covered entity of a use or disclosure of PHI by the covered entity or its business associates, in violation of its policies and procedures.",
          "requirement": "03.c",
          "applicable": true
        },
        {
          "ref": "1733.03d1Organizational.1",
          "summary": "The risk management program includes the requirement that risk assessments be re-evaluated at least annually, or when there are significant changes in the environment.",
          "requirement": "03.d",
          "applicable": true
        },
        {
          "ref": "1780.10a1Organizational.1",
          "summary": "The organization formally addresses the purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance with system and information integrity requirements and facilitates the implementation of system and information integrity requirements/controls.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1781.10a1Organizational.23",
          "summary": "Information system specifications for security control requirements state that security controls are to be incorporated in the information system, supplemented by manual controls as needed, and these considerations are also applied when evaluating software packages, developed or purchased.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1782.10a1Organizational.4",
          "summary": "Security requirements and controls reflect the business value of the information assets involved, and the potential business damage that might result from a failure or absence of security.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1783.10a1Organizational.56",
          "summary": "A formal acquisition process is followed for purchased commercial products, and supplier contracts include the identified security requirements.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1784.10a1Organizational.7",
          "summary": "Where the security functionality in a proposed product does not satisfy the specified requirement, the risk introduced and associated controls are reconsidered prior to purchasing the product.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1785.10a1Organizational.8",
          "summary": "Where additional functionality is supplied and causes a security risk, the functionality is disabled or mitigated through application of additional controls.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "1786.10a1Organizational.9",
          "summary": "The organization requires developers of information systems, components, and developers or providers of services to identify (document) early in the system development life cycle, the functions ports, protocols, and services intended for organizational use.",
          "requirement": "10.a",
          "applicable": true
        },
        {
          "ref": "17126.03c1System.6",
          "summary": "The organization has implemented an integrated control system characterized using different control types (e.g., layered, preventative, detective, corrective, and compensating) that mitigates identified risks.",
          "requirement": "03.c",
          "applicable": true
        }
      ]
    },
    {
      "title": "18 Physical & Environmental Security",
      "description": "Includes the physical and environmental security requiremetns for data centers and other facilities containing sensitive information, as well as disposal and destruction of sensitive information",
      "controls": [
        {
          "ref": "1801.08b1Organizational.124",
          "summary": "Visitor and third-party support access is recorded and supervised unless previously approved.",
          "requirement": "08.b",
          "applicable": true
        },
        {
          "ref": "1802.08b1Organizational.3",
          "summary": "Areas where sensitive information (e.g., covered information, payment card data) is stored or processed are controlled and restricted to authorized individuals only.",
          "requirement": "08.b",
          "applicable": true
        },
        {
          "ref": "1803.08b1Organizational.5",
          "summary": "Repairs or modifications to the physical components of a facility which are related to security (e.g., hardware, walls, doors and locks) are documented and retained in accordance with the organization's retention policy.",
          "requirement": "08.b",
          "applicable": true
        },
        {
          "ref": "1814.08d1Organizational.12",
          "summary": "Fire extinguishers and detectors are installed according to applicable laws and regulations.",
          "requirement": "08.d",
          "applicable": true
        },
        {
          "ref": "1819.08j1Organizational.23",
          "summary": "Maintenance and service are controlled and conducted by authorized personnel in accordance with supplier-recommended intervals, insurance policies and the organizations maintenance program, taking into account whether this maintenance is performed by personnel on site or external to the organization.",
          "requirement": "08.j",
          "applicable": true
        },
        {
          "ref": "1825.08l1Organizational.12456",
          "summary": "Electronic and physical media containing covered information is securely sanitized prior to reuse, or if it cannot be sanitized, is destroyed prior to disposal.",
          "requirement": "08.l",
          "applicable": true
        },
        {
          "ref": "1826.09p1Organizational.1",
          "summary": "The organization securely disposes of media containing sensitive information.",
          "requirement": "09.p",
          "applicable": true
        },
        {
          "ref": "1844.08b1Organizational.6",
          "summary": "The organization develops, approves and maintains a list of individuals with authorized access to the facility where the information system resides; issues authorization credentials for facility access; reviews the access list and authorization credentials periodically but no less than quarterly; and removes individuals from the facility access list when access is no longer required.",
          "requirement": "08.b",
          "applicable": true
        },
        {
          "ref": "1845.08b1Organizational.7",
          "summary": "For facilities where the information system resides, the organization enforces physical access authorizations at defined entry/exit points to the facility where the information system resides, maintains physical access audit logs, and provides security safeguards that the organization determines necessary for areas officially designated as publicly accessible.",
          "requirement": "08.b",
          "applicable": true
        },
        {
          "ref": "18127.08l1Organizational.3",
          "summary": "Surplus equipment is stored securely while not in use, and disposed of or sanitized when no longer required.",
          "requirement": "08.l",
          "applicable": true
        },
        {
          "ref": "18130.09p1Organizational.24",
          "summary": "The organization ensures the risk of information leakage to unauthorized persons during secure media disposal is minimized. If collection and disposal services offered by other organizations are used, care is taken in selecting a suitable contractor with adequate controls and experience.",
          "requirement": "09.p",
          "applicable": true
        },
        {
          "ref": "18131.09p1Organizational.3",
          "summary": "Disposal methods are commensurate with the sensitivity of the information contained on the media.",
          "requirement": "09.p",
          "applicable": true
        }
      ]
    },
    {
      "title": "19 Data Protection & Privacy",
      "description": "Addresses the organization's compliance and privacy program and related controls",
      "controls": [
        {
          "ref": "1901.06d1Organizational.1",
          "summary": "The organization has formally appointed a data protection officer responsible for the privacy of covered information.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "1902.06d1Organizational.2",
          "summary": "When required, consent is obtained before any protected information (e.g. about a patient) is emailed, faxed, or communicated by telephone conversation, or otherwise disclosed to parties external to the organization.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "1903.06d1Organizational.3456711",
          "summary": "The confidentiality and integrity of covered information at rest is protected using an encryption method appropriate to the medium where it is stored;  where the organization chooses not to encrypt covered information, a documented rationale for not doing so is maintained or alternative compensating controls are used if the method is approved and reviewed annually by the CISO.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "1905.06c1Organizational.6",
          "summary": "The covered entity ensures PHI is safeguarded for a period of fifty (50) years following the death of the individual.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "1906.06c1Organizational.2",
          "summary": "The covered entity documents compliance with the notice requirements by retaining copies of the notices issued by the covered entity for a period of six (6) years and, if applicable, any written acknowledgements of receipt of the notice or documentation of good faith efforts to obtain such written acknowledgement.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "1907.06c1Organizational.3",
          "summary": "The covered entity documents restrictions in writing and formally maintains such writing, or an electronic copy of such writing as an organizational record for a period of six (6) years.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "1908.06c1Organizational.4",
          "summary": "The covered entity documents and maintains the designated record sets that are subject to access by individuals and the titles of the persons or office responsible for receiving and processing requests for access by individuals as organizational records for a period of six (6) years.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "1909.06c1Organizational.5",
          "summary": "The covered entity documents and maintains accountings of disclosure as organizational records for a period of six (6) years, including the information required for disclosure, the written accounting provided to the individual, and the titles of the persons or offices responsible for receiving and processing requests for an accounting.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "1911.06d1Organizational.13",
          "summary": "Records with sensitive personal information are protected during transfer to organizations lawfully collecting such information.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "19140.06c1Organizational.1",
          "summary": "The organization's formal policies and procedures, other critical records and disclosures of individuals' protected health information made are retained for a minimum of six (6) years; and, for electronic health records, the organization retains records of disclosures to carry out treatment, payment and health care operations for a minimum of three (3) years.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "19141.06c1Organizational.7",
          "summary": "Important records, such as contracts, personnel records, financial information, patient records, etc., of the organization are protected from loss, destruction and falsification through the implementation of security controls such as access controls, encryption, backups, electronic signatures, locked facilities or containers, etc.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "19142.06c1Organizational.8",
          "summary": "Guidelines are issued by the organization on the ownership, classification, retention, storage, handling and disposal of ALL records and information.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "19143.06c1Organizational.9",
          "summary": "Designated senior management within the organization reviews and approves the security categorizations and associated guidelines.",
          "requirement": "06.c",
          "applicable": true
        },
        {
          "ref": "19242.06d1Organizational.14",
          "summary": "Covered information storage is kept to a minimum.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "19243.06d1Organizational.15",
          "summary": "The organization specifies where covered information can be stored.",
          "requirement": "06.d",
          "applicable": true
        },
        {
          "ref": "19134.05j1Organizational.5",
          "summary": "The public has access to information about the organization's security and privacy activities and is able to communicate with its senior security official and senior privacy official.",
          "requirement": "05.j",
          "applicable": true
        }
      ]
    }
  ]
}