{
    "standard": "ISO/IEC 27001:2022",
    "version": "2022",
    "domains": [
        {
            "title": "4 - Context of the organization",
            "controls": [
                {
                    "ref": "4.1",
                    "title": "Understanding the organization and its context",
                    "summary": "The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its information security management system.",
                    "mappedControls": [
                        "cp-compliance-mgmt",
                        "cp-ism-scope"
                    ]
                },
                {
                    "ref": "4.2.a",
                    "title": "Understanding the needs and expectations of interested parties, part a)",
                    "summary": "The organization shall determine: a) interested parties that are relevant to the information security management system.",
                    "mappedControls": [
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "4.2.b",
                    "title": "Understanding the needs and expectations of interested parties, part b)",
                    "summary": "The organization shall determine: b) the relevant requirements of these interested parties. Note: the requirements of interested parties  include legal and regulatory requirements and contractual obligations.",
                    "mappedControls": [
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "4.2.c",
                    "title": "Understanding the needs and expectations of interested parties, part c)",
                    "summary": "The organization shall determine: c) which of these requirements will be addressed through the information security managment system",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-ism-policies"
                    ]
                },
                {
                    "ref": "4.3.a",
                    "title": "Determining the scope of the information security management system, part a)",
                    "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: the external and internal issues referred to in 4.1 The scope shall be available as documented information.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-model-architecture",
                        "cp-vendor-contracts",
                        "cp-audit-customers",
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "4.3.b",
                    "title": "Determining the scope of the information security management system, part b)",
                    "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: the requirements referred to in 4.2. The scope shall be available as documented information.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-audit-customers",
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "4.3.c",
                    "title": "Determining the scope of the information security management system, part c)",
                    "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. The scope shall be available as documented information.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-vendor-contracts",
                        "cp-vendor-vtr",
                        "cp-vendor-ssa"
                    ]
                },
                {
                    "ref": "4.4",
                    "title": "Information security management system",
                    "summary": "The organization shall establish, implement, maintain, and continually improve an information security management system, including the processes needed and thier interactions, in accordance with the requirements of this International Standard.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-ism-policies",
                        "cp-ism-reporting"
                    ]
                }
            ]
        },
        {
            "title": "5 - Leadership",
            "controls": [
                {
                    "ref": "5.1.a",
                    "title": "Leadership and Commitment, part a)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by:ensuring the information security policy and the information security objectives are established and compatible with the strategic direction of the organization.",
                    "mappedControls": [
                        "cp-ism-policies",
                        "cp-policy-mgmt"
                    ]
                },
                {
                    "ref": "5.1.b",
                    "title": "Leadership and commitment, part b)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring the integration of the information security management system requirements into the organization's processes.",
                    "mappedControls": [
                        "cp-ism-policies",
                        "cp-policy-mgmt",
                        "cp-ism-scope",
                        "cp-sanctions",
                        "cp-role-assignment"
                    ]
                },
                {
                    "ref": "5.1.c",
                    "title": "Leadership and commitment, part c)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring that the resources needed for the information security management system are available.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "5.1.d",
                    "title": "Leadership and commitment, part d)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: communicating the importance of effective information security management and of conforming to the information security management system requirements.",
                    "mappedControls": [
                        "cp-training-policy",
                        "cp-training-awareness",
                        "cp-sanctions",
                        "ref-employee-handbook",
                        "cp-employee-recognition",
                        "cp-employee-onboarding",
                        "cp-employee-acceptable-use"
                    ]
                },
                {
                    "ref": "5.1.e",
                    "title": "Leadership and commitment, part e)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring that the information security management system achieves its intended outcome(s).",
                    "mappedControls": [
                        "cp-compliance-requests",
                        "cp-audit-types",
                        "cp-audit-internal",
                        "cp-audit-review",
                        "cp-compliance-mgmt",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "5.1.f",
                    "title": "Leadership and commitment, part f)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: directing and supporting persons to contribute to the effectiveness of the information security management system.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-employee-recognition",
                        "cp-employee-whistleblower",
                        "cp-employee-escalation",
                        "cp-employee-development"
                    ]
                },
                {
                    "ref": "5.1.g",
                    "title": "Leadership and commitment, part g)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: promoting continual improvement.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-model-metrics",
                        "cp-employee-development"
                    ]
                },
                {
                    "ref": "5.1.h",
                    "title": "Leadership and commitment, part h)",
                    "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: supporting other relevant management roles to demonstrate their leadership as it applies to their area of responsibility.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-employee-recognition",
                        "cp-employee-development"
                    ]
                },
                {
                    "ref": "5.2.a",
                    "title": "Policy, part a)",
                    "summary": "Top management shall establish an information security policy that: is appropriate to the purpose of the organization.",
                    "mappedControls": [
                        "cp-ism-policies"
                    ]
                },
                {
                    "ref": "5.2.b",
                    "title": "Policy, part b)",
                    "summary": "Top management shall establish an information security policy that: includes information security objectives (see 6.2) or provides the framework for setting information security objectives.",
                    "mappedControls": [
                        "cp-policy-framework",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "5.2.c",
                    "title": "Policy, part c)",
                    "summary": "Top management shall establish an information security policy that: includes a commitment to satisfy applicable requirements related to information security.",
                    "mappedControls": [
                        "cp-compliance-mgmt",
                        "cp-compliance-monitor",
                        "cp-policy-framework"
                    ]
                },
                {
                    "ref": "5.2.d",
                    "title": "Policy, part d)",
                    "summary": "Top management shall establish an information security policy that: includes a commitment to continual improvement of the information security management system.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-ism-reporting"
                    ]
                },
                {
                    "ref": "5.2.e",
                    "title": "Policy, part e)",
                    "summary": "The information security policy shall: be available as documented information.",
                    "mappedControls": [
                        "cp-ism-policies"
                    ]
                },
                {
                    "ref": "5.2.f",
                    "title": "Policy, part f)",
                    "summary": "The information security policy shall: be communicated within the organization.",
                    "mappedControls": [
                        "cp-ism-policies",
                        "cp-employee-onboarding",
                        "cp-employee-acceptable-use",
                        "cp-training-awareness"
                    ]
                },
                {
                    "ref": "5.2.g",
                    "title": "Policy, part g)",
                    "summary": "The information security policy shall: be available to interested parties, as appropriate.",
                    "mappedControls": [
                        "ref-privacy-policy",
                        "ref-employee-handbook",
                        "cp-ism-policies",
                        "cp-audit-customers"
                    ]
                },
                {
                    "ref": "5.3.a",
                    "title": "Organizatonal roles, responsibilities, and authorities, part a)",
                    "summary": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated. Top management shall assign the responsibility and authority for: ensuring that the information security management system conforms to the requirements of this document. Note: Top management can also assign responsibilities and authorities for reporting performance of the information security management system within the organization.",
                    "mappedControls": [
                        "cp-role-assignment"
                    ]
                },
                {
                    "ref": "5.3.b",
                    "title": "Organizatonal roles, responsibilities, and authorities, part b)",
                    "summary": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated. Top management shall assign the responsibility and authority for: reporting on the performance of the information security management system to top management. Note: Top management can also assign responsibilities and authorities for reporting performance of the information security management system within the organization.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-compliance-monitor"
                    ]
                }
            ]
        },
        {
            "title": "6 - Planning",
            "controls": [
                {
                    "ref": "6.1.1.a",
                    "title": "General planning, part a)",
                    "summary": "When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: ensure the information security management system can achieve its intended outcome(s).",
                    "mappedControls": [
                        "cp-bcdr",
                        "cp-model-metrics",
                        "cp-model-architecture",
                        "cp-ism-scope"
                    ]
                },
                {
                    "ref": "6.1.1.b",
                    "title": "General planning, part b)",
                    "summary": "When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: prevent, or reduce, undesired effects.",
                    "mappedControls": [
                        "cp-model-architecture",
                        "cp-risk-assess",
                        "cp-risk-fraud",
                        "cp-risk-mgmt-objectives"
                    ]
                },
                {
                    "ref": "6.1.1.c",
                    "title": "General planning, part c)",
                    "summary": "When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: achieve continual improvement.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-risk-mgmt-objectives"
                    ]
                },
                {
                    "ref": "6.1.1.d",
                    "title": "General planning, part d)",
                    "summary": "The organization shall plan: actions to address these risks and opportunities.",
                    "mappedControls": [
                        "cp-risk-mgmt",
                        "cp-risk-mitigation",
                        "cp-risk-insurance"
                    ]
                },
                {
                    "ref": "6.1.1.e",
                    "title": "General planning, part e)",
                    "summary": "The organization shall plan: how to 1) integrate and implement the actions into its information security management system; and 2) evaluate the effectiveness of these actions.",
                    "mappedControls": [
                        "cp-compliance-monitor",
                        "cp-sdlc-monitor",
                        "cp-ccm-monitor",
                        "cp-vendor-monitor",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "6.1.2.a",
                    "title": "Information security risk assessment, part a)",
                    "summary": "The organization shall define and apply an information security risk assessment process that: establishes and maintains information security risk criteria that include: 1) the risk acceptance criteria; and 2) criteria for performing information security risk assessments.The organization shall retain documented information about the information security risk assessment process.",
                    "mappedControls": [
                        "cp-risk-mgmt-objectives",
                        "cp-risk-assess"
                    ]
                },
                {
                    "ref": "6.1.2.b",
                    "title": "Information security risk assessment, part b)",
                    "summary": "The organization shall define and apply an information security risk assessment process that: ensures that repeated information security risk assessments produce consistent, valid and comparable results. The organization shall retain documented information about the information security risk assessment process.",
                    "mappedControls": [
                        "cp-risk-mgmt-objectives",
                        "cp-risk-assess",
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "6.1.2.c",
                    "title": "Information security risk assessment, part c)",
                    "summary": "The organization shall define and apply an information security risk assessment process that identifies the information security risks: 1) to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; and 2) identify the risk owners. The organization shall retain documented information about the information security risk assessment process.",
                    "mappedControls": [
                        "cp-risk-assess",
                        "cp-risk-registry",
                        "cp-risk-fraud"
                    ]
                },
                {
                    "ref": "6.1.2.d",
                    "title": "Information security risk assessment, part d)",
                    "summary": "The organization shall define and apply an information security risk assessment process that analyzes the information security risks [to] 1) assess the potential consequences that would result if the risks identified in 6.1.2 c) 1) were to materialize 2) assess the realistic likelihood of occurence of the risks identified in 6.1.2 c) 1)[and] 3) determine the levels of risk. The organization shall retain documented information about the information security risk assessment process.",
                    "mappedControls": [
                        "cp-risk-mgmt",
                        "cp-risk-mgmt-objectives",
                        "cp-risk-assess",
                        "cp-risk-registry",
                        "cp-risk-fraud"
                    ]
                },
                {
                    "ref": "6.1.2.e",
                    "title": "Information security risk assessment, part e)",
                    "summary": "The organization shall define and apply an information security risk assessment process that evaluates the information security risks [to] 1) compare the results of risk analysis with the risk criteria established in 6.1.2 [and] 2) prioritize the analyzed risks for risk treatment. The organization shall retain documented information about the information security risk assessment process.",
                    "mappedControls": [
                        "cp-risk-mgmt",
                        "cp-risk-mgmt-objectives",
                        "cp-risk-assess",
                        "cp-risk-registry",
                        "cp-risk-mitigation"
                    ]
                },
                {
                    "ref": "6.1.3.a",
                    "title": "Information security risk treatment, part a)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: select appropriate information security treatment options, taking account of the risk assessment results. The organization shall retain documented information about the information security risk treatment process.",
                    "mappedControls": [
                        "cp-risk-assess",
                        "cp-risk-mitigation",
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "6.1.3.b",
                    "title": "Information security risk treatment, part b)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: determine all controls that are necessary to implement the information security risk treatment option(s) chosen. The organization shall retain documented information about the information security risk treatment process. NOTE 1: Organizations can design controls as required, or identify them from any source",
                    "mappedControls": [
                        "cp-risk-assess",
                        "cp-risk-mitigation"
                    ]
                },
                {
                    "ref": "6.1.3.c",
                    "title": "Information security risk treatment, part c)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: compare the controls determined in 6.1.3 b) with those in Annex A and verify that nonecessary controls have been omitted. The organization shall retain documented information about the information security risk treatment process. Note 2) Annex A contains a list of possible information security controls. Users of this document are directed to Annex A to ensure that no necessary information security controls are overlooked.",
                    "mappedControls": [
                        "cp-risk-mitigation",
                        "cp-audit-control-deficiency",
                        "cp-audit-internal",
                        "cp-audit-tools",
                        "cp-compliance-monitor"
                    ]
                },
                {
                    "ref": "6.1.3.d",
                    "title": "Information security risk treatment, part d)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: produce a Statement of Applicability that contains the necessary controls (see 6.1.3 b) and c)) justification for inclusions, whether the necessary controls are implemented or not, and the justification for excluding any of the Annex A controls. The organization shall retain documented information about the information security risk treatment process.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-risk-assess",
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "6.1.3.e",
                    "title": "Information security risk treatment, part e)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: formulate an information security risk treatment plan. The organization shall retain documented information about the information security risk treatment process.",
                    "mappedControls": [
                        "cp-risk-mgmt",
                        "cp-risk-mitigation",
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "6.1.3.f",
                    "title": "Information security risk treatment, part f)",
                    "summary": "The organization shall define and apply an information security risk treatment process to: obtain risk owners’ approval of the information security risk treatment plan and acceptance of the residual information security risks. The organization shall retain documented information about the information security risk treatment process.",
                    "mappedControls": [
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "6.2.a",
                    "title": "Information security objectives and planning to achieve them, part a)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be consistent with the information security policy. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-policy-framework",
                        "cp-ism-policies"
                    ]
                },
                {
                    "ref": "6.2.b",
                    "title": "Information security objectives and planning to achieve them, part b)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be measurable (if practicable). The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-ism-reporting",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "6.2.c",
                    "title": "Information security objectives and planning to achieve them, part c)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: take into account applicable information security requirements, and results from risk assessment and risk treatment. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-ism-reporting",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "6.2.d",
                    "title": "Information security objectives and planning to achieve them, part d)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be monitored. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-ism-reporting",
                        "cp-model-metrics"
                    ]
                },
                {
                    "ref": "6.2.e",
                    "title": "Information security objectives and planning to achieve them, part e)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be communicated. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-internal-comms",
                        "cp-training-awareness",
                        "cp-model-principles"
                    ]
                },
                {
                    "ref": "6.2.f",
                    "title": "Information security objectives and planning to achieve them, part f)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be be updated as appropriate. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-model-principles"
                    ]
                },
                {
                    "ref": "6.2.g",
                    "title": "Information security objectives and planning to achieve them, part g)",
                    "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be available as documented information. The organization shall retain documented information on the information security objectives.",
                    "mappedControls": [
                        "cp-policy-framework"
                    ]
                },
                {
                    "ref": "6.2.h",
                    "title": "Information security objectives and planning to achieve them, part h)",
                    "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: what will be done.",
                    "mappedControls": [
                        "cp-ism-policies",
                        "cp-role-assignment"
                    ]
                },
                {
                    "ref": "6.2.i",
                    "title": "Information security objectives and planning to achieve them, part i)",
                    "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: what resources will be required.",
                    "mappedControls": [
                        "cp-model-architecture",
                        "cp-bcdr"
                    ]
                },
                {
                    "ref": "6.2.j",
                    "title": "Information security objectives and planning to achieve them, part j)",
                    "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: who will be responsible.",
                    "mappedControls": [
                        "cp-role-assignment"
                    ]
                },
                {
                    "ref": "6.2.k",
                    "title": "Information security objectives and planning to achieve them, part k)",
                    "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: when it will be completed.",
                    "mappedControls": [
                        "cp-ccm-config"
                    ]
                },
                {
                    "ref": "6.2.l",
                    "title": "Information security objectives and planning to achieve them, part l)",
                    "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: how the results will be evaluated.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-model-quality"
                    ]
                }
            ]
        },
        {
            "title": "7 - Support",
            "controls": [
                {
                    "ref": "7.1",
                    "title": "Resources",
                    "summary": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the information security management system.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-hr-mgmt",
                        "cp-model-metrics",
                        "cp-model-quality"
                    ]
                },
                {
                    "ref": "7.2.a",
                    "title": "Competence, part a)",
                    "summary": "The organization shall: determine the necessary competence of person(s) doing work under its control that affects its information security performance.",
                    "mappedControls": [
                        "cp-employee-screening",
                        "cp-employee-performance",
                        "cp-employee-development"
                    ]
                },
                {
                    "ref": "7.2.b",
                    "title": "Competence, part b)",
                    "summary": "The organization shall: ensure that these persons are competent on the basis of appropriate education, training, or experience.",
                    "mappedControls": [
                        "cp-employee-screening",
                        "cp-employee-development",
                        "cp-hr-mgmt"
                    ]
                },
                {
                    "ref": "7.2.c",
                    "title": "Competence, part c)",
                    "summary": "The organization shall: where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken. NOTE: Applicable actions can include, for example: the provision of training to, the mentoring of, or the reassignment of current employees; or the hiring or contracting of competent persons.",
                    "mappedControls": [
                        "cp-employee-development",
                        "cp-sanctions",
                        "cp-training-policy",
                        "cp-training-awareness"
                    ]
                },
                {
                    "ref": "7.2.d",
                    "title": "Competence, part d)",
                    "summary": "The organization shall: retain appropriate documented information as evidence of competence.",
                    "mappedControls": [
                        "cp-employee-screening",
                        "cp-employee-development",
                        "cp-sanctions",
                        "cp-hr-mgmt"
                    ]
                },
                {
                    "ref": "7.3.a",
                    "title": "Awareness, part a)",
                    "summary": "Persons doing work under the organization’s control shall be aware of: the information security policy.",
                    "mappedControls": [
                        "cp-training-awareness"
                    ]
                },
                {
                    "ref": "7.3.b",
                    "title": "Awareness, part b)",
                    "summary": "Persons doing work under the organization’s control shall be aware of: their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance.",
                    "mappedControls": [
                        "cp-training-awareness",
                        "cp-employee-development",
                        "cp-sanctions"
                    ]
                },
                {
                    "ref": "7.3.c",
                    "title": "Awareness, part c)",
                    "summary": "Persons doing work under the organization’s control shall be aware of: the implications of not conforming with the information security management system requirements.",
                    "mappedControls": [
                        "cp-training-awareness",
                        "ref-employee-handbook",
                        "cp-employee-acceptable-use"
                    ]
                },
                {
                    "ref": "7.4.a",
                    "title": "Communication, part a)",
                    "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: on what to communicate.",
                    "mappedControls": [
                        "cp-internal-comms",
                        "cp-audit-customers",
                        "cp-breach-customer",
                        "cp-privacy-notices",
                        "ref-privacy-policy",
                        "cp-vendor-contracts"
                    ]
                },
                {
                    "ref": "7.4.b",
                    "title": "Communication, part b)",
                    "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: when to communicate.",
                    "mappedControls": [
                        "cp-internal-comms",
                        "cp-breach-customer",
                        "cp-privacy-notices"
                    ]
                },
                {
                    "ref": "7.4.c",
                    "title": "Communication, part c)",
                    "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: with whom to communicate.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-internal-comms"
                    ]
                },
                {
                    "ref": "7.4.d",
                    "title": "Communication, part d)",
                    "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: how to communicate.",
                    "mappedControls": [
                        "cp-ir-playbook",
                        "cp-bcdr",
                        "cp-breach-customer",
                        "cp-breach-authorities",
                        "cp-breach-letter"
                    ]
                },
                {
                    "ref": "7.5.1.a",
                    "title": "Documented information - General, part a)",
                    "summary": "The organization’s information security management system shall include: documented information required by this document. NOTE The extent of documented information for an information security management system can differ from one organization to another due to: 1) the size of organization and its type of activities, processes, products and services; 2) the complexity of processes and their interactions; and 3) the competence of persons.",
                    "mappedControls": [
                        "cp-policy-framework",
                        "cp-ism-scope",
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "7.5.1.b",
                    "title": "Documented information - General, part b)",
                    "summary": "The organization’s information security management system shall include: documented information determined by the organization as being necessary for the effectiveness of the information security management system. NOTE The extent of documented information for an information security management system can differ from one organization to another due to: 1) the size of organization and its type of activities, processes, products and services; 2) the complexity of processes and their interactions; and 3) the competence of persons.",
                    "mappedControls": [
                        "cp-employee-screening",
                        "cp-employee-development"
                    ]
                },
                {
                    "ref": "7.5.2.a",
                    "title": "Documented information - Creating and updating, part a)",
                    "summary": "When creating and updating documented information the organization shall ensure appropriate: identification and description (e.g. a title, date, author, or reference number).",
                    "mappedControls": [
                        "cp-policy-mgmt"
                    ]
                },
                {
                    "ref": "7.5.2.b",
                    "title": "Documented information - Creating and updating, part b)",
                    "summary": "When creating and updating documented information the organization shall ensure appropriate:format (e.g. language, software version, graphics) and media (e.g. paper, electronic).",
                    "mappedControls": []
                },
                {
                    "ref": "7.5.2.c",
                    "title": "Documented information - Creating and updating, part c)",
                    "summary": "When creating and updating documented information the organization shall ensure appropriate:review and approval for suitability and adequacy.",
                    "mappedControls": [
                        "cp-policy-framework"
                    ]
                },
                {
                    "ref": "7.5.3.a",
                    "title": "Documented information - Control, part a)",
                    "summary": "Documented information required by the information security management system and by this International Standard shall be controlled to ensure: it is available and suitable for use, where and when it is needed.",
                    "mappedControls": [
                        "cp-policy-framework",
                        "cp-privacy-notices",
                        "ref-privacy-policy",
                        "cp-internal-comms"
                    ]
                },
                {
                    "ref": "7.5.3.b",
                    "title": "Documented information - Control, part b)",
                    "summary": "Documented information required by the information security management system and by this International Standard shall be controlled to ensure: it is adequately protected (e.g. from loss of confidentiality, improper use, or loss of integrity).",
                    "mappedControls": [
                        "cp-data-classification",
                        "cp-data-handling",
                        "cp-data-backup",
                        "cp-data-protection",
                        "cp-data-protection-integrity",
                        "cp-audit-trails-integrity",
                        "cp-ccm-config"
                    ]
                },
                {
                    "ref": "7.5.3.c",
                    "title": "Documented information - Control, part c)",
                    "summary": "For the control of documented information, the organization shall address the following activities, as applicable: distribution, access, retrieval and use. NOTE Access can imply a decision regarding the permission to view the documented information only, or the permission and authority to view and change the documented information, etc.",
                    "mappedControls": [
                        "cp-access-standards",
                        "cp-data-handling",
                        "cp-data-protection",
                        "cp-access-privileged",
                        "cp-access-rbac"
                    ]
                },
                {
                    "ref": "7.5.3.d",
                    "title": "Documented information - Control, part d)",
                    "summary": "For the control of documented information, the organization shall address the following activities, as applicable: storage and preservation, including the preservation of legibility.",
                    "mappedControls": [
                        "cp-data-lifecycle",
                        "cp-data-backup",
                        "cp-data-protection",
                        "cp-data-protection-integrity",
                        "cp-audit-trails-integrity"
                    ]
                },
                {
                    "ref": "7.5.3.e",
                    "title": "Documented information - Control, part e)",
                    "summary": "For the control of documented information, the organization shall address the following activities, as applicable: control of changes (e.g. version control).",
                    "mappedControls": [
                        "cp-data-protection-integrity",
                        "cp-ccm-config",
                        "cp-access-change"
                    ]
                },
                {
                    "ref": "7.5.3.f",
                    "title": "Documented information - Control, part f)",
                    "summary": "For the control of documented information, the organization shall address the following activities, as applicable: retention and disposition. Documented information of external origin, determined by the organization to be necessary for the planning and operation of the information security management system, shall be identified as appropriate, and controlled.",
                    "mappedControls": [
                        "cp-data-lifecycle",
                        "cp-data-backup",
                        "cp-data-deletion",
                        "cp-mdm-disposal"
                    ]
                }
            ]
        },
        {
            "title": "8 - Operation",
            "controls": [
                {
                    "ref": "8.1",
                    "title": "Operational planning and control",
                    "summary": "The organization shall plan, implement and control the processes needed to meet requirements, and to implement the actions determined in Clause 6, by establishing criteria for the processes and implementing control of the processes in accordance with the criteria. Documented information shall be available to the extent necessary to have confidence that the processes have been carried out as planned. The organization shall control planned changes and review the consequences of unintended changes, taking action to mitigate any adverse effects, as necessary. The organization shall ensure that outsourced processes are determined and controlled.",
                    "mappedControls": [
                        "cp-sdlc-outsourcing",
                        "cp-vendor-vtr",
                        "cp-vendor-contracts",
                        "cp-vendor-monitor"
                    ]
                },
                {
                    "ref": "8.2",
                    "title": "Information security risk assessment",
                    "summary": "The organization shall perform information security risk assessments at planned intervals or when significant changes are proposed or occur, taking account of the criteria established in 6.1.2 a). The organization shall retain documented information of the results of the information security risk assessments.",
                    "mappedControls": [
                        "cp-risk-mgmt",
                        "cp-risk-assess",
                        "cp-risk-registry",
                        "cp-risk-fraud"
                    ]
                },
                {
                    "ref": "8.3",
                    "title": "Information security risk treatment",
                    "summary": "The organization shall implement the information security risk treatment plan. The organization shall retain documented information of the results of the information security risk treatment.",
                    "mappedControls": [
                        "cp-risk-registry",
                        "cp-risk-mitigation",
                        "cp-risk-insurance"
                    ]
                }
            ]
        },
        {
            "title": "9 - Performance evaluation",
            "controls": [
                {
                    "ref": "9.1.a",
                    "title": "Monitoring, measurement, analysis, and evaluation, part a)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: what needs to be monitored and measured, including information security processes and controls. Documented information shall be available as evidence of the results.",
                    "mappedControls": [
                        "cp-compliance-monitor",
                        "cp-model-metrics",
                        "cp-model-quality"
                    ]
                },
                {
                    "ref": "9.1.b",
                    "title": "Monitoring, measurement, analysis, and evaluation, part b)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: the methods for monitoring, measurement, analysis and evaluation, as applicable, to ensure valid results. The methods selected should produce comparable and reproducible results to be considered valid. Documented information shall be available as evidence of the results.",
                    "mappedControls": [
                        "cp-compliance-monitor",
                        "cp-model-metrics",
                        "cp-model-quality"
                    ]
                },
                {
                    "ref": "9.1.c",
                    "title": "Monitoring, measurement, analysis, and evaluation, part c)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: when the monitoring and measuring shall be performed. Documented information shall be available as evidence of the results.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-audit-internal",
                        "cp-compliance-monitor"
                    ]
                },
                {
                    "ref": "9.1.d",
                    "title": "Monitoring, measurement, analysis, and evaluation, part d)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: who shall monitor and measure. Documented information shall be available as evidence of the results.",
                    "mappedControls": [
                        "cp-role-assignment",
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "9.1.e",
                    "title": "Monitoring, measurement, analysis, and evaluation, part e)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: when the results from monitoring and measurement shall be analysed and evaluated.",
                    "mappedControls": [
                        "cp-audit-tools",
                        "cp-compliance-monitor"
                    ]
                },
                {
                    "ref": "9.1.f",
                    "title": "Monitoring, measurement, analysis, and evaluation, part f)",
                    "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: who shall analyse and evaluate these results. The organization shall retain appropriate documented information as evidence of the monitoring and measurement results.",
                    "mappedControls": [
                        "cp-audit-control-deficiency",
                        "cp-audit-review",
                        "cp-compliance-mgmt"
                    ]
                },
                {
                    "ref": "9.2.1.a",
                    "title": "Internal audit, General part a)",
                    "summary": "The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: conforms to the organization’s own requirements for its information security management system; and the requirements of this International Standard.",
                    "mappedControls": [
                        "cp-internal-audit"
                    ]
                },
                {
                    "ref": "9.2.1.b",
                    "title": "Internal audit, General, part b)",
                    "summary": "The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: is effectively implemented and maintained.",
                    "mappedControls": [
                        "cp-internal-audit",
                        "cp-audit-control-deficiency",
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "9.2.2.a",
                    "title": "Internal audit programme, part a)",
                    "summary": "The organization shall plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. When establishing the internal audit programme(s), the organization shall consider the importance of the processes concerned and the results of previous audits. The organization shall: define the audit criteria and scope for each audit. Documented information shall be available as evidence of the implementation of the audit programme(s)and the audit results.",
                    "mappedControls": [
                        "cp-audit-types",
                        "cp-audit-internal",
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "9.2.2.b",
                    "title": "Internal audit programme, part b)",
                    "summary": "The organization shall plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. When establishing the internal audit programme(s), the organization shall consider the importance of the processes concerned and the results of previous audits. The organization shall: select auditors and conduct audits that ensure objectivity and the impartiality of the audit process. Documented information shall be available as evidence of the implementation of the audit programme(s)and the audit results.",
                    "mappedControls": [
                        "cp-audit-types",
                        "cp-audit-internal",
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "9.2.2.c",
                    "title": "Internal audit programme, part c)",
                    "summary": "The organization shall plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. When establishing the internal audit programme(s), the organization shall consider the importance of the processes concerned and the results of previous audits. The organization shall: ensure that the results of the audits are reported to relevant management. Documented information shall be available as evidence of the implementation of the audit programme(s)and the audit results.",
                    "mappedControls": [
                        "cp-audit-review",
                        "cp-audit-internal"
                    ]
                },
                {
                    "ref": "9.3.1",
                    "title": "Management review, General",
                    "summary": "Top management shall review the organization’s information security management system at planned intervals to ensure its continuing suitability, adequacy and effectiveness.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-policy-mgmt",
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-compliance-mgmt",
                        "cp-ism-reporting"
                    ]
                },
                {
                    "ref": "9.3.2.a",
                    "title": "Management review inputs, part a)",
                    "summary": "The management review shall include consideration of: the status of actions from previous management reviews.",
                    "mappedControls": [
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "9.3.2.b",
                    "title": "Management review inputs, part b)",
                    "summary": "The management review shall include consideration of: changes in external and internal issues that are relevant to the information security management system.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-policy-framework"
                    ]
                },
                {
                    "ref": "9.3.2.c",
                    "title": "Management review inputs, part c)",
                    "summary": "The management review shall include consideration of: changes in needs and expectations of interested parties that are relevant to the information security management system",
                    "mappedControls": [
                        "cp-ism-scope"
                    ]
                },
                {
                    "ref": "9.3.2.d",
                    "title": "Management review, part d)",
                    "summary": "The management review shall include consideration of: feedback on the information security performance, including trends in: nonconformities and corrective actions; monitoring and measurement results; audit results; and fulfilment of information security objectives.",
                    "mappedControls": [
                        "cp-model-metrics",
                        "cp-model-quality",
                        "cp-compliance-mgmt",
                        "cp-ism-reporting",
                        "cp-audit-review",
                        "cp-sdlc-pentest",
                        "cp-ir-emergency",
                        "cp-ir-tabletop",
                        "cp-bcdr-test"
                    ]
                },
                {
                    "ref": "9.3.2.e",
                    "title": "Management review, part e)",
                    "summary": "The management review shall include consideration of: feedback from interested parties.",
                    "mappedControls": [
                        "cp-employee-whistleblower",
                        "cp-audit-review"
                    ]
                },
                {
                    "ref": "9.3.2.f",
                    "title": "Management review, part f)",
                    "summary": "The management review shall include consideration of: results of risk assessment and status of risk treatment plan.",
                    "mappedControls": [
                        "cp-risk-assess",
                        "cp-risk-mitigation",
                        "cp-risk-registry"
                    ]
                },
                {
                    "ref": "9.3.2.g",
                    "title": "Management review, part g)",
                    "summary": "The management review shall include consideration of: opportunities for continual improvement.",
                    "mappedControls": [
                        "cp-ism-reporting",
                        "cp-sdlc-monitor"
                    ]
                },
                {
                    "ref": "9.3.3",
                    "title": "Management review results",
                    "summary": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the information security management system.",
                    "mappedControls": [
                        "cp-ism-scope",
                        "cp-hr-mgmt",
                        "cp-model-metrics",
                        "cp-model-quality"
                    ]
                }
            ]
        },
            {
                "title": "10 - Improvement",
                "controls": [
                    {
                        "ref": "10.1",
                        "title": "Continual improvement",
                        "summary": "The organization shall continually improve the suitability, adequacy and effectiveness of the information security management system",
                        "mappedControls": [
                            "cp-ism-reporting",
                            "cp-compliance-mgmt",
                            "cp-model-quality"
                        ]
                    },
                    {
                        "ref": "10.2.a",
                        "title": "Nonconformity and corrective action, part a)",
                        "summary": "When a nonconformity occurs, the organization shall: react to the nonconformity, and as applicable: take action to control and correct it; and deal with the consequences.",
                        "mappedControls": [
                            "cp-sdlc-sast",
                            "cp-sdlc-dast",
                            "cp-sdlc-iaaa",
                            "cp-vuln-remediation",
                            "cp-risk-mitigation",
                            "cp-audit-control-deficiency"
                        ]
                    },
                    {
                        "ref": "10.2.b",
                        "title": "Nonconformity and corrective action, part b)",
                        "summary": "When a nonconformity occurs, the organization shall: evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: reviewing the nonconformity; determining the causes of the nonconformity; and determining if similar nonconformities exist, or could potentially occur.",
                        "mappedControls": [
                            "cp-sdlc-iaaa",
                            "cp-audit-control-deficiency",
                            "cp-breach-investigate"
                        ]
                    },
                    {
                        "ref": "10.2.c",
                        "title": "Nonconformity and corrective action, part c)",
                        "summary": "When a nonconformity occurs, the organization shall: evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: implement any action needed.",
                        "mappedControls": [
                            "cp-risk-mitigation",
                            "cp-vuln-remediation"
                        ]
                    },
                    {
                        "ref": "10.2.d",
                        "title": "Nonconformity and corrective action, part d)",
                        "summary": "When a nonconformity occurs, the organization shall: review the effectiveness of any corrective action taken.",
                        "mappedControls": [
                            "cp-risk-mgmt",
                            "cp-compliance-mgmt",
                            "cp-risk-mitigation"
                        ]
                    },
                    {
                        "ref": "10.2.e",
                        "title": "Nonconformity and corrective action, part e)",
                        "summary": "When a nonconformity occurs, the organization shall: make changes to the information security management system, if necessary.",
                        "mappedControls": [
                            "cp-compliance-mgmt",
                            "cp-risk-mitigation",
                            "cp-policy-mgmt"
                        ]
                    },
                    {
                        "ref": "10.2.f",
                        "title": "Nonconformity and corrective action, part f)",
                        "summary": "Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of: the nature of the nonconformities and any subsequent actions taken.",
                        "mappedControls": [
                            "cp-vuln-scan",
                            "cp-sdlc-pentest",
                            "cp-vuln-remediation",
                            "cp-sdlc-scm"
                        ]
                    },
                    {
                        "ref": "10.2.g",
                        "title": "Nonconformity and corrective action, part g)",
                        "summary": "Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of: the results of any corrective action.",
                        "mappedControls": [
                            "cp-sdlc-monitor",
                            "cp-model-metrics",
                            "cp-vuln-remediation"
                        ]
                    }
                ]
            },
            {
                "title": "A.5 -  Information security policies",
                "controls": [
                    {
                        "ref": "A.5.1",
                        "title": "Policies for information security",
                        "summary": "Information security policy and topic-specific policies shall be defined, approved by management, published, communicated to and acknowledged by relevant personnel and relevant interested parties, and reviewed at planned intervals and if significant changes occur.",
                        "mappedControls": [
                            "cp-ism-policies",
                            "cp-policy-framework",
                            "cp-employee-onboarding"
                        ]
                    },
                    {
                        "ref": "A.5.2",
                        "title": "Information security roles and responsibilities",
                        "summary": "Information security roles and responsibilities shall be defined and allocated according to the organization needs.",
                        "mappedControls": [
                            "cp-role-assignment"
                        ]
                    },
                    {
                        "ref": "A.5.3",
                        "title": "Segregation of duties",
                        "summary": "Conflicting duties and conflicting areas of responsibility shall be segregated.",
                        "mappedControls": [
                            "cp-role-assignment"
                        ]
                    },
                    {
                        "ref": "A.5.4",
                        "title": "Management responsibilities",
                        "summary": "Management shall require all personnel to apply information security in accordance with the established information security policy, topic-specific policies and procedures of the organization.",
                        "mappedControls": [
                            "cp-role-assignment",
                            "cp-training-policy",
                            "ref-employee-handbook",
                            "cp-employee-performance"
                        ]
                    },
                    {
                        "ref": "A.5.5",
                        "title": " Contact with authorities",
                        "summary": "The organization shall establish and maintain contact with relevant authorities.",
                        "mappedControls": [
                            "cp-breach-authorities"
                        ]
                    },
                    {
                        "ref": "A.5.6",
                        "title": " Contact with special interest groups",
                        "summary": "The organization shall establish and maintain contact with special interest groups or other specialist security forums and professional associations.",
                        "mappedControls": [
                            "cp-threat-intel",
                            "cp-breach-authorities"
                        ]
                    },
                    {
                        "ref": "A.5.7",
                        "title": "Threat intelligence",
                        "summary": "Information relating to information security threats shall be collected and analysed to produce threat intelligence.",
                        "mappedControls": [
                            "cp-threat-intel"
                        ]
                    },
                    {
                        "ref": "A.5.8",
                        "title": "Information security in project management",
                        "summary": "Information security shall be integrated into project management.",
                        "mappedControls": [
                            "cp-sdlc-dev",
                            "cp-model-quality"
                        ]
                    },
                    {
                        "ref": "A.5.9",
                        "title": "Information security in project management",
                        "summary": "An inventory of information and other associated assets, including owners, shall be developed and maintained.",
                        "mappedControls": [
                            "cp-asset-digital",
                            "cp-asset-physical"
                        ]
                    },
                    {
                        "ref": "A.5.10",
                        "title": "Acceptable use of information and other associated assets",
                        "summary": "Rules for the acceptable use and procedures for handling information and other associated assets shall be identified, documented and implemented.",
                        "mappedControls": [
                            "cp-employee-acceptable-use"
                        ]
                    },
                    {
                        "ref": "A.5.11",
                        "title": "Acceptable use of information and other associated assets",
                        "summary": "Rules for the acceptable use and procedures for handling information and other associated assets shall be identified, documented and implemented.",
                        "mappedControls": [
                            "cp-employee-acceptable-use",
                            "cp-access-standards"
                        ]
                    },
                    {
                        "ref": "A.5.12",
                        "title": "Classification of information",
                        "summary": "Information shall be classified according to the information security needs of the organization based on confidentiality, integrity, availability and relevant interested party requirements.",
                        "mappedControls": [
                            "cp-data-classification",
                            "cp-data-handling"
                        ]
                    },
                    {
                        "ref": "A.5.13",
                        "title": "Labelling of information",
                        "summary": "An appropriate set of procedures for information labelling shall be developed and implemented in accordance with the information classification scheme adopted by the organization.",
                        "mappedControls": [
                            "cp-data-classification",
                            "cp-data-handling"
                        ]
                    },
                    {
                        "ref": "A.5.14",
                        "title": "Information transfer",
                        "summary": "Information transfer rules, procedures, or agreements shall be in place for all types of transfer facilities within the organization and between the organization and other parties.",
                        "mappedControls": [
                            "cp-data-handling",
                            "cp-data-protection-in-transit"
                        ]
                    },
                    {
                        "ref": "A.5.15",
                        "title": "Access control",
                        "summary": "Rules to control physical and logical access to information and other associated assets shall be established and implemented based on business and information security requirements.",
                        "mappedControls": [
                            "cp-access-standards",
                            "cp-access-sso",
                            "cp-access-mfa",
                            "cp-access-rbac",
                            "cp-access-privileged"
                        ]
                    },
                    {
                        "ref": "A.5.16",
                        "title": "Identity management",
                        "summary": "The full life cycle of identities shall be managed.",
                        "mappedControls": [
                            "cp-access-review",
                            "cp-access-standards",
                            "cp-access-reset"
                        ]
                    },
                    {
                        "ref": "A.5.17",
                        "title": "Authentication information",
                        "summary": "Allocation and management of authentication information shall be controlled by a management process, including advising personnel on appropriate handling of authentication information.",
                        "mappedControls": [
                            "cp-access-standards",
                            "cp-access-mfa",
                            "cp-access-rbac",
                            "cp-access-privileged",
                            "cp-access-review"
                        ]
                    },
                    {
                        "ref": "A.5.18",
                        "title": "Access rights",
                        "summary": "Access rights to information and other associated assets shall be provisioned, reviewed, modified and removed in accordance with the organization’s topic-specific policy on and rules for access control.",
                        "mappedControls": [
                            "cp-access-standards",
                            "cp-access-rbac",
                            "cp-access-privileged",
                            "cp-access-review"
                        ]
                    },
                    {
                        "ref": "A.5.19",
                        "title": "Information security in supplier relationships",
                        "summary": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the use of supplier’s products or services.",
                        "mappedControls": [
                            "cp-vendor-vtr",
                            "cp-vendor-contracts",
                            "cp-vendor-monitor"
                        ]
                    },
                    {
                        "ref": "A.5.20",
                        "title": "Addressing information security within supplier agreements",
                        "summary": "Relevant information security requirements shall be established and agreed with each supplier based on the type of supplier relationship.",
                        "mappedControls": [
                            "cp-vendor-contracts"
                        ]
                    },
                    {
                        "ref": "A.5.21",
                        "title": "Managing information security in the information and communication technology (ICT) supply chain",
                        "summary": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the ICT products and services supply chain.",
                        "mappedControls": [
                            "cp-vendor-vtr",
                            "cp-vendor-contracts",
                            "cp-vendor-monitor"
                        ]
                    },
                    {
                        "ref": "A.5.22",
                        "title": "Monitoring, review and change management of supplier services",
                        "summary": "The organization shall regularly monitor, review, evaluate and manage change in supplier information security practices and service delivery.",
                        "mappedControls": [
                            "cp-vendor-monitor"
                        ]
                    },
                    {
                        "ref": "A.5.23",
                        "title": "Information security for use of cloud services",
                        "summary": "Processes for acquisition, use, management and exit from cloud services shall be established in accordance with the organization’s information security requirements.",
                        "mappedControls": [
                            "cp-ccm-aws",
                            "cp-vendor-contracts",
                            "cp-vendor-monitor"
                        ]
                    },
                    {
                        "ref": "A.5.24",
                        "title": "Information security incident management planning and preparation",
                        "summary": "The organization shall plan and prepare for managing information security incidents by defining, establishing and communicating information security incident management processes, roles and responsibilities.",
                        "mappedControls": [
                            "cp-ir-process",
                            "cp-ir-sirt",
                            "cp-audit-training"
                        ]
                    },
                    {
                        "ref": "A.5.25",
                        "title": "Assessment and decision on information security events",
                        "summary": "The organization shall assess information security events and decide if they are to be categorized as information security incidents.",
                        "mappedControls": [
                            "cp-ir-process",
                            "cp-ir-records"
                        ]
                    },
                    {
                        "ref": "A.5.26",
                        "title": "Response to information security incidents",
                        "summary": "Information security incidents shall be responded to in accordance with the documented procedures.",
                        "mappedControls": [
                            "cp-ir-process",
                            "cp-ir-playbook"
                        ]
                    },
                    {
                        "ref": "A.5.27",
                        "title": "Learning from information security incidents",
                        "summary": "Knowledge gained from information security incidents shall be used to strengthen and improve the information security controls.",
                        "mappedControls": [
                            "cp-ir-records",
                            "cp-ir-process"
                        ]
                    },
                    {
                        "ref": "A.5.28",
                        "title": "Collection of evidence",
                        "summary": "The organization shall establish and implement procedures for the identification, collection, acquisition and preservation of evidence related to information security events.",
                        "mappedControls": [
                            "cp-ir-records",
                            "cp-ir-process"
                        ]
                    },
                    {
                        "ref": "A.5.29",
                        "title": "Information security during disruption",
                        "summary": "The organization shall plan how to maintain information security at an appropriate level during disruption.",
                        "mappedControls": [
                            "cp-bcdr-test",
                            "cp-bcdr"
                        ]
                    },
                    {
                        "ref": "A.5.30",
                        "title": "ICT readiness for business continuity",
                        "summary": "ICT readiness shall be planned, implemented, maintained and tested based on business continuity objectives and ICT continuity requirements.",
                        "mappedControls": [
                            "cp-bcdr-test",
                            "cp-bcdr"
                        ]
                    },
                    {
                        "ref": "A.5.31",
                        "title": "Legal, statutory, regulatory and contractual requirements",
                        "summary": "Legal, statutory, regulatory and contractual requirements relevant to information security and the organization’s approach to meet these requirements shall be identified, documented and kept up to date.",
                        "mappedControls": [
                            "cp-ism-scope"
                        ]
                    },
                    {
                        "ref": "A.5.32",
                        "title": "Intellectual property rights",
                        "summary": "The organization shall implement appropriate procedures to protect intellectual property rights.",
                        "mappedControls": []
                    },
                    {
                        "ref": "A.5.33",
                        "title": "Protection of records",
                        "summary": "Records shall be protected from loss, destruction, falsification, unauthorized access and unauthorized release.",
                        "mappedControls": [
                            "cp-data-protection",
                            "cp-data-handling",
                            "cp-data-protection-integrity",
                            "cp-audit-trails-integrity"
                        ]
                    },
                    {
                        "ref": "A.5.34",
                        "title": "Privacy and protection of personal identifiable information (PII)",
                        "summary": "The organization shall identify and meet the requirements regarding the preservation of privacy and protection of PII according to applicable laws and regulations and contractual requirements.",
                        "mappedControls": [
                            "ref-privacy-policy",
                            "cp-privacy-notices",
                            "cp-access-prod-data",
                            "cp-data-classification"
                        ]
                    },
                    {
                        "ref": "A.5.35",
                        "title": "Independent review of information security",
                        "summary": "The organization’s approach to managing information security and its implementation including people, processes and technologies shall be reviewed independently at planned intervals, or when significant changes occur",
                        "mappedControls": [
                            "cp-policy-mgmt",
                            "cp-audit-internal"
                        ]
                    },
                    {
                        "ref": "A.5.36",
                        "title": "Compliance with policies, rules and standards for information security",
                        "summary": "Compliance with the organization’s information security policy, topic-specific policies, rules and standards shall be regularly reviewed.",
                        "mappedControls": [
                            "cp-policy-mgmt",
                            "cp-audit-internal",
                            "cp-ccm-monitor",
                            "cp-compliance-monitor"
                        ]
                    },
                    {
                        "ref": "A.5.37",
                        "title": "Documented operating procedures",
                        "summary": "Operating procedures for information processing facilities shall be documented and made available to personnel who need them.",
                        "mappedControls": [
                            "cp-ism-scope",
                            "cp-training-policy"
                        ]
                    }
                ]
            },
            {
                "title": "A.6 - People controls",
                "controls": [
                    {
                        "ref": "A.6.1",
                        "title": "Screening",
                        "summary": "Background verification checks on all candidates to become personnelshall be carried out prior to joining the organization and on an ongoing basis taking into consideration applicable laws, regulations and ethics and be proportional to the business requirements, the classification of the information to be accessed and the perceived risks.",
                        "mappedControls": [
                            "cp-employee-screening"
                        ]
                    },
                    {
                        "ref": "A.6.2",
                        "title": "Terms and conditions of employment",
                        "summary": "The employment contractual agreements shall state the personnel’s and the organization’s responsibilities for information security.",
                        "mappedControls": [
                            "ref-employee-handbook",
                            "cp-employee-onboarding",
                            "ref-employee-handbook"
                        ]
                    },
                    {
                        "ref": "A.6.3",
                        "title": "Information security awareness, education and training",
                        "summary": "Personnel of the organization and relevant interested parties shall receive appropriate information security awareness, education and training and regular updates of the organization's information security policy, topic-specific policies and procedures, as relevant for their job function.",
                        "mappedControls": [
                            "cp-training-awareness",
                            "cp-training-policy",
                            "cp-audit-training"
                        ]
                    },
                    {
                        "ref": "A.6.4",
                        "title": "Disciplinary process",
                        "summary": "A disciplinary process shall be formalized and communicated to take actions against personnel and other relevant interested parties who have committed an information security policy violation.",
                        "mappedControls": [
                            "cp-employee-sanctions",
                            "cp-sanctions"
                        ]
                    },
                    {
                        "ref": "A.6.5",
                        "title": "Responsibilities after termination or change of employment",
                        "summary": "Information security responsibilities and duties that remain valid after termination or change of employment shall be defined, enforced and communicated to relevant personnel and other interested parties.",
                        "mappedControls": [
                            "cp-employee-exiting",
                            "cp-access-change",
                            "ref-employee-handbook",
                            "cp-hr-mgmt"
                        ]
                    },
                    {
                        "ref": "A.6.6",
                        "title": "Confidentiality or non-disclosure agreements",
                        "summary": "Confidentiality or non-disclosure agreements reflecting the organization’s needs for the protection of information shall be identified,documented, regularly reviewed and signed by personnel and other relevant interested parties.",
                        "mappedControls": [
                            "cp-privacy-notices",
                            "ref-privacy-policy",
                            "cp-employee-acceptable-use"
                        ]
                    },
                    {
                        "ref": "A.6.7",
                        "title": "Remote working",
                        "summary": "Security measures shall be implemented when personnel are working remotely to protect information accessed, processed or stored outside the organization’s premises.",
                        "mappedControls": [
                            "cp-role-assignment",
                            "cp-access-vpn",
                            "cp-access-endpoints"
                        ]
                    },
                    {
                        "ref": "A.6.8",
                        "title": "Information security event reporting",
                        "summary": "The organization shall provide a mechanism for personnel to report observed or suspected information security events through appropriate channels in a timely manner.",
                        "mappedControls": [
                            "cp-employee-escalation",
                            "cp-employee-whistleblower"
                        ]
                    }
                ]
            },
            {
                "title": "A.7 - Physical controls",
                "controls": [
                    {
                        "ref": "A.7.1",
                        "title": "Physical security perimeters",
                        "summary": "Security perimeters shall be defined and used to protect areas that contain information and other associated assets.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-access-standards"
                        ]
                    },
                    {
                        "ref": "A.7.2",
                        "title": "Physical entry",
                        "summary": "Secure areas shall be protected by appropriate entry controls and access points.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-access-standards"
                        ]
                    },
                    {
                        "ref": "A.7.3",
                        "title": "Securing offices, rooms and facilities",
                        "summary": "Physical security for offices, rooms and facilities shall be designed and implemented.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-access-standards"
                        ]
                    },
                    {
                        "ref": "A.7.4",
                        "title": "Physical security monitoring",
                        "summary": "Premises shall be continuously monitored for unauthorized physical access.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-bcdr-test"
                        ]
                    },
                    {
                        "ref": "A.7.5",
                        "title": "Protecting against physical and environmental threats",
                        "summary": "Protection against physical and environmental threats, such as natural disasters and other intentional or unintentional physical threats to infrastructure shall be designed and implemented.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-bcdr-recovery"
                        ]
                    },
                    {
                        "ref": "A.7.6",
                        "title": "Working in secure areas",
                        "summary": "Security measures for working in secure areas shall be designed and implemented.",
                        "mappedControls": [
                            "cp-access-endpoints",
                            "cp-access-wifi",
                            "cp-physical"
                        ]
                    },
                    {
                        "ref": "A.7.7",
                        "title": "Clear desk and clear screen",
                        "summary": "Clear desk rules for papers and removable storage media and clear screen rules for information processing facilities shall be defined and appropriately enforced.",
                        "mappedControls": [
                            "cp-physical-clean-desk"
                        ]
                    },
                    {
                        "ref": "A.7.8",
                        "title": "Equipment siting and protection",
                        "summary": "Equipment shall be sited securely and protected.",
                        "mappedControls": [
                            "cp-access-endpoints",
                            "cp-asset-physical"
                        ]
                    },
                    {
                        "ref": "A.7.9",
                        "title": "Security of assets off-premises",
                        "summary": "Off-site assets shall be protected.",
                        "mappedControls": [
                            "cp-access-endpoints"
                        ]
                    },
                    {
                        "ref": "A.7.10",
                        "title": "Storage media",
                        "summary": "Storage media shall be managed through their life cycle of acquisition, use, transportation and disposal in accordance with the organization’s classification scheme and handling requirements.",
                        "mappedControls": [
                            "cp-mdm-usb",
                            "cp-mdm-disposal"
                        ]
                    },
                    {
                        "ref": "A.7.11",
                        "title": "Supporting utilities",
                        "summary": "Information processing facilities shall be protected from power failures and other disruptions caused by failures in supporting utilities.",
                        "mappedControls": [
                            "cp-physical",
                            "cp-bcdr-test"
                        ]
                    },
                    {
                        "ref": "A.7.12",
                        "title": "Cabling security",
                        "summary": "Cables carrying power, data or supporting information services shall be protected from interception, interference or damage.",
                        "mappedControls": [
                            "cp-physical"
                        ]
                    },
                    {
                        "ref": "A.7.13",
                        "title": "Equipment maintenance",
                        "summary": "Equipment shall be maintained correctly to ensure availability, integrity and confidentiality of information.",
                        "mappedControls": [
                            "cp-bcdr-test",
                            "cp-access-endpoints"
                        ]
                    },
                    {
                        "ref": "A.7.14",
                        "title": "Secure disposal or re-use of equipment",
                        "summary": "Items of equipment containing storage media shall be verified to ensure that any sensitive data and licensed software has been removed or securely overwritten prior to disposal or re-use.",
                        "mappedControls": [
                            "cp-mdm-disposal",
                            "cp-data-deletion",
                            "cp-data-lifecycle"
                        ]
                    }
                ]
            },
            {
                "title": "A.8 - Technological controls",
                "controls": [
                    {
                        "ref": "A.8.1",
                        "title": "User end point devices",
                        "summary": "Information stored on, processed by or accessible via user end point devices shall be protected.",
                        "mappedControls": [
                            "cp-ccm-provision-endpoint",
                            "cp-employee-acceptable-use",
                            "cp-access-endpoints"
                        ]
                    },
                    {
                        "ref": "A.8.2",
                        "title": "Privileged access rights",
                        "summary": "The allocation and use of privileged access rights shall be restricted and managed.",
                        "mappedControls": [
                            "cp-access-privileged"
                        ]
                    },
                    {
                        "ref": "A.8.3",
                        "title": "Information access restriction",
                        "summary": "Access to information and other associated assets shall be restricted in accordance with the established topic-specific policy on access control.",
                        "mappedControls": [
                            "cp-access-standards",
                            "cp-access-change",
                            "cp-sdlc-iaaa",
                            "cp-access-review",
                            "cp-access-phi"
                        ]
                    },
                    {
                        "ref": "A.8.4",
                        "title": "Access to source code",
                        "summary": "Read and write access to source code, development tools and software libraries shall be appropriately managed.",
                        "mappedControls": [
                            "cp-sdlc-scm",
                            "cp-access-prod-data",
                            "cp-access-prod"
                        ]
                    },
                    {
                        "ref": "A.8.5",
                        "title": "Secure authentication",
                        "summary": "Secure authentication technologies and procedures shall be implemented based on information access restrictions and the topic-specific policy on access control.",
                        "mappedControls": [
                            "cp-access-mfa",
                            "cp-sdlc-iaaa"
                        ]
                    },
                    {
                        "ref": "A.8.6",
                        "title": "Capacity management",
                        "summary": "The use of resources shall be monitored and adjusted in line with current and expected capacity requirements.",
                        "mappedControls": [
                            "cp-bcdr-test",
                            "cp-bcdr-data",
                            "cp-bcdr-app"
                        ]
                    },
                    {
                        "ref": "A.8.7",
                        "title": "Protection against malware",
                        "summary": "Protection against malware shall be implemented and supported by appropriate user awareness.",
                        "mappedControls": [
                            "cp-threat-malware",
                            "cp-ccm-provision-endpoint"
                        ]
                    },
                    {
                        "ref": "A.8.8",
                        "title": "Management of technical vulnerabilities",
                        "summary": "Information about technical vulnerabilities of information systems in use shall be obtained, the organization’s exposure to such vulnerabilities shall be evaluated and appropriate measures shall be taken.",
                        "mappedControls": [
                            "cp-vuln-scan",
                            "cp-threat-intel"
                        ]
                    },
                    {
                        "ref": "A.8.9",
                        "title": "Configuration management",
                        "summary": "Configurations, including security configurations, of hardware, software, services and networks shall be established, documented, implemented, monitored and reviewed.",
                        "mappedControls": [
                            "cp-ccm-config",
                            "cp-ccm-network",
                            "cp-ccm-monitor",
                            "cp-ccm-provision-endpoint"
                        ]
                    },
                    {
                        "ref": "A.8.10",
                        "title": "Information deletion",
                        "summary": "Information stored in information systems, devices or in any other storage media shall be deleted when no longer required.",
                        "mappedControls": [
                            "cp-data-deletion",
                            "cp-data-lifecycle"
                        ]
                    },
                    {
                        "ref": "A.8.11",
                        "title": "Data masking",
                        "summary": "Data masking shall be used in accordance with the organization’s topic-specific policy on access control and other related topic-specific policies, and business requirements, taking applicable legislation into consideration.",
                        "mappedControls": [
                            "cp-data-protection"
                        ]
                    },
                    {
                        "ref": "A.8.12",
                        "title": "Data leakage prevention",
                        "summary": "Data leakage prevention measures shall be applied to systems, networks and any other devices that process, store or transmit sensitive information.",
                        "mappedControls": [
                            "cp-data-protection",
                            "cp-data-protection-integrity"
                        ]
                    },
                    {
                        "ref": "A.8.13",
                        "title": "Information backup",
                        "summary": "Backup copies of information, software and systems shall be maintained and regularly tested in accordance with the agreed topic-specific policy on backup.",
                        "mappedControls": [
                            "cp-data-backup"
                        ]
                    },
                    {
                        "ref": "A.8.14",
                        "title": "Redundancy of information processing facilities",
                        "summary": "Information processing facilities shall be implemented with redundancy sufficient to meet availability requirements.",
                        "mappedControls": [
                            "cp-bcdr-test",
                            "cp-bcdr-data",
                            "cp-bcdr-site"
                        ]
                    },
                    {
                        "ref": "A.8.15",
                        "title": "Logging",
                        "summary": "Logs that record activities, exceptions, faults and other relevant events shall be produced, stored, protected and analysed.",
                        "mappedControls": [
                            "cp-audit-trails",
                            "cp-audit-trails-integrity"
                        ]
                    },
                    {
                        "ref": "A.8.16",
                        "title": "Monitoring activities",
                        "summary": "Networks, systems and applications shall be monitored for anomalous behaviour and appropriate actions taken to evaluate potential information security incidents.",
                        "mappedControls": [
                            "cp-ccm-monitor",
                            "cp-sdlc-monitor"
                        ]
                    },
                    {
                        "ref": "A.8.17",
                        "title": "Clock synchronization",
                        "summary": "The clocks of information processing systems used by the organization shall be synchronized to approved time sources.",
                        "mappedControls": [
                            "cp-audit-trails",
                            "cp-audit-trails-integrity"
                        ]
                    },
                    {
                        "ref": "A.8.18",
                        "title": "Use of privileged utility programs",
                        "summary": "The use of utility programs that can be capable of overriding system and application controls shall be restricted and tightly controlled.",
                        "mappedControls": [
                            "cp-access-privileged"
                        ]
                    },
                    {
                        "ref": "A.8.19",
                        "title": "Installation of software on operational systems",
                        "summary": "Procedures and measures shall be implemented to securely manage software installation on operational systems.",
                        "mappedControls": [
                            "ref-approved-software",
                            "cp-employee-acceptable-use",
                            "ref-approved-software",
                            "cp-ccm-provision-endpoint"
                        ]
                    },
                    {
                        "ref": "A.8.20",
                        "title": "Networks security",
                        "summary": "Networks and network devices shall be secured, managed and controlled to protect information in systems and applications.",
                        "mappedControls": [
                            "cp-ccm-network",
                            "cp-threat-nids"
                        ]
                    },
                    {
                        "ref": "A.8.21",
                        "title": "Security of network services",
                        "summary": "Security mechanisms, service levels and service requirements of network services shall be identified, implemented and monitored.",
                        "mappedControls": [
                            "cp-ccm-network",
                            "cp-threat-nids",
                            "cp-access-wifi"
                        ]
                    },
                    {
                        "ref": "A.8.22",
                        "title": "Segregation of networks",
                        "summary": "Groups of information services, users and information systems shall be segregated in the organization’s networks.",
                        "mappedControls": [
                            "cp-ccm-network"
                        ]
                    },
                    {
                        "ref": "A.8.23",
                        "title": "Web filtering",
                        "summary": "Access to external websites shall be managed to reduce exposure to malicious content.",
                        "mappedControls": [
                            "cp-threat-webapp",
                            "cp-employee-acceptable-use",
                            "cp-access-wifi"
                        ]
                    },
                    {
                        "ref": "A.8.24",
                        "title": "Use of cryptography",
                        "summary": "Rules for the effective use of cryptography, including cryptographic key management, shall be defined and implemented.",
                        "mappedControls": [
                            "cp-data-protection-kms",
                            "cp-data-protection",
                            "cp-data-protection-at-rest",
                            "cp-data-protection-in-transit",
                            "cp-data-protection-in-use"
                        ]
                    },
                    {
                        "ref": "A.8.25",
                        "title": "Secure development life cycle",
                        "summary": "Rules for the secure development of software and systems shall be established and applied.",
                        "mappedControls": [
                            "cp-sdlc-dev",
                            "cp-sdlc-scm",
                            "cp-sdlc-appsec-req",
                            "cp-sdlc-design",
                            "cp-sdlc-foss"
                        ]
                    },
                    {
                        "ref": "A.8.26",
                        "title": "Application security requirements",
                        "summary": "Information security requirements shall be identified, specified and approved when developing or acquiring applications",
                        "mappedControls": [
                            "cp-sdlc-appsec-req"
                        ]
                    },
                    {
                        "ref": "A.8.27",
                        "title": "Secure system architecture and engineering principles",
                        "summary": "Principles for engineering secure systems shall be established, documented, maintained and applied to any information system development activities.",
                        "mappedControls": [
                            "cp-model-architecture",
                            "cp-model-quality",
                            "cp-ccm-provision-prod",
                            "cp-sdlc-design"
                        ]
                    },
                    {
                        "ref": "A.8.28",
                        "title": "Secure coding",
                        "summary": "Secure coding principles shall be applied to software development.",
                        "mappedControls": [
                            "cp-sdlc-scm",
                            "cp-ccm-prodcm"
                        ]
                    },
                    {
                        "ref": "A.8.29",
                        "title": "Security testing in development and acceptance",
                        "summary": "Security testing processes shall be defined and implemented in the development life cycle.",
                        "mappedControls": [
                            "cp-sdlc-dast",
                            "cp-sdlc-sast",
                            "cp-vuln-scan",
                            "cp-sdlc-scm"
                        ]
                    },
                    {
                        "ref": "A.8.30",
                        "title": "Outsourced development",
                        "summary": "The organization shall direct, monitor and review the activities related to outsourced system development.",
                        "mappedControls": [
                            "cp-sdlc-outsourcing"
                        ]
                    },
                    {
                        "ref": "A.8.31",
                        "title": "Separation of development, test and production environments",
                        "summary": "Development, testing and production environments shall be separated and secured.",
                        "mappedControls": [
                            "cp-sdlc-dev",
                            "cp-ccm-prodcm"
                        ]
                    },
                    {
                        "ref": "A.8.32",
                        "title": "Change management",
                        "summary": "Changes to information processing facilities and information systems shall be subject to change management procedures.",
                        "mappedControls": [
                            "cp-ccm-emergency",
                            "cp-ccm-provision-mgmt",
                            "cp-ccm-aws-deploy"
                        ]
                    },
                    {
                        "ref": "A.8.33",
                        "title": "Test information",
                        "summary": "Test information shall be appropriately selected, protected and managed.",
                        "mappedControls": [
                            "cp-audit-trails-integrity",
                            "cp-audit-trails"
                        ]
                    },
                    {
                        "ref": "A.8.34",
                        "title": "Protection of information systems during audit testing",
                        "summary": "Audit tests and other assurance activities involving assessment of operational systems shall be planned and agreed between the tester and appropriate management.",
                        "mappedControls": [
                            "cp-audit-trails-integrity",
                            "cp-audit-trails"
                        ]
                    }
                ]
            }
        ]
    }
