{
    "standard": "ISO/IEC 27001:2013",
    "version": "2013",
    "domains": [
      {
       "title": "4 - Context of the organization",
        "controls":[
          {
                "ref": "4.1",
                "title": "Understanding the organization and its context",
                "summary": "The organization shall determine external and internal issues that are relevant to its purpose and that shall affect its ability to achieve the intended outcome(s) of its information security management system.",
                "mappedControls" : [ 
                "cp-compliance-mgmt",
                "cp-ism-scope"
              ]
          },
          {  
               "ref": "4.2.a",
               "title": "Understanding the needs and expectations of interested parties, part a)",
               "summary": "The organization shall determine: interested parties that are relevant to the information security management system.",
               "mappedControls" : [ 
               "cp-compliance-mgmt"
              ]
          },
          {
               "ref": "4.2.b",
               "title": "Understanding the needs and expectations of interested parties, part b)",
               "summary": "The organization shall determine: b) the requirements of these interested parties relevant to information security. Note: the requirements of interested parties may include legal and regulatory requirements and contractual obligations.",
               "mappedControls" : [ 
               "cp-compliance-mgmt"
              ]
          },
          {
               "ref": "4.3.a",
               "title": "Determining the scope of the information security management system, part a)",
               "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: the external and internal issues referred to in 4.1 The scope shall be available as documented information.",
               "mappedControls" : [ 
               "cp-ism-scope",
               "cp-model-architecture",
               "cp-vendor-contracts",
               "cp-audit-customers",
               "cp-compliance-mgmt"
              ]
          },
          { 
               "ref": "4.3.b",
               "title": "Determining the scope of the information security management system, part b)",
               "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: the requirements [of the interested parties] referred to in 4.2. The scope shall be available as documented information.",
               "mappedControls" : [ 
               "cp-ism-scope",
               "cp-audit-customers",
               "cp-compliance-mgmt"
               ]
          },
          {
               "ref": "4.3.c",
               "title": "Determining the scope of the information security management system, part c)",
               "summary": "The organization shall determine the boundaries and applicability of the information system management system to establish its scope. When determining this scope, the organization shall consider: interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. The scope shall be available as documented information.", 
               "mappedControls" : [ 
               "cp-ism-scope",
               "cp-vendor-contracts",
               "cp-vendor-vtr",
               "cp-vendor-ssa"
              ]
           },
           {  
               "ref": "4.4",
               "title": "Information security management system", 
               "summary": "The organization shall establish, implement, maintain, and continually improve an information security management system, in accordance with the requirements of this International Standard.", 
               "mappedControls" : [ 
               "cp-ism-scope",
               "cp-ism-policies",
               "cp-ism-reporting"
               ]
            }
          ]
        },            
        {
           "title": "5 - Leadership",
              "controls": [
          {
             "ref": "5.1.a",
             "title": "Leadership and commitment, part a)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring the information security policy and the information security objectives are established and compatible with the strategic direction of the organization.",
             "mappedControls" : [ 
              "cp-ism-policies",
              "cp-policy-mgmt"
              ]
          },
          {  
             "ref": "5.1.b",
             "title": "Leadership and commitment, part b)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring the integration of the information security management system requirements into their organization's processes.",
             "mappedControls" : [ 
              "cp-ism-policies",
              "cp-policy-mgmt",
              "cp-ism-scope",
              "cp-sanctions",
              "cp-role-assignment"
              ]
          },
          {  
             "ref": "5.1.c",
             "title": "Leadership and commitment, part c)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring that the resources needed for the information security management system are available.",
             "mappedControls" : [ 
              "cp-role-assignment",
               "cp-audit-review"
              ]
          },
          {  
             "ref": "5.1.d",
             "title": "Leadership and commitment, part d)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: communicating the importance of effective information security management and of conforming to the information security management system requirements.",
             "mappedControls" : [
              "cp-training-policy",
              "cp-training-awareness",
              "cp-sanctions",
              "ref-employee-handbook",
              "cp-employee-recognition",
              "cp-employee-onboarding",
              "cp-employee-acceptable-use"
              ]
          },
          {
             "ref": "5.1.e",
             "title": "Leadership and commitment, part e)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: ensuring that the information security management system achieves its intended outcome(s).",
             "mappedControls" : [
              "cp-compliance-requests",
              "cp-audit-types",
              "cp-audit-internal",
              "cp-audit-review",
              "cp-compliance-mgmt"
              ]
          },
          {
             "ref": "5.1.f",
             "title": "Leadership and commitment, part f)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: directing and supporting persons to contribute to the effectiveness of the information security management system.",
              "mappedControls" : [
              "cp-role-assignment",
              "cp-employee-recognition",
              "cp-employee-whistleblower",
              "cp-employee-escalation",
              "cp-employee-development"
              ]
          },
          {
             "ref": "5.1.g",
             "title": "Leadership and commitment, part g)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: promoting continual improvement.",
              "mappedControls" : [
              "cp-model-metrics",
              "cp-model-quality", 
              "cp-employee-development",
              "cp-policy-mgmt"
              ]
          },
          {
             "ref": "5.1.h",
             "title": "Leadership and commitment, part h)",
             "summary": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: supporting other relevant management roles to demonstrate their leadership as it applies to their area of responsibility.",
              "mappedControls" : [
              "cp-role-assignment",
              "cp-employee-recognition"
              ]
          },
          {
             "ref": "5.2.a",
             "title": "Policy, part a)",
             "summary": "Top management shall establish an information security policy that: is appropriate to the purpose of the organization.",
              "mappedControls" : [
              "cp-ism-policies"
              ]
          },
          {  
             "ref": "5.2.b",
             "title": "Policy, part b)",
             "summary": "Top management shall establish an information security policy that: includes information security objectives (see 6.2) or provides the framework for setting information security objectives.",
              "mappedControls" : [
              "cp-policy-framework"
              ]
          },
          { 
           "ref": "5.2.c",
           "title": "Policy, part c)",
           "summary": "Top management shall establish an information security policy that: includes a commitment to satisfy applicable requirements related to information security.",
           "mappedControls" : [
           "cp-compliance-mgmt",
           "cp-compliance-monitor"
          ]
          },
          { 
           "ref": "5.2.d",
           "title": "Policy, part d)",
           "summary": "Top management shall establish an information security policy that: includes a commitment to continual improvement of the information security management system.", 
           "mappedControls" : [
           "cp-model-metrics",
           "cp-model-quality"
              ]
          },
          {
             "ref": "5.2.e",
             "title": "Policy, part e)",
             "summary": "The information security policy shall: be available as documented information.",
             "mappedControls" : [
             "cp-ism-policies"
              ]
          },
          {
             "ref": "5.2.f",
             "title": "Policy, part f)",
             "summary": "The information security policy shall: be communicated within the organization.", 
              "mappedControls" : [
              "cp-ism-policies",
              "cp-employee-onboarding",
              "cp-employee-acceptable-use",
              "cp-training-awareness"
              ]
          },
          {
             "ref": "5.2.g",
             "title": "Policy, part g)",
             "summary": "The information security policy shall: be available to interested parties, as appropriate.", 
              "mappedControls" : [
              "ref-privacy-policy",
              "ref-employee-handbook",
              "cp-ism-policies",
              "cp-audit-customers"
              ]
          },
          {
             "ref": "5.3.a",
             "title": "Organizatonal roles, responsibilities, and authorities, part a)",
             "summary": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated. Top management shall assign the responsibility and authority for: ensuring that the information security management system conforms to the requirements of this International Standard.", 
             "mappedControls" : [
              "cp-role-assignment"
              ]
          },
          {
             "ref": "5.3.b",
             "title": "Organizatonal roles, responsibilities, and authorities, part b)",
             "summary": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated. Top management shall assign the responsibility and authority for: reporting on the performance of the information security management system to top management.", 
              "mappedControls" : [
              "cp-role-assignment",
              "cp-model-metrics",
              "cp-model-quality",
              "cp-compliance-monitor"
              ]
            }
          ]
        },
        {
           "title": "6 - Planning",
              "controls": [
          {
             "ref": "6.1.1.a",
             "title": "General planning, part a)",
             "summary": "When planning for the information security management system, the organization shall consider the [internal and external] issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: ensure the information security management system can achieve its intended outcome(s).", 
              "mappedControls" : [
              "cp-bcdr",
              "cp-model-metrics",
              "cp-model-architecture"
              ]
          },
          {
             "ref": "6.1.1.b",
             "title": "General planning, part b)",
             "summary": "When planning for the information security management system, the organization shall consider the [internal and external] issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: prevent, or reduce, undesired effects.", 
             "mappedControls" : [
              "cp-model-architecture",
              "cp-risk-assess",
              "cp-risk-fraud",
              "cp-risk-mgmt-objectives"
              ]
          },
          {
             "ref": "6.1.1.c",
             "title": "General planning, part c)",
             "summary": "When planning for the information security management system, the organization shall consider the [internal and external] issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: achieve continual improvement.", 
             "mappedControls" : [
              "cp-model-metrics",
              "cp-model-quality",
              "cp-risk-mgmt-objectives"
              ]
          },
          {
             "ref": "6.1.1.d",
             "title": "General planning, part d)",
             "summary": "The organization shall plan: actions to address these risks and opportunities.", 
             "mappedControls" : [
              "cp-risk-mgmt",
              "cp-risk-mitigation",
              "cp-risk-insurance"
              ]
          },
          {
             "ref": "6.1.1.e",
             "title": "General planning, part e)",
             "summary": "The organization shall plan: how to 1) integrate and implement the actions into its information security management system; and 2) evaluate the effectiveness of these actions.", 
             "mappedControls" : [
             "cp-compliance-monitor",
             "cp-sdlc-monitor",
              "cp-ccm-monitor",
              "cp-vendor-monitor",
              "cp-model-metrics"
              ]
          },
          {
             "ref": "6.1.2.a",
             "title": "Information security risk assessment, part a)",
             "summary": "The organization shall define and apply an information security risk assessment process that: establishes and maintains information security risk criteria that include: 1) the risk acceptance criteria; and 2) criteria for performing information security risk assessments.",
             "mappedControls" : [
              "cp-risk-mgmt-objectives"
              ]
          },
          {
             "ref": "6.1.2.b",
             "title": "Information security risk assessment, part b)",
             "summary": "The organization shall define and apply an information security risk assessment process that: ensures that repeated information security risk assessments produce consistent, valid and comparable results.",
             "mappedControls" : [
              "cp-risk-mgmt-objectives",
              "cp-risk-assess",
              "cp-risk-registry"
              ]
          },
          {
             "ref": "6.1.2.c",
             "title": "Information security risk assessment, part c)",
             "summary": "The organization shall define and apply an information security risk assessment process that identifies the information security risks: 1) to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; and 2) identify the risk owners.",
             "mappedControls" : [
                "cp-risk-assess",
              "cp-risk-registry",
              "cp-risk-fraud"
              ]
          },
          {
             "ref": "6.1.2.d",
             "title": "Information security risk assessment, part d)",
             "summary": "The organization shall define and apply an information security risk assessment process that analyzes the information security risks [to] 1) assess the potential consequences that would result if the risks identified were to materialize... 2) assess the realistic likelihood of occurence...[and] 3) determine the levels of risk.",
             "mappedControls" : [
              "cp-risk-mgmt",
              "cp-risk-mgmt-objectives",
              "cp-risk-assess",
              "cp-risk-registry"
              ]
          },
          {
             "ref": "6.1.2.e",
             "title": "Information security risk assessment, part e)",
             "summary": "The organization shall define and apply an information security risk assessment process that evaluates the information security risks [to] 1) compare the results of risk analysis with the risk criteria established...[and] 2) prioritize the analyzed risks for risk treatment. The organization shall retain documented information about the...risk assessment process.",
             "mappedControls" : [
              "cp-risk-mgmt",
              "cp-risk-mgmt-objectives",
              "cp-risk-assess",
              "cp-risk-registry",
              "cp-risk-mitigation"
              ]
          },
          {
             "ref": "6.1.3.a",
             "title": "Information security risk treatment, part a)",
             "summary": "The organization shall define and apply an information security risk treatment process to: select appropriate information security treatment options, taking account of the risk assessment results.",
             "mappedControls" : [
              "cp-risk-assess",
              "cp-risk-mitigation",
              "cp-risk-registry"
              ]
          },
          {
             "ref": "6.1.3.b",
             "title": "Information security risk treatment, part b)",
             "summary": "The organization shall define and apply an information security risk treatment process to: determine all controls that are necessary to implement the information security risk treatment option(s) chosen.",
             "mappedControls" : [
              "cp-risk-assess",
              "cp-risk-mitigation"
              ]
          },
          {
             "ref": "6.1.3.c",
             "title": "Information security risk treatment, part c)",
             "summary": "The organization shall define and apply an information security risk treatment process to: compare the controls determined with Annex A and verify that no necessary controls have been omitted.",
             "mappedControls" : [
              "cp-risk-mitigation",
              "cp-audit-control-deficiency",
              "cp-audit-internal",
              "cp-audit-tools"
              ]
          },
          {
             "ref": "6.1.3.d",
             "title": "Information security risk treatment, part d)",
             "summary": "The organization shall define and apply an information security risk treatment process to: produce a Statement of Applicability that contains the necessary controls (see 6.1.3 b) and c)) and justification for inclusions, whether they are implemented or not, and the justification for exclusions of controls from Annex A.",
             "mappedControls" : [
              "cp-ism-scope"
              ]
          },
          {
             "ref": "6.1.3.e",
             "title": "Information security risk treatment, part e)",
             "summary": "The organization shall define and apply an information security risk treatment process to: formulate an information security risk treatment plan.",
             "mappedControls" : [
              "cp-risk-mgmt",
              "cp-risk-mitigation"
              ]
          },
          {
             "ref": "6.1.3.f",
             "title": "Information security risk treatment, part f)",
             "summary": "The organization shall define and apply an information security risk treatment process to: obtain risk owners’ approval of the information security risk treatment plan and acceptance of the residual information security risks. The organization shall retain documented information about the information security risk treatment process.",
             "mappedControls" : [
              "cp-risk-registry"
              ]
          },
          {
             "ref": "6.2.a",
             "title": "Information security objectives and planning to achieve them, part a)",
             "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be consistent with the information security policy.",
             "mappedControls" : [
              "cp-role-assignment",
              "cp-policy-framework",
              "cp-ism-policies"
              ]
          },
          {
             "ref": "6.2.b",
             "title": "Information security objectives and planning to achieve them, part b)",
             "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be measurable (if practicable).",
             "mappedControls" : [
              "cp-role-assignment",
              "cp-ism-reporting",
              "cp-model-metrics"
              ]
          },
          {
             "ref": "6.2.c",
             "title": "Information security objectives and planning to achieve them, part c)",
             "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: take into account applicable information security requirements, and results from risk assessment and risk treatment.",
             "mappedControls" : [
              "cp-ism-reporting",
              "cp-model-metrics"
              ]
          },
          {
             "ref": "6.2.d",
             "title": "Information security objectives and planning to achieve them, part d)",
             "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be communicated.",
             "mappedControls" : [
              "cp-internal-comms",
              "cp-training-awareness",
              "cp-model-principles"
              ]
          },
          {
             "ref": "6.2.e",
             "title": "Information security objectives and planning to achieve them, part e)",
             "summary": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: be be updated as appropriate.",
             "mappedControls" : [
              "cp-role-assignment",
              "cp-model-principles"
              ]
          },
          {
             "ref": "6.2.f",
             "title": "Information security objectives and planning to achieve them, part f)",
             "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: what will be done.",
             "mappedControls" : [ 
              "cp-ism-policies",
              "cp-role-assignment"
              ]
          },
          {
             "ref": "6.2.g",
             "title": "Information security objectives and planning to achieve them, part g)",
             "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: what resources will be required.",
             "mappedControls" : [
              "cp-model-architecture",
              "cp-bcdr"
              ]
          },
          {
             "ref": "6.2.h",
             "title": "Information security objectives and planning to achieve them, part h)",
             "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: who will be responsible.",
             "mappedControls" : [
              "cp-role-assignment"
              ]
          },
          {
             "ref": "6.2.i",
             "title": "Information security objectives and planning to achieve them, part i)",
             "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: when it will be completed.",
             "mappedControls" : [
              "cp-ccm-config"
              ]
          },
          {
             "ref": "6.2.j",
             "title": "Information security objectives and planning to achieve them, part j)",
             "summary": "The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: how the results will be evaluated.",
             "mappedControls" : [
              "cp-model-metrics",
              "cp-model-quality"
              ]
           }
          ]
          },
          {
             "title": "7 - Support",
                "controls": [
          {
             "ref": "7.1",
             "title": "Resources",
             "summary": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the information security management system.",
             "mappedControls" : [
              "cp-ism-scope",
              "cp-hr-mgmt",
              "cp-model-metrics",
              "cp-model-quality" 
              ]
          },
          {
             "ref": "7.2.a",
             "title": "Competence, part a)",
             "summary": "The organization shall: determine the necessary competence of person(s) doing work under its control that affects its information security performance.",
             "mappedControls" : [
              "cp-employee-screening",
              "cp-employee-performance",
              "cp-employee-development"
              ]
          },
          {
             "ref": "7.2.b",
             "title": "Competence, part b)",
             "summary": "The organization shall: ensure that these persons are competent on the basis of appropriate education, training, or experience.",
             "mappedControls" : [
              "cp-employee-screening",
              "cp-employee-development",
              "cp-hr-mgmt"
              ]
          },
          {
             "ref": "7.2.c",
             "title": "Competence, part c)",
             "summary": "The organization shall: where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken.",
             "mappedControls" : [
              "cp-employee-development",
              "cp-sanctions",
              "cp-training-policy",
              "cp-training-awareness"
              ]
          },
          {
             "ref": "7.2.d",
             "title": "Competence, part d)",
             "summary": "The organization shall: retain appropriate documented information as evidence of competence. Applicable actions may include, for example: the provision of training to, the mentoring of, or the reassignment of current employees; or the hiring or contracting of competent persons.",
             "mappedControls" : [
              "cp-employee-screening",
              "cp-employee-development",
              "cp-sanctions",
              "cp-hr-mgmt"
              ]
          },
          {
             "ref": "7.3.a",
             "title": "Awareness, part a)",
             "summary": "Persons doing work under the organization’s control shall be aware of: the information security policy.",
             "mappedControls" : [
              "cp-training-awareness"
              ]
          },
          {
             "ref": "7.3.b",
             "title": "Awareness, part b)",
             "summary": "Persons doing work under the organization’s control shall be aware of: their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance.",
             "mappedControls" : [
              "cp-training-awareness",
              "cp-employee-development",
              "cp-sanctions"
              ]
          },
          {
             "ref": "7.3.c",
             "title": "Awareness, part c)",
             "summary": "Persons doing work under the organization’s control shall be aware of: the implications of not conforming with the information security management system requirements.",
             "mappedControls" : [
              "cp-training-awareness",
              "ref-employee-handbook",
              "cp-employee-acceptable-use"
              ]
          },
          {
             "ref": "7.4.a",
             "title": "Communication, part a)",
             "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: on what to communicate.",
             "mappedControls" : [
              "cp-internal-comms",
              "cp-audit-customers",
              "cp-breach-customer",
              "cp-privacy-notices",
              "ref-privacy-policy",
              "cp-vendor-contracts"
              ]
          },
          {
             "ref": "7.4.b",
             "title": "Communication, part b)",
             "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: when to communicate.",
             "mappedControls" : [
              "cp-internal-comms",
              "cp-breach-customer",
              "cp-privacy-notices"
              ]
          },
          {
             "ref": "7.4.c",
             "title": "Communication, part c)",
             "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: with whom to communicate.",
             "mappedControls" : [
              "cp-ism-scope",
              "cp-internal-comms"
              ]
          },
          {
             "ref": "7.4.d",
             "title": "Communication, part d)",
             "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: who shall communicate.",
             "mappedControls" : [
              "cp-role-assignment"
              ]
          },
          {
             "ref": "7.4.e",
             "title": "Communication, part e)",
             "summary": "The organization shall determine the need for internal and external communications relevant to the information security management system including: the process by which communication shall be effected.",
             "mappedControls" : [
              "cp-ir-playbook",
              "cp-bcdr",
              "cp-breach-customer",
              "cp-breach-authorities",
              "cp-breach-letter"
              ]
          },
          {
             "ref": "7.5.1",
             "title": "Documented information - General",
             "summary": "The organization’s information security management system shall include: documented information required by this International Standard [and] documented information determined by the organization as being necessary for the effectiveness of the information security management system.",
             "mappedControls" : [
              "cp-policy-framework",
              "cp-policy-mgmt",
              "cp-sdlc-dev",
              "cp-sdlc-appsec-req",
              "cp-sdlc-design"
              ]
          },
          {
             "ref": "7.5.2",
             "title": "Documented information - Creating and updating",
             "summary": "When creating and updating documented information the organization shall ensure appropriate: identification and description (e.g. a title, date, author, or reference number); format (e.g. language, software version, graphics) and media (e.g. paper, electronic); and review and approval for suitability and adequacy.",
             "mappedControls" : [
              "cp-data-classification",
              "cp-data-handling",
              "cp-data-lifecycle",
              "cp-data-backup",
              "cp-data-protection",
              "cp-data-protection-integrity",
              "cp-audit-trails-integrity",
              "cp-ccm-config"
              ]
          },
          {
             "ref": "7.5.3.a",
             "title": "Documented information - Control, part a)",
             "summary": "Documented information required by the information security management system and by this International Standard shall be controlled to ensure: it is available and suitable for use, where and when it is needed.",
             "mappedControls" : [
              "cp-policy-framework",
              "cp-privacy-notices",
              "ref-privacy-policy",
              "cp-internal-comms"
              ]
          },
          {
             "ref": "7.5.3.b",
             "title": "Documented information - Control, part b)",
             "summary": "Documented information required by the information security management system and by this International Standard shall be controlled to ensure: it is adequately protected (e.g. from loss of confidentiality, improper use, or loss of integrity).",
             "mappedControls" : [
              "cp-data-classification",
              "cp-data-handling",
              "cp-data-backup",
              "cp-data-protection",
              "cp-data-protection-integrity",
              "cp-audit-trails-integrity",
              "cp-ccm-config"
              ]
          },
          {
             "ref": "7.5.3.c",
             "title": "Documented information - Control, part c)",
             "summary": "For the control of documented information, the organization shall address the following activities, as applicable: distribution, access, retrieval and use.",
             "mappedControls" : [
              "cp-access-standards",
              "cp-data-handling",
              "cp-data-protection",
              "cp-access-privileged",
              "cp-access-rbac"
              ]
          },
          {
             "ref": "7.5.3.d",
             "title": "Documented information - Control, part d)",
             "summary": "For the control of documented information, the organization shall address the following activities, as applicable: storage and preservation, including the preservation of legibility.",
             "mappedControls" : [
              "cp-data-lifecycle",
              "cp-data-backup",
              "cp-data-protection",
              "cp-data-protection-integrity",
              "cp-audit-trails-integrity"
              ]
          },
          {
             "ref": "7.5.3.e",
             "title": "Documented information - Control, part e)",
             "summary": "For the control of documented information, the organization shall address the following activities, as applicable: control of changes (e.g. version control).",
             "mappedControls" : [
              "cp-data-protection-integrity",
              "cp-ccm-config",
              "cp-access-change"
              ]
          },
          {
             "ref": "7.5.3.f",
             "title": "Documented information - Control, part f)",
             "summary": "For the control of documented information, the organization shall address the following activities, as applicable: retention and disposition. Documented information of external origin, determined by the organization to be necessary for the planning and operation of the information security management system, shall be identified as appropriate, and controlled.",
             "mappedControls" : [
              "cp-data-lifecycle",
              "cp-data-backup",
              "cp-data-deletion",
              "cp-mdm-disposal"
              ]
          }
          ]
          },
          {
             "title": "8 - Operation",
                "controls": [
          {
             "ref": "8.1",
             "title": "Operational planning and control",
             "summary": "The organization shall plan, implement and control the processes needed to meet information security requirements, and to implement the actions determined in 6.1. The organization shall also implement plans to achieve information security objectives determined in 6.2. The organization shall keep documented information to the extent necessary to have confidence that the processes have been carried out as planned. The organization shall control planned changes and review the consequences of unintended changes, taking action to mitigate any adverse effects, as necessary. The organization shall ensure that outsourced processes are determined and controlled.",
             "mappedControls" : [
              "cp-ccm-config",
              "cp-access-change",
              "cp-vendor-monitor",
              "cp-sdlc-dev",
              "cp-ccm-prodcm",
              "cp-access-prod"
              ]
          },
          {
             "ref": "8.2",
             "title": "Information security risk assessment",
             "summary": "The organization shall perform information security risk assessments at planned intervals or when significant changes are proposed or occur, taking account of the criteria established in 6.1.2 a). The organization shall retain documented information of the results of the information security risk assessments.",
             "mappedControls" : [
              "cp-risk-mgmt",
              "cp-risk-assess",
              "cp-risk-registry",
              "cp-risk-fraud"
              ]
          },
          {
             "ref": "8.3",
             "title": "Information security risk treatment",
             "summary": "The organization shall implement the information security risk treatment plan. The organization shall retain documented information of the results of the information security risk treatment.",
             "mappedControls" : [
              "cp-risk-registry",
              "cp-risk-mitigation",
              "cp-risk-insurance"
              ]
            }
            ]
          },
          {
             "title": "9 - Performance evaluation",
                "controls": [
          {
             "ref": "9.1.a",
             "title": "Monitoring, measurement, analysis, and evaluation, part a)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: what needs to be monitored and measured, including information security processes and controls.",
             "mappedControls" : [
              "cp-compliance-monitor",
              "cp-model-metrics",
              "cp-model-quality"
              ]
          },
          {
             "ref": "9.1.b",
             "title": "Monitoring, measurement, analysis, and evaluation, part b)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: the methods for monitoring, measurement, analysis and evaluation, as applicable, to ensure valid results. The methods selected should produce comparable and reproducible results to be considered valid.",
              "mappedControls" : [
              "cp-compliance-monitor",
              "cp-model-metrics",
              "cp-model-quality"
              ]
          },
          {
             "ref": "9.1.c",
             "title": "Monitoring, measurement, analysis, and evaluation, part c)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: when the monitoring and measuring shall be performed.",
             "mappedControls" : [
              "cp-model-metrics",
              "cp-audit-internal"
              ]
          },
          {
             "ref": "9.1.d",
             "title": "Monitoring, measurement, analysis, and evaluation, part d)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: who shall monitor and measure.",
             "mappedControls" : [
              "cp-role-assignment"
              ]
          },
          {
             "ref": "9.1.e",
             "title": "Monitoring, measurement, analysis, and evaluation, part e)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: when the results from monitoring and measurement shall be analysed and evaluated.",
             "mappedControls" : [
              "cp-audit-tools"
              ]
          },
          {
             "ref": "9.1.f",
             "title": "Monitoring, measurement, analysis, and evaluation, part f)",
             "summary": "The organization shall evaluate the information security performance and the effectiveness of the information security management system. The organization shall determine: who shall analyse and evaluate these results. The organization shall retain appropriate documented information as evidence of the monitoring and measurement results.",
             "mappedControls" : [
                 "cp-audit-control-deficiency",
              "cp-audit-review"
              ]
          },
          {
             "ref": "9.2.a",
             "title": "Internal audit, part a)",
             "summary": "The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: conforms to the organization’s own requirements for its information security management system; and the requirements of this International Standard.",
             "mappedControls" : [
              "cp-internal-audit"
              ]
          },
          {
             "ref": "9.2.b",
             "title": "Internal audit, part b)",
             "summary": "The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: is effectively implemented and maintained.",
             "mappedControls" : [
              "cp-internal-audit",
              "cp-audit-control-deficiency",
              "cp-audit-review"
              ]
          },
          {
             "ref": "9.2.c",
             "title": "Internal audit, part c)",
             "summary": "The organization shall: plan, establish, implement and maintain an audit programme(s), including the frequency, methods, responsibilities, planning requirements and reporting. The audit programme(s) shall take into consideration the importance of the processes concerned and the results of previous audits.",
             "mappedControls" : [
              "cp-internal-audit",
              "cp-audit-control-deficiency",
              "cp-audit-review",
              "cp-audit-types"
              ]
          },
          {
             "ref": "9.2.d",
             "title": "Internal audit, part d)",
             "summary": "The organization shall: select auditors and conduct audits that ensure objectivity and the impartiality of the audit process.",
              "mappedControls" : [
              "cp-internal-audit",
              "cp-sdlc-pentest"
              ]
          },
          {
             "ref": "9.2.e",
             "title": "Internal audit, part e)",
             "summary": "The organization shall: select auditors and conduct audits that ensure objectivity and the impartiality of the audit process.",
             "mappedControls" : [
              "cp-internal-audit",
              "cp-sdlc-pentest"
              ]
          },
          {
             "ref": "9.2.f",
             "title": "Internal audit, part f)",
             "summary": "The organization shall: ensure that the results of the audits are reported to relevant management.",
              "mappedControls" : [
              "cp-audit-review"
              ]
          },
          {
             "ref": "9.2.g",
             "title": "Internal audit, part g)",
             "summary": "The organization shall: retain documented information as evidence of the audit programme(s) and the audit results.",
              "mappedControls" : [
              "cp-audit-internal",
              "cp-sdlc-pentest",
              "cp-vuln-scan",
              "cp-vuln-remediation"
              ]
          },
          {
             "ref": "9.3.a",
             "title": "Management review, part a)",
             "summary": "Top management shall review the organization’s information security management system at planned intervals to ensure its continuing suitability, adequacy and effectiveness. The management review shall include consideration of: the status of actions from previous management reviews.",
              "mappedControls" : [
              "cp-ism-scope",
              "cp-policy-mgmt",
              "cp-model-metrics",
              "cp-model-quality",
              "cp-compliance-mgmt",
              "cp-ism-reporting"
              ]
          },
          {
             "ref": "9.3.b",
             "title": "Management review, part b)",
             "summary": "The management review shall include consideration of: changes in external and internal issues that are relevant to the information security management system.",
              "mappedControls" : [
              "cp-ism-scope",
              "cp-policy-framework"
              ]
          },
          {
             "ref": "9.3.c",
             "title": "Management review, part c)",
             "summary": "The management review shall include consideration of: feedback on the information security performance, including trends in: nonconformities and corrective actions; monitoring and measurement results; audit results; and fulfilment of information security objectives.",
              "mappedControls" : [
              "cp-model-metrics",
              "cp-model-quality",
              "cp-compliance-mgmt",
              "cp-ism-reporting",
              "cp-audit-review",
              "cp-sdlc-pentest",
              "cp-ir-emergency",
              "cp-ir-tabletop",
              "cp-bcdr-test"
              ]
          },
          {
             "ref": "9.3.d",
             "title": "Management review, part d)",
             "summary": "The management review shall include consideration of: feedback from interested parties.",
              "mappedControls": [
              "cp-employee-whistleblower"
              ]
          },
          {
             "ref": "9.3.e",
             "title": "Management review, part e)",
             "summary": "The management review shall include consideration of: results of risk assessment and status of risk treatment plan.",
              "mappedControls": [
              "cp-risk-assess",
              "cp-risk-mitigation",
              "cp-risk-registry"
              ]
          },
          {
             "ref": "9.3.f",
             "title": "Management review, part e)",
             "summary": "The management review shall include consideration of: opportunities for continual improvement. The outputs of the management review shall include decisions related to continual improvement opportunities and any needs for changes to the information security management system. The organization shall retain documented information as evidence of the results of management reviews.",
              "mappedControls": [
              "cp-ism-reporting"
              ]
           }
            ]
        },
        {
            "title": "10 - Improvement",
              "controls": [
          {
             "ref": "10.1.a",
             "title": "Nonconformity and corrective action, part a)",
             "summary": "When a nonconformity occurs, the organization shall: react to the nonconformity, and as applicable: take action to control and correct it; and deal with the consequences.",
              "mappedControls": [
              "cp-sdlc-sast",
              "cp-sdlc-dast",
              "cp-sdlc-iaaa",
              "cp-vuln-remediation",
              "cp-risk-mitigation",
              "cp-audit-control-deficiency"
              ]
          },
          {
             "ref": "10.1.b",
             "title": "Nonconformity and corrective action, part b)",
             "summary": "When a nonconformity occurs, the organization shall: evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: reviewing the nonconformity; determining the causes of the nonconformity; and determining if similar nonconformities exist, or could potentially occur.",
              "mappedControls": [
              "cp-sdlc-iaaa",
              "cp-audit-control-deficiency",
              "cp-breach-investigate"
              ]
          },
          {
             "ref": "10.1.c",
             "title": "Nonconformity and corrective action, part c)",
             "summary": "When a nonconformity occurs, the organization shall: evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: implement any action needed.",
             "mappedControls": [
              "cp-risk-mitigation",
              "cp-vuln-remediation"
              ]
          },
          {
             "ref": "10.1.d",
             "title": "Nonconformity and corrective action, part d)",
             "summary": "When a nonconformity occurs, the organization shall: review the effectiveness of any corrective action taken.",
              "mappedControls": [
              "cp-risk-mgmt",
              "cp-compliance-mgmt",
              "cp-risk-mitigation"
              ]
          },
          {
             "ref": "10.1.e",
             "title": "Nonconformity and corrective action, part e)",
             "summary": "When a nonconformity occurs, the organization shall: make changes to the information security management system, if necessary.",
              "mappedControls": [
              "cp-compliance-mgmt",
              "cp-risk-mitigation",
              "cp-policy-mgmt"
              ]
          },
          {
             "ref": "10.1.f",
             "title": "Nonconformity and corrective action, part f)",
             "summary": "Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of: the nature of the nonconformities and any subsequent actions taken.",
              "mappedControls": [
              "cp-vuln-scan",
              "cp-sdlc-pentest",
              "cp-vuln-remediation",
              "cp-sdlc-scm"
              ]
          },
          {
             "ref": "10.1.g",
             "title": "Nonconformity and corrective action, part g)",
             "summary": "Corrective actions shall be appropriate to the effects of the nonconformities encountered. The organization shall retain documented information as evidence of: the results of any corrective action.",
              "mappedControls": [
              "cp-sdlc-monitor",
              "cp-model-metrics",
              "cp-vuln-remediation"
              ]
          },
          {
             "ref": "10.2",
             "title": "Continual improvement",
             "summary": "The organization shall continually improve the suitability, adequacy and effectiveness of the information security management system.",
              "mappedControls": [
              "cp-ism-reporting",
              "cp-compliance-mgmt",
              "cp-model-quality"
              ]
          }
        ]
      },
      {
        "title": "A.5 -  Information security policies",
         "controls": [
          {
             "ref": "A.5.1.1",
             "title": "Policies for information security",
             "summary": "A set of policies for information security shall be defined, approved by management, published and communicated to employees and relevant external parties.",
              "mappedControls": [
              "cp-ism-policies",
              "cp-policy-framework",
              "cp-employee-onboarding"
                ]
          },
          {
            "ref": "A.5.1.2",
            "title": "Review of the policies for information security",
            "summary": "The policies for information security shall be reviewed at planned intervals or if significant changes occur to ensure their continuing suitability, adequacy and effectiveness.",
              "mappedControls": [
              "cp-policy-mgmt"
              ]
          }
        ]
      },
      {
        "title": "A.6 - Organization of information security",
        "controls": [
          {
            "ref": "A.6.1.1",
            "title": "Information security roles and responsibilities",
            "summary": "All information security responsibilities shall be defined and allocated.",
               "mappedControls": [
                "cp-role-assignment"
                ]
          },
          {
            "ref": "A.6.1.2",
            "title": "Segregation of duties",
            "summary": "Conflicting duties and areas of responsibility shall be segregated to reduce opportunities for unauthorized or unintentional modification or misuse of the organization’s assets.",
               "mappedControls" : [ 
                  "cp-role-assignment",
              "cp-access-prod-data"
                  ]
          },
          {
            "ref": "A.6.1.3",
            "title": "Contact with authorities",
            "summary": "Appropriate contacts with relevant authorities shall be maintained.",
              "mappedControls" : [ 
              "cp-breach-authorities"
              ]
          },
          {
            "ref": "A.6.1.4",
            "title": "Contact with special interest groups",
            "summary": "Appropriate contacts with special interest groups or other specialist security forums and professional associations shall be maintained.",
              "mappedControls" : [ 
                  "cp-employee-development",
                  "cp-threat-intel"
                  ]
          },
          {
            "ref": "A.6.1.5",
            "title": "Information security in project management",
            "summary": "Information security shall be addressed in project management, regardless of the type of the project.",
              "mappedControls" : [
                 "cp-risk-mgmt",
                 "cp-sdlc-dev",
                  "cp-vendor-vtr",
                  "cp-vendor-contracts"
                  ]
          },
          {
            "ref": "A.6.2.1",
            "title": "Mobile device policy",
            "summary": "A policy and supporting security measures shall be adopted to manage the risks introduced by using mobile devices.",
               "mappedControls" : [
                "cp-employee-acceptable-use",
                "cp-access-endpoints",
                "cp-mdm-byod"
                ]
          },
          {
            "ref": "A.6.2.2",
            "title": "Teleworking",
            "summary": "A policy and supporting security measures shall be implemented to protect information accessed, processed or stored at teleworking sites.",
              "mappedControls" : [
                "cp-access-vpn",
                "cp-access-wifi"
                ]
          }
        ]
      },
      {
        "title": "A.7 - Human resource security",
        "controls": [
          {
            "ref": "A.7.1.1",
            "title": "Screening",
            "summary": "Background verification checks on all candidates for employment shall be carried out in accordance with relevant laws, regulations and ethics and shall be proportional to the business requirements, the classification of the information to be accessed and the perceived risks.",
              "mappedControls" : [
                "cp-employee screening",
              "cp-hr-mgmt"
                ]
          },
          {
            "ref": "A.7.1.2",
            "title": "Terms and conditions of employment",
            "summary": "The contractual agreements with employees and contractors shall state their and the organization’s responsibilities for information security.",
                "mappedControls" : [
                "cp-employee-acceptable-use",
                "ref-employee-handbook",
              "cp-sdlc-outsourcing"
                ]
          },
          {
            "ref": "A.7.2.1",
            "title": "Management responsibilities",
            "summary": "Management shall require all employees and contractors to apply information security in accordance with the established policies and procedures of the organization.",
                "mappedControls" : [
                "cp-employee-acceptable-use",
                "cp-ism-scope",
                "cp-role-assignment"
                ]
          },
          {
            "ref": "A.7.2.2",
            "title": "Information security awareness, education and training",
            "summary": "All employees of the organization and, where relevant, contrac- tors shall receive appropriate awareness education and training and regular updates in organizational policies and procedures, as relevant for their job function.",
                 "mappedControls" : [
                "cp-training-policy",
                "cp-training-awareness"
                ]
          },
          {
            "ref": "A.7.2.3",
            "title": "Disciplinary process",
            "summary": "There shall be a formal and communicated disciplinary process in place to take action against employees who have committed an information security breach.",
               "mappedControls" : [
                "cp-employee-acceptable-use",
                "cp-sanctions"
                ]
          },
          {
            "ref": "A.7.3.1",
            "title": "Termination or change of employment responsibilities",
            "summary": "Information security responsibilities and duties that remain valid after termination or change of employment shall be defined, communicated to the employee or contractor and enforced.",
                "mappedControls" : [
                "cp-employee-exiting"
                ]
          }
        ]
      },
      {
        "title": "A.8 - Asset management",
        "controls": [
          {
            "ref": "A.8.1.1",
            "title": "Inventory of assets",
            "summary": "Assets associated with information and information processing facilities shall be identified and an inventory of these assets shall be drawn up and maintained.",
                "mappedControls" : [ 
                "cp-asset-physical", 
                "cp-asset-digital",
                "cp-asset-paper",
                "cp-access-standards"
                ]
          },
          {
            "ref": "A.8.1.2",
            "title": "Ownership of assets",
            "summary": "Assets maintained in the inventory shall be owned.",
                "mappedControls" : [ 
                "cp-compliance-mgmt",
              "cp-access-change",
              "cp-asset-physical",
              "cp-asset-digital",
              "cp-asset-paper"
              ]
          },
          {
            "ref": "8.1.3",
            "title": "Acceptable use of assets",
            "summary": "Rules for the acceptable use of information and of assets associated with information and information processing facilities shall be identified, documented and implemented.",
                "mappedControls" : [ 
                "cp-employee-acceptable-use",
                "cp-mdm-disposal",
                "cp-access-standards",
                "cp-access-change"
                ]
          },
          {
            "ref": "A.8.1.4",
            "title": "Return of assets",
            "summary": "All employees and external party users shall return all of the organizational assets in their possession upon termination of their employment, contract or agreement.",
                "mappedControls" : [ 
                "cp-employee-exiting",
                "cp-access-standards"
                ]
          },
          {
            "ref": "A.8.2.1",
            "title": "Classification of information",
            "summary": "Information shall be classified in terms of legal requirements, value, criticality and sensitivity to unauthorised disclosure or modification.",
                "mappedControls" : [
                "cp-data-classification"
                ]
          },
          {
            "ref": "A.8.2.2",
            "title": "Labelling of information",
            "summary": "An appropriate set of procedures for information labelling shall be developed and implemented in accordance with the information classification scheme adopted by the organization.",
                "mappedControls" : [ 
                "cp-data-classification",
                "cp-data-handling"
                ]
          },
          {
            "ref": "A.8.2.3",
            "title": "Handling of assets",
            "summary": "Procedures for handling assets shall be developed and implemented in accordance with the information classification scheme adopted by the organization.",
                "mappedControls" : [ 
                "cp-data-handling",
              "cp-access-password"
              ]
              
          },
          {
            "ref": "A.8.3.1",
            "title": "Management of removable media",
            "summary": "Procedures shall be implemented for the management of removable media in accordance with the classification scheme adopted by the organization.",
                "mappedControls" : [ 
                "cp-mdm-usb"
                ]
          },
          {
            "ref": "A.8.3.2",
            "title": "Displosal of media",
            "summary": "Media shall be disposed of securely when no longer required, using formal procedures.",
                    "mappedControls" : [ 
                    "cp-mdm-disposal",
                    "cp-data-lifecycle"
                    ]
          },
          {
            "ref": "A.8.3.3",
            "title": "Physical media transfer",
            "summary": "Media containing information shall be protected against unauthorized access, misuse or corruption during transportation.",
                "mappedControls" : [ 
                "cp-mdm-usb"
                ]
          }
        ]
      },
      {
        "title": "A.9 - Access control",
        "controls": [
          {
            "ref": "A.9.1.1",
            "title": "Access control policy",
            "summary": "An access control policy shall be established, documented and reviewed based on business and information security requirements.",
              "mappedControls" : [ 
              "cp-access-standards"
              ]
          },
          {
            "ref": "A.9.1.2",
            "title": "Access to networks and network services",
            "summary": "Users shall only be provided with access to the network and net- work services that they have been specifically authorized to use.",
              "mappedControls" : [ 
              "cp-access-aws",
              "cp-access-vpn",
               "cp-access-wifi",
              "cp-access-prod-data"   
              ] 
          },
          {
            "ref": "A.9.2.1",
            "title": "User registration and de-registration",
            "summary": "A formal user registration and de-registration process shall be implemented to enable assignment of access rights.",
               "mappedControls" : [ 
               "cp-access-standards"
               ]
          },
          {
            "ref": "9.2.2",
            "title": "User access provisioning",
            "summary": "A formal user access provisioning process shall be implemented to assign or revoke access rights for all user types to all systems and services.",
              "mappedControls" : [ 
              "cp-access-standards"
              ]
          },
          {
            "ref": "A.9.2.3",
            "title": "Management of privileged access rights",
            "summary": "The allocation and use of privileged access rights shall be restricted and controlled.",
               "mappedControls" : [ 
               "cp-access-aws",
               "cp-access-privileged"
               ]
          },
          {
            "ref": "A.9.2.4",
            "title": "Management of secret authentication information of users",
            "summary": "The allocation of secret authentication information shall be controlled through a formal management process.",
               "mappedControls" : [ 
               "cp-access-prod",
               "cp-access-standards"
               ]
          },
          {
            "ref": "A.9.2.5",
            "title": "Review of user access rights",
            "summary": "Asset owners shall review users’ access rights at regular intervals.",
               "mappedControls" : [ 
               "cp-access-review"  
               ]
          },
          {
            "ref": "A.9.2.6",
            "title": "Removal or adjustment of access rights",
            "summary": "The access rights of all employees and external party users to information and information processing facilities shall be removed upon termination of their employment, contract or agreement, or adjusted upon change.",
                "mappedControls" : [ 
                "cp-access-change"
                ]
          },
          {
            "ref": "A.9.3.1",
            "title": "Use of secret authentication information",
            "summary": "Users shall be required to follow the organization’s practices in the use of secret authentication information.",
                "mappedControls" : [ 
                "cp-access-prod"
                ]
          },
          {
            "ref": "A.9.4.1",
            "title": "Information access restriction",
            "summary": "Access to information and application system functions shall be restricted in accordance with the access control policy.",
                 "mappedControls" : [ 
                 "cp-access-prod-data"
                 ]
          },
          {
            "ref": "A.9.4.2",
            "title": "Secure log-on procedures",
            "summary": "Where required by the access control policy, access to systems and applications shall be controlled by a secure log-on procedure.",
                "mappedControls" : [
                "cp-access-sso",
              "cp-access-standards",
              "cp-access-mfa"
              ]
          },
          {
            "ref": "A.9.4.3",
            "title": "Password management system",
            "summary": "Password management systems shall be interactive and shall ensure quality passwords.",
              "mappedControls" : [
              "cp-access-password"
              ]
          },
          {
            "ref": "A.9.4.4",
            "title": "Use of privileged utility programs",
            "summary": "The use of utility programs that might be capable of overriding system and application controls shall be restricted and tightly controlled.",
                "mappedControls" : [
              "cp-access-service"
              ]
          },
          {
            "ref": "A.9.4.5",
            "title": "Access control to program source code",
            "summary": "Access to program source code shall be restricted.",
              "mappedControls" : [
              "cp-sdlc-dev",
              "cp-sdlc-iaaa",
              "cp-access-change"
              ]
          }
        ]
      },
      {
        "title": "A.10 - Cryptography",
        "controls": [
          {
            "ref": "A.10.1.1",
            "title": "Policy on the use of cryptographic controls",
            "summary": "A policy on the use of cryptographic controls for protection of information shall be developed and implemented.",
              "mappedControls" : [
              "cp-data-protection"
              ]
          },
          {
            "ref": "A.10.1.2",
            "title": "Key management",
            "summary": "A policy on the use, protection and lifetime of cryptographic keys shall be developed and implemented through their whole lifecycle.",
                 "mappedControls" : [
              "cp-data-protection-kms"
              ]
          }
        ]
      },
      {
        "title": "11 - Physical and environmental security",
        "controls": [
          {
            "ref": "11.1.1",
            "title": "Physical security perimeter",
            "summary": "Security perimeters shall be defined and used to protect areas that contain either sensitive or critical information and information processing facilities.",
                "mappedControls" : [
               "cp-physical",
               "cp-physical-datacenter"
               ]
          },
          {
            "ref": "A.11.1.2",
            "title": "Physical entry controls",
            "summary": "Secure areas shall be protected by appropriate entry controls to ensure that only authorized personnel are allowed access.",
                "mappedControls" : [
               "cp-physical",
               "cp-physical-datacenter"
               ]
          },
          {
            "ref": "A.11.1.3",
            "title": "Securing offices, rooms and facilities",
            "summary": "Physical security for offices, rooms and facilities shall be designed and applied.",
              "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter"
              ]
          },
          {
            "ref": "A.11.1.4",
            "title": "Protecting against external and environmental threats",
            "summary": "Physical protection against natural disasters, malicious attack or accidents shall be designed and applied.",
                "mappedControls" : [
               "cp-physical",
                "cp-physical-datacenter"
                ]
          },
          {
            "ref": "A.11.1.5",
            "title": "Working in secure areas",
            "summary": "Procedures for working in secure areas shall be designed and applied.",
              "mappedControls" : [
                "cp-physical",
                "cp-physical-datacenter"
                ]
          },
          {
            "ref": "A.11.1.6",
            "title": "Delivery and loading areas",
            "summary": "Access points such as delivery and loading areas and other points where unauthorized persons could enter the premises shall be controlled and, if possible, isolated from information processing facilities to avoid unauthorized access.",
                "mappedControls" : [
                "cp-physical",
                "cp-physical-datacenter"
                ]
          },
          {
            "ref": "A.11.2.1",
            "title": "Equipment siting and protection",
            "summary": "Equipment shall be sited and protected to reduce the risks from environmental threats and hazards, and opportunities for unauthorized access.",
                "mappedControls" : [
                "cp-physical",
                "cp-physical-datacenter"
                ]
          },
          {
            "ref": "A.11.2.2",
            "title": "Supporting utilities",
            "summary": "Equipment shall be protected from power failures and other disruptions caused by failures in supporting utilities.",
                "mappedControls" : [
               "cp-physical",
              "cp-physical-datacenter"
              ]
          },
          {
            "ref": "A.11.2.3",
            "title": "Cabling security",
            "summary": "Power and telecommunications cabling carrying data or supporting information services shall be protected from interception, interference or damage.",
                 "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter"
              ]
          },
          {
            "ref": "A.11.2.4",
            "title": "Equipment maintenance",
            "summary": "Equipment shall be correctly maintained to ensure its continued availability and integrity.",
              "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter",
              "cp-mdm-disposal",
              "cp-asset-physical"
              ]
          },
          {
            "ref": "A.11.2.5",
            "title": "Removal of assets",
            "summary": "Equipment, information or software shall not be taken off-site without prior authorization.",
              "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter",
              "cp-mdm-disposal",
              "cp-asset-physical"
              ]
          },
          {
            "ref": "A.11.2.6",
            "title": "Security of equipment and assets off-premises",
            "summary": "Security shall be applied to off-site assets taking into account the different risks of working outside the organization’s premises.",
                "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter",
              "cp-mdm-disposal",
              "cp-asset-physical"
              ]
          },
          {
            "ref": "A.11.2.7",
            "title": "Secure disposal or re-use of equipment",
            "summary": "All items of equipment containing storage media shall be verified to ensure that any sensitive data and licensed software has been removed or securely overwritten prior to disposal or re-use.",
                "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter"
              ]
          },
          {
            "ref": "A.11.2.8",
            "title": "Unattended user equipment",
            "summary": "Users shall ensure that unattended equipment has appropriate protection.",
               "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter"
              ]
          },
          {
            "ref": "A.11.2.9",
            "title": "Clear desk and clear screen policy",
            "summary": "A clear desk policy for papers and removable storage media and a clear screen policy for information processing facilities shall be adopted.",
                "mappedControls" : [
              "cp-physical",
              "cp-physical-datacenter"
              ]
          }
        ]
      },
      {
        "title": "A.12 - Operations security",
        "controls": [
          {
            "ref": "A.12.1.1",
            "title": "Documented operating procedures",
            "summary": "Operating procedures shall be documented and made available to all users who need them.",
                "mappedControls" : [
               "cp-policy-mgmt",
               "cp-ism-policies"
              ]
          },
          {
            "ref": "A.12.1.2",
            "title": "Change management",
            "summary": "Changes to the organization, business processes, information pro- cessing facilities and systems that affect information security shall be controlled.",
                "mappedControls" : [
                "cp-ccm-config"
                ]
          },
          {
            "ref": "A.12.1.3",
            "title": "Capacity management",
            "summary": "The use of resources shall be monitored, tuned and projections made of future capacity requirements to ensure the required system performance.",
                 "mappedControls" : [
              "cp-model-architecture"
              ]
          },
          {
            "ref": "A.12.1.4",
            "title": "Separation of development, testing and operational environments",
            "summary": "Development, testing, and operational environments shall be separated to reduce the risks of unauthorized access or changes to the operational environment.",
                "mappedControls" : [
                "cp-sdlc-dev"
                ]
          },
          {
            "ref": "A.12.2.1",
            "title": "Controls against malware",
            "summary": "Detection, prevention and recovery controls to protect against malware shall be implemented, combined with appropriate user awareness."
          },
          {
            "ref": "A.12.3.1",
            "title": "Information backup",
            "summary": "Backup copies of information, software and system images shall be taken and tested regularly in accordance with an agreed backup policy.",
                "mappedControls" : [
              "cp-data-backup"
              ]
          },
          {
            "ref": "A.12.4.1",
            "title": "Event logging",
            "summary": "Event logs recording user activities, exceptions, faults and infor- mation security events shall be produced, kept and regularly reviewed.",
                "mappedControls" : [
                "cp-audit-types",
              "cp-audit-trails",
              "cp-audit-trails-integrity"
              ]
          },
          {
            "ref": "A.12.4.2",
            "title": "Protection of log information",
            "summary": "Logging facilities and log information shall be protected against tampering and unauthorized access.",
                "mappedControls" : [
              "cp-audit-types",
                "cp-audit-trails",
              "cp-audit-trails-integrity"
              ]
          },
          {
            "ref": "A.12.4.3",
            "title": "Administrator and operator logs",
            "summary": "System administrator and system operator activities shall be logged and the logs protected and regularly reviewed.",
                 "mappedControls" : [
                "cp-audit-types",
                "cp-audit-trails",
              "cp-audit-trails-integrity",
              "cp-access-privileged"
              ]
          },
          {
            "ref": "A.12.4.4",
            "title": "Clock synchronisation",
            "summary": "The clocks of all relevant information processing systems within an organization or security domain shall be synchronised to a single reference time source.",
                "mappedControls" : [
              "cp-audit-trails",
              "cp-audit-trails-integrity"
              ]
          },
          {
            "ref": "A.12.5.1",
            "title": "Installation of software on operational systems",
            "summary": "Procedures shall be implemented to control the installation of software on operational systems.",
                 "mappedControls" : [
              "cp-ccm-provision-prod",
              "cp-ccm-provision-server"
              ]
          },
          {
            "ref": "A.12.6.1",
            "title": "Management of technical vulnerabilities",
            "summary": "Information about technical vulnerabilities of information systems being used shall be obtained in a timely fashion, the organization’s exposure to such vulnerabilities evaluated and appropriate measures taken to address the associated risk.",
                 "mappedControls" : [
              "cp-vuln-remediation",
              "cp-sdlc-pentest",
              "cp-vuln-scan"
              ]
          },
          {
            "ref": "A.12.6.2",
            "title": "Restrictions on software installation",
            "summary": "Rules governing the installation of software by users shall be established and implemented.",
                "mappedControls" : [
              "cp-ccm-provision-prod",
              "cp-ccm-provision-server"
              ]
          },
          {
            "ref": "A.12.7.1",
            "title": "Information systems audit controls",
            "summary": "Audit requirements and activities involving verification of opera- tional systems shall be carefully planned and agreed to minimise disruptions to business processes.",
                 "mappedControls" : [
                "cp-audit-trails",
              "cp-audit-trails-integrity",
              "cp-access-phi"
              ]
          }
        ]
      },
      {
        "title": "A.13 - Communications security",
        "controls": [
          {
            "ref": "A.13.1.1",
            "title": "Network controls",
            "summary": "Networks shall be managed and controlled to protect information in systems and applications.",
                "mappedControls" : [
                "cp-ccm-network"
                ]
          },
          {
            "ref": "A.13.1.2",
            "title": "Security of network services",
            "summary": "Security mechanisms, service levels and management requirements of all network services shall be identified and included in network services agreements, whether these services are provided in-house or outsourced.",
                "mappedControls" : [
                "cp-ccm-network"
                ]
          },
          {
            "ref": "A.13.1.3",
            "title": "Segregation in networks",
            "summary": "Groups of information services, users and information systems shall be segregated on networks.",
              "mappedControls" : [
              "cp-ccm-aws"
              ]
          },
          {
            "ref": "A.13.2.1",
            "title": "Information transfer policies and procedures",
            "summary": "Formal transfer policies, procedures and controls shall be in place to protect the transfer of information through the use of all types of communication facilities.",
                 "mappedControls" : [
                 "cp-data-protection-in-transit",
                 "cp-mdm-usb",
                "cp-employee-acceptable-use"
                ]
          },
          {
            "ref": "A.13.2.2",
            "title": "Agreements on information transfer",
            "summary": "Agreements shall address the secure transfer of business information between the organization and external parties.",
                "mappedControls" : [
                "cp-vendor-contracts"
              ]
          },
          {
            "ref": "A.13.2.3",
            "title": "Electronic messaging",
            "summary": "Information involved in electronic messaging shall be appropriately protected.",
              "mappedControls" : [
              "cp-employee-acceptable-use",
              "cp-access-endpoints"
              ]
          },
          {
            "ref": "A.13.2.4",
            "title": "Confidentiality or non- disclosure agreements",
            "summary": "Requirements for confidentiality or non-disclosure agreements reflecting the organization’s needs for the protection of information shall be identified, regularly reviewed and documented.",
               "mappedControls" : [
              "cp-employee-acceptable-use"
              ]
          }
        ]
      },
      {
        "title": "A.14 - System acquisition, development and maintenance",
        "controls": [
          {
            "ref": "A.14.1.1",
            "title": "Information security requirements analysis and specification",
            "summary": "The information security related requirements shall be included in the requirements for new information systems or enhancements to existing information systems.",
                "mappedControls" : [
              "cp-vendor-ssa",
              "cp-sdlc-appsec-req",
              "cp-sdlc-design"
              ]
          },
          {
            "ref": "A.14.1.2",
            "title": "Securing application services on public networks",
            "summary": "Information involved in application services passing over public networks shall be protected from fraudulent activity, contract dispute and unauthorized disclosure and modification.",
                "mappedControls" : [
              "cp-data-protection-in-transit",
              "cp-threat-webapp",
              "cp-threat-nids",
              "cp-threat-firewall"
              ]
          },
          {
            "ref": "A.14.1.3",
            "title": "Protecting application services transactions",
            "summary": "Information involved in application service transactions shall be protected to prevent incomplete transmission, mis-routing, unauthorized message alteration, unauthorized disclosure, unauthorized message duplication or replay.",
                "mappedControls" : [
                "cp-threat-firewall",
                "cp-threat-nids",
                "cp-threat-webapp",
                "cp-data-protection-in-transit"
                ]
          },
          {
            "ref": "A.14.2.1",
            "title": "Secure development policy",
            "summary": "Rules for the development of software and systems shall be established and applied to developments within the organization.",
                "mappedControls" : [
                "cp-sdlc-dev"
                ]
          },
          {
            "ref": "A.14.2.2",
            "title": "System change control procedures",
            "summary": "Changes to systems within the development lifecycle shall be controlled by the use of formal change control procedures.",
               "mappedControls" : [
                "cp-ccm-config",
                "cp-sdlc-dev",
                "cp-sdlc-scm"
                ]
          },
          {
            "ref": "A.14.2.3",
            "title": "Technical review of applications after operating platform changes",
            "summary": "When operating platforms are changed, business critical applications shall be reviewed and tested to ensure there is no adverse impact on organizational operations or security.",
                "mappedControls" : [
                "cp-ccm-config"
                ]
          },
          {
            "ref": "A.14.2.4",
            "title": "Restrictions on changes to software packages",
            "summary": "Modifications to software packages shall be discouraged, limited to necessary changes and all changes shall be strictly controlled.",
                  "mappedControls" : [
              "cp-sdlc-dev",
              "cp-sdlc-scm",
              "cp-sdlc-foss"
              ]
          },
          {
            "ref": "A.14.2.5",
            "title": "Secure system engineering principles",
            "summary": "Principles for engineering secure systems shall be established, documented, maintained and applied to any information system implementation efforts.",
                "mappedControls" : [
              "cp-sdlc-appsec-req",
              "cp-sdlc-design"
              ]
          },
          {
            "ref": "A.14.2.6",
            "title": "Secure development environment",
            "summary": "Organizations shall establish and appropriately protect secure development environments for system development and integration efforts that cover the entire system development lifecycle.",
                "mappedControls" : [
                "cp-sdlc-dev"
                ]
          },
          {
            "ref": "A.14.2.7",
            "title": "Outsourced development",
            "summary": "The organization shall supervise and monitor the activity of out-sourced system development.",
               "mappedControls" : [
               "cp-sdlc-outsourcing"
               ]
          },
          {
            "ref": "A.14.2.8",
            "title": "System security testing",
            "summary": "Testing of security functionality shall be carried out during development.",
                "mappedControls" : [
                "cp-sdlc-sast",
                "cp-sdlc-dast",
                "cp-sdlc-pentest",
                "cp-vuln-scan"
                ]
          },
          {
            "ref": "A.14.2.9",
            "title": "System acceptance testing",
            "summary": "Acceptance testing programs and related criteria shall be established for new information systems, upgrades and new versions.",
                 "mappedControls" : [
                 "cp-sdlc-sast",
                "cp-sdlc-dast",
                "cp-ccm-config",
                "cp-sdlc-dev" 
                ]
          },
          {
            "ref": "A.14.3.1",
            "title": "Protection of test data",
            "summary": "Test data shall be selected carefully, protected and controlled.",
                "mappedControls" : [
              "cp-data-protection-at-rest",
              "cp-data-protection-in-use",
              "cp-data-protection-integrity",
              "cp-data-protection-in-transit"
              ]
          }
        ]
      },
      {
        "title": "A.15 - Supplier relationships",
        "controls": [
          {
            "ref": "A.15.1.1",
            "title": "Information security policy for supplier relationships",
            "summary": "Information security requirements for mitigating the risks associated with supplier’s access to the organization’s assets shall be agreed with the supplier and documented.",
                "mappedControls" : [
                "cp-vendor-vtr"
                ]
          },
          {
            "ref": "A.15.1.2",
            "title": "Addressing security within supplier agreements",
            "summary": "All relevant information security requirements shall be established and agreed with each supplier that may access, process, store, communicate, or provide IT infrastructure components for, the organization’s information.",
                "mappedControls" : [
                "cp-vendor-vtr"
                ]
          },
          {
            "ref": "A.15.1.3",
            "title": "Information and communication technology supply chain",
            "summary": "Agreements with suppliers shall include requirements to address the information security risks associated with information and communications technology services and product supply chain.",
                "mappedControls" : [
                "cp-vendor-contracts"
                ]
          },
          {
            "ref": "A.15.2.1",
            "title": "Monitoring and review of supplier services",
            "summary": "Organizations shall regularly monitor, review and audit supplier service delivery.",
                 "mappedControls" : [
                 "cp-vendor-monitor"
                 ]
          },
          {
            "ref": "A.15.2.2",
            "title": "Managing changes to supplier services",
            "summary": "Changes to the provision of services by suppliers, including maintaining and improving existing information security policies, procedures and controls, shall be managed, taking account of the criticality of business information, systems and processes involved and re-assessment of risks.",
                "mappedControls" : [
                "cp-vendor-vtr"
                ]
          }
        ]
      },
      {
        "title": "A.16 - Information security incident management",
        "controls": [
          {
            "ref": "A.16.1.1",
            "title": "Responsibilities and procedures",
            "summary": "Management responsibilities and procedures shall be established to ensure a quick, effective and orderly response to information security incidents.",
                 "mappedControls" : [
                "cp-ir-process",
                "cp-ir-sirt"
                ]
          },
          {
            "ref": "A.16.1.2",
            "title": "Reporting information security events",
            "summary": "Information security events shall be reported through appropriate management channels as quickly as possible.",
               "mappedControls" : [
               "cp-ir-process"
               ]
          },
          {
            "ref": "A.16.1.3",
            "title": "Reporting information security weaknesses",
            "summary": "Employees and contractors using the organization’s information systems and services shall be required to note and report any observed or suspected information security weaknesses in systems or services.",
                     "mappedControls" : [
                     "cp-employee-escalation",
                     "cp-employee-whistleblower"
                     ]
          },
          {
            "ref": "A.16.1.4",
            "title": "Assessment of and decision on information security events",
            "summary": "Information security events shall be assessed and it shall be decided if they are to be classified as information security incidents.",
                  "mappedControls" : [
                  "cp-ir-process"
                  ]
          },
          {
            "ref": "A.16.1.5",
            "title": "Response to information security incidents",
            "summary": "Information security incidents shall be responded to in accordance with the documented procedures.",
                    "mappedControls" : [
                    "cp-ir-process",
                    "cp-ir-playbook"
                    ]
          },
          {
            "ref": "A.16.1.6",
            "title": "Learning from information security incidents",
            "summary": "Knowledge gained from analysing and resolving information secu- rity incidents shall be used to reduce the likelihood or impact of future incidents.",
                  "mappedControls" : [
                  "cp-ir-process",
                  "cp-ir-tabletop"
                  ]
          },
          {
            "ref": "A.16.1.7",
            "title": "Collection of evidence",
            "summary": "The organization shall define and apply procedures for the iden- tification, collection, acquisition and preservation of information, which can serve as evidence.",
                 "mappedControls" : [
                 "cp-ir-records"
                 ]
          }
        ]
      },
      {
        "title": "A.17 - Information security aspects of business continuity management",
        "controls": [
          {
            "ref": "A.17.1.1",
            "title": "Planning information security continuity",
            "summary": "The organization shall determine its requirements for information security and the continuity of information security management in adverse situations, e.g. during a crisis or disaster.",
                 "mappedControls" : [
                 "cp-bcdr",
                "cp-bcdr-recovery"
                ]
          },
          {
            "ref": "A.17.1.2",
            "title": "Implementing information security continuity",
            "summary": "The organization shall establish, document, implement and main- tain processes, procedures and controls to ensure the required level of continuity for information security during an adverse situation.",
                "mappedControls" : [
              "cp-bcdr-recovery"
              ]
          },
          {
            "ref": "A.17.1.3",
            "title": "Verify, review and evaluate information security continuity",
            "summary": "The organization shall verify the established and implemented information security continuity controls at regular intervals in order to ensure that they are valid and effective during adverse situations.",
                 "mappedControls" : [
                 "cp-bcdr-test"
                 ]
          },
          {
            "ref": "A.17.2.1",
            "title": "Availability of information processing facilities",
            "summary": "Information processing facilities shall be implemented with redundancy sufficient to meet availability requirements.",
               "mappedControls" : [
              "cp-bcdr-data",
              "cp-bcdr-site"
              ]
          }
        ]
      },  
      {
        "title": "A.18 - Compliance",
        "controls": [
          {
            "ref": "A.18.1.1",
            "title": "Identification of applicable legislation and contractual requirements",
            "summary": "All relevant legislative statutory, regulatory, contractual require- ments and the organization’s approach to meet these requirements shall be explicitly identified, documented and kept up to date for each information system and the organization.",
                   "mappedControls" : [
                    "cp-compliance-monitor"
                    ]
          },
          {
            "ref": "A.18.1.2",
            "title": "Intellectual property rights",
            "summary": "Appropriate procedures shall be implemented to ensure compli- ance with legislative, regulatory and contractual requirements related to intellectual property rights and use of proprietary software products.",
                 "mappedControls" : [
              "cp-compliance-mgmt"
              ]
          },
          {
            "ref": "A.18.1.3",
            "title": "Protection of records",
            "summary": "Records shall be protected from loss, destruction, falsification, unauthorized access and unauthorized release, in accordance with legislatory, regulatory, contractual and business requirements.",
                "mappedControls" : [
                "cp-data-protection",
              "cp-data-protection-at-rest",
              "cp-data-protection-in-transit",
              "cp-data-protection-in-use",
              "cp-data-protection-kms",
              "cp-data-protection-cert",
              "cp-data-protection-integrity"
              ]
          },
          {
            "ref": "A.18.1.4",
            "title": "Privacy and protection of personally identifiable information",
            "summary": "Privacy and protection of personally identifiable information shall be ensured as required in relevant legislation and regulation where applicable.",
                 "mappedControls" : [ 
                "cp-privacy-notices",
                "ref-privacy-policy"
                ]
          },
          {
            "ref": "A.18.1.5",
            "title": "Regulation of cryptographic controls",
            "summary": "Cryptographic controls shall be used in compliance with all relevant agreements, legislation and regulations.",
               "mappedControls" : [ 
               "cp-data-protection",
               "cp-data-protection-at-rest",
               "cp-data-protection-in-transit",
               "cp-data-protection-in-use"
               ]
          },
          {
            "ref": "A.18.2.1",
            "title": "Independent review of information security",
            "summary": "The organization’s approach to managing information security and its implementation (i.e. control objectives, controls, policies, pro- cesses and procedures for information security) shall be reviewed independently at planned intervals or when significant changes occur.",
                "mappedControls" : [ 
                "cp-compliance-requests"
                ]
          },
          {
            "ref": "A.18.2.2",
            "title": "Compliance with security policies and standards",
            "summary": "Managers shall regularly review the compliance of information processing and procedures within their area of responsibility with the appropriate security policies, standards and any other security requirements.",
                "mappedControls" : [ 
                "cp-compliance-monitor",
                "cp-ccm-monitor",
                "cp-sdlc-monitor",
                "cp-audit-control-deficiency"
                ]
          },
          {
            "ref": "A.18.2.3",
            "title": "Technical compliance review",
            "summary": "Information systems shall be regularly reviewed for compliance with the organization’s information security policies and standards.",
                 "mappedControls" : [ 
                 "cp-compliance-requests",
                 "cp-audit-types",
                 "cp-audit-review"
                 ]
          }
        ]
      }
    ]
  }