{
  "standard": "THSA",
  "version": "2019.1",
  "type": "questionnaire",
  "webLink": "https://www.together.health/security-assessment",
  "domains": [
    {
      "title": "Security & Privacy Governance",
      "controls": [
        {
          "ref": "GOV-01",
          "title": "Security & Privacy Governance Program",
          "summary": "Does the organization staff a function to centrally-govern cybersecurity and privacy controls?"
        },
        {
          "ref": "GOV-02",
          "title": "Publishing Security Policies",
          "summary": "Does the organization establish, maintain and disseminate cybersecurity and privacy policies, standards and procedures?"
        },
        {
          "ref": "GOV-03",
          "title": "Periodic Review & Update of Security Documentation",
          "summary": "Does the organization review cybersecurity and privacy policies, standards and procedures at planned intervals or if significant changes occur to ensure their continuing suitability, adequacy and effectiveness?"
        },
        {
          "ref": "GOV-04",
          "title": "Assigned Security Responsibilities",
          "summary": "Does the organization assign a qualified individual with the mission and resources to centrally-manage coordinate, develop, implement and maintain an enterprise-wide cybersecurity and privacy program?"
        },
        {
          "ref": "GOV-05",
          "title": "Measures of Performance",
          "summary": "Does the organization develop, report and monitor cybersecurity and privacy program measures of performance?"
        },
        {
          "ref": "GOV-06",
          "title": "Contacts With Authorities",
          "summary": "Does the organization identify and document appropriate contacts within relevant law enforcement and regulatory bodies?"
        },
        {
          "ref": "GOV-07",
          "title": "Contacts With Groups & Associations",
          "summary": "Does the organization establish contact with selected groups and associations within the cybersecurity & privacy communities to: \n ▪ Facilitate ongoing cybersecurity and privacy education and training for organizational personnel;\n ▪ Maintain currency with recommended cybersecurity and privacy practices, techniques and technologies; and\n ▪ Share current security-related information including threats, vulnerabilities and incidents?"
        }
      ]
    },
    {
      "title": "Asset Management",
      "controls": [
        {
          "ref": "AST-01",
          "title": "Asset Governance",
          "summary": "Does the organization facilitate the implementation of asset management controls?"
        },
        {
          "ref": "AST-02",
          "title": "Asset Inventories",
          "summary": "Does the organization inventory system components that:\n ▪ Accurately reflects the current system; \n ▪ Is at the level of granularity deemed necessary for tracking and reporting;\n ▪ Includes organization-defined information deemed necessary to achieve effective property accountability; and\n ▪ Is available for review and audit by designated organizational officials?\n"
        },
        {
          "ref": "AST-02.1",
          "title": "Updates During Installations / Removals",
          "summary": "Does the organization update asset inventories as part of component installations, removals and asset upgrades?"
        },
        {
          "ref": "AST-04",
          "title": "Network Diagrams & Data Flow Diagrams (DFDs)",
          "summary": "Does the organization maintain network architecture diagrams that: \n ▪ Contain sufficient detail to assess the security of the network's architecture;\n ▪ Reflect the current state of the network environment; and\n ▪ Document all sensitive data flows?"
        },
        {
          "ref": "AST-09",
          "title": "Secure Disposal or Re-Use of Equipment",
          "summary": "Does the organization securely destroy media when it is no longer needed for business or legal reasons?"
        },
        {
          "ref": "AST-11",
          "title": "Removal of Assets",
          "summary": "Does the organization authorize, control and track systems entering and exiting organizational facilities?"
        }
      ]
    },
    {
      "title": "Business Continuity & Disaster Recovery",
      "controls": [
        {
          "ref": "BCD-01",
          "title": "Contingency Plan",
          "summary": "Does the organization facilitate the implementation of contingency planning controls?"
        },
        {
          "ref": "BCD-02",
          "title": "Identify Critical Assets",
          "summary": "Does the organization identify and document the critical systems, applications and services that support essential missions and business functions?"
        },
        {
          "ref": "BCD-03.1",
          "title": "Simulated Events",
          "summary": "Does the organization incorporate simulated events into contingency training to facilitate effective response by personnel in crisis situations?"
        },
        {
          "ref": "BCD-04",
          "title": "Contingency Plan Testing & Exercises",
          "summary": "Does the organization conduct tests and/or exercises to determine the contingency plan's effectiveness and the organization’s readiness to execute the plan?"
        },
        {
          "ref": "BCD-05",
          "title": "Contingency Plan Root Cause Analysis (RCA) & Lessons Learned",
          "summary": "Does the organization conduct a Root Cause Analysis (RCA) and \"lessons learned\" activity every time the contingency plan is activated?"
        },
        {
          "ref": "BCD-06",
          "title": "Contingency Plan Update",
          "summary": "Does the organization keep contingency plans current with business needs and technology changes?"
        },
        {
          "ref": "BCD-08",
          "title": "Alternate Storage Site",
          "summary": "Does the organization establish an alternate storage site that includes both the assets and necessary agreements to permit the storage and recovery of system backup information?"
        },
        {
          "ref": "BCD-09",
          "title": "Alternate Processing Site",
          "summary": "Does the organization establish an alternate processing site that provides security measures equivalent to that of the primary site?"
        },
        {
          "ref": "BCD-09.2",
          "title": "Accessibility",
          "summary": "Does the organization identify potential accessibility problems to the alternate processing site and possible mitigation actions, in the event of an area-wide disruption or disaster?"
        },
        {
          "ref": "BCD-11",
          "title": "Data Backups",
          "summary": "Does the organization create recurring backups of data, software and system images to ensure the availability of the data?"
        },
        {
          "ref": "BCD-12",
          "title": "Information System Recovery & Reconstitution",
          "summary": "Does the organization ensure the recovery and reconstitution of systems to a known state after a disruption, compromise or failure?"
        }
      ]
    },
    {
      "title": "Capacity & Performance Planning",
      "controls": [
        {
          "ref": "CAP-01",
          "title": "Capacity & Performance Management",
          "summary": "Does the organization facilitate the implementation of capacity management controls to ensure optimal system performance for future capacity requirements?"
        }
      ]
    },
    {
      "title": "Change Management",
      "controls": [
        {
          "ref": "CHG-02",
          "title": "Configuration Change Control",
          "summary": "Does the organization govern the technical configuration change control processes?"
        }
      ]
    },
    {
      "title": "Compliance",
      "controls": [
        {
          "ref": "CPL-01",
          "title": "Statutory, Regulatory & Contractual Compliance",
          "summary": "Does the organization facilitate the implementation of relevant legislative statutory, regulatory and contractual controls?"
        },
        {
          "ref": "CPL-02",
          "title": "Security Controls Oversight",
          "summary": "Does the organization provide a security controls oversight function?"
        },
        {
          "ref": "CPL-03",
          "title": "Security Assessments",
          "summary": "Does the organization ensure managers regularly review the processes and documented procedures within their area of responsibility to adhere to appropriate security policies, standards and other applicable requirements?"
        }
      ]
    },
    {
      "title": "Configuration Management",
      "controls": [
        {
          "ref": "CFG-01",
          "title": "Configuration Management Program",
          "summary": "Does the organization facilitate the implementation of configuration management controls?"
        },
        {
          "ref": "CFG-02",
          "title": "System Hardening Through Baseline Configurations",
          "summary": "Does the organization develop, document and maintain secure baseline configurations for technology platform that are consistent with industry-accepted system hardening standards?"
        },
        {
          "ref": "CFG-02.9",
          "title": "Baseline Tailoring",
          "summary": "Does the organization allow baseline controls to be specialized or customized by applying a defined set of tailoring actions that are specific to:\n ▪ Mission / business functions;\n ▪ Operational environment;\n ▪ Specific threats or vulnerabilities; or\n ▪ Other conditions or situations that could affect mission / business success?"
        },
        {
          "ref": "CFG-03",
          "title": "Least Functionality",
          "summary": "Does the organization configure systems to provide only essential capabilities by specifically prohibiting or restricting the use of ports, protocols, and/or services?"
        },
        {
          "ref": "CFG-03.3",
          "title": "Unauthorized or Authorized Software (Blacklisting or Whitelisting)",
          "summary": "Does the organization whitelist or blacklist applications in an order to limit what is authorized to execute on systems?"
        },
        {
          "ref": "CFG-04.2",
          "title": "Unsupported Internet Browsers & Email Clients",
          "summary": "Does the organization allow only approved Internet browsers and email clients to run on systems?"
        },
        {
          "ref": "CFG-05",
          "title": "User-Installed Software",
          "summary": "Does the organization restrict the ability of non-privileged users to install unauthorized software?"
        }
      ]
    },
    {
      "title": "Monitoring",
      "controls": [
        {
          "ref": "MON-01",
          "title": "Continuous Monitoring",
          "summary": "Does the organization facilitate the implementation of enterprise-wide monitoring controls?"
        },
        {
          "ref": "MON-01.1",
          "title": "Intrusion Detection & Prevention Systems (IDS & IPS)",
          "summary": "Does the organization implement Intrusion Detection / Prevention Systems (IDS / IPS) technologies on critical systems, key network segments and network choke points?"
        },
        {
          "ref": "MON-01.4",
          "title": "System Generated Alerts",
          "summary": "Does the organization monitor, correlate and respond to alerts from physical, cybersecurity, privacy and supply chain activities to achieve integrated situational awareness?"
        },
        {
          "ref": "MON-01.5",
          "title": "Wireless Intrusion Detection System (WIDS)",
          "summary": "Does the organization utilize Wireless Intrusion Detection / Protection Systems (WIDS / WIPS) to identify rogue wireless devices and to detect attack attempts via wireless networks?"
        },
        {
          "ref": "MON-01.7",
          "title": "File Integrity Monitoring (FIM)",
          "summary": "Does the organization utilize a File Integrity Monitor (FIM) or similar change-detection technology on critical assets to generate alerts for unauthorized modifications?"
        },
        {
          "ref": "MON-01.8",
          "title": "Reviews & Updates",
          "summary": "Does the organization review event logs on an ongoing basis and escalate incidents in accordance with established timelines and procedures?"
        },
        {
          "ref": "MON-01.9",
          "title": "Proxy Logging",
          "summary": "Does the organization log all Internet-bound requests, in order to identify prohibited activities and assist incident handlers with identifying potentially compromised systems?"
        },
        {
          "ref": "MON-06",
          "title": "Monitoring Reporting",
          "summary": "Does the organization provide an event log report generation capability to aid in detecting and assessing anomalous activities?"
        },
        {
          "ref": "MON-16",
          "title": "Anomalous Behavior",
          "summary": "Does the organization detect and respond to anomalous behavior that could indicate account compromise or other malicious activities?"
        },
        {
          "ref": "MON-16.1",
          "title": "Insider Threats",
          "summary": "Does the organization monitor internal personnel activity for potential security incidents?"
        },
        {
          "ref": "MON-16.2",
          "title": "Third-Party Threats",
          "summary": "Does the organization monitor third-party personnel activity for potential security incidents?"
        },
        {
          "ref": "MON-16.3",
          "title": "Unauthorized Activities",
          "summary": "Does the organization monitor for unauthorized activities, accounts, connections, devices, and software?"
        }
      ]
    },
    {
      "title": "Cryptographic Protections",
      "controls": [
        {
          "ref": "CRY-01",
          "title": "Use of Cryptographic Controls",
          "summary": "Does the organization facilitate the implementation of cryptographic protections controls using known public standards and trusted cryptographic technologies?"
        },
        {
          "ref": "CRY-01.1",
          "title": "Alternate Physical Protection",
          "summary": "Are cryptographic mechanisms used to prevent unauthorized disclosure of information as an alternate to physical safeguards?"
        },
        {
          "ref": "CRY-03",
          "title": "Transmission Confidentiality",
          "summary": "Are cryptographic mechanisms utilized to protect the confidentiality of data being transmitted?"
        },
        {
          "ref": "CRY-04",
          "title": "Transmission Integrity",
          "summary": "Are cryptographic mechanisms utilized to protect the integrity of data being transmitted?"
        },
        {
          "ref": "CRY-05",
          "title": "Encrypting Data At Rest",
          "summary": "Are cryptographic mechanisms utilized on systems to prevent unauthorized disclosure of information at rest?"
        },
        {
          "ref": "CRY-05.1",
          "title": "Storage Media",
          "summary": "Are cryptographic mechanisms utilized on storage media to protect the confidentiality and integrity of the information being stored?"
        }
      ]
    },
    {
      "title": "Data Classification & Handling",
      "controls": [
        {
          "ref": "DCH-01",
          "title": "Data Protection",
          "summary": "Does the organization facilitate the implementation of data protection controls?"
        },
        {
          "ref": "DCH-01.1",
          "title": "Data Stewardship",
          "summary": "Does the organization ensure data stewardship is assigned, documented and communicated?"
        },
        {
          "ref": "DCH-02",
          "title": "Data & Asset Classification",
          "summary": "Does the organization ensure data and assets are categorized in accordance with applicable statutory, regulatory and contractual requirements?"
        },
        {
          "ref": "DCH-03.2",
          "title": "Masking Displayed Data",
          "summary": "Does the organization apply data masking to sensitive information that is displayed or printed?"
        },
        {
          "ref": "DCH-04",
          "title": "Media Marking",
          "summary": "Does the organization mark media in accordance with data protection requirements so that personnel are alerted to distribution limitations, handling caveats and applicable security requirements?"
        },
        {
          "ref": "DCH-04.1",
          "title": "Automated Marking",
          "summary": "Are automated mechanisms used to mark media and system output to indicate the distribution limitations, handling requirements and applicable security markings (if any) of the information to aide Data Loss Prevention (DLP) technologies?"
        },
        {
          "ref": "DCH-05",
          "title": "Security & Privacy Attributes",
          "summary": "Does the organization bind security attributes to information as it is stored, transmitted and processed?"
        },
        {
          "ref": "DCH-05.1",
          "title": "Dynamic Attribute Association",
          "summary": "Does the organization dynamically associate security and privacy attributes with individuals and objects as information is created, combined, or transformed, in accordance with organization-defined cybersecurity and privacy policies?"
        },
        {
          "ref": "DCH-05.2",
          "title": "Attribute Value Changes By Authorized Individuals",
          "summary": "Does the organization provide authorized individuals (or processes acting on behalf of individuals) the capability to define or change the value of associated security and privacy attributes?"
        },
        {
          "ref": "DCH-05.3",
          "title": "Maintenance of Attribute Associations By System",
          "summary": "Does the organization maintain the association and integrity of security and privacy attributes to individuals and objects?"
        },
        {
          "ref": "DCH-05.4",
          "title": "Association of Attributes By Authorized Individuals",
          "summary": "Does the organization provide the capability to associate security and privacy attributes with individuals and objects by authorized individuals (or processes acting on behalf of individuals)?"
        },
        {
          "ref": "DCH-05.5",
          "title": "Attribute Displays for Output Devices",
          "summary": "Does the organization display security and privacy attributes in human-readable form on each object that the system transmits to output devices to identify special dissemination, handling or distribution instructions using human-readable, standard naming conventions?"
        },
        {
          "ref": "DCH-05.6",
          "title": "Maintenance of Attribute Association By Organization",
          "summary": "Does the organization require personnel to associate and maintain the association of security and privacy attributes with individuals and objects in accordance with security and privacy policies?"
        },
        {
          "ref": "DCH-05.7",
          "title": "Consistent Attribute Interpretation",
          "summary": "Does the organization provide a consistent interpretation of security and privacy attributes transmitted between distributed system components?"
        },
        {
          "ref": "DCH-05.8",
          "title": "Association Techniques & Technologies",
          "summary": "Does the organization associate security and privacy attributes to information?"
        },
        {
          "ref": "DCH-05.9",
          "title": "Attribute Reassignment",
          "summary": "Does the organization re-classify data as required, due to changing business/technical requirements?"
        },
        {
          "ref": "DCH-05.10",
          "title": "Attribute Configuration By Authorized Individuals",
          "summary": "Does the organization provide authorized individuals the capability to define or change the type and value of security and privacy attributes available for association with subjects and objects?"
        },
        {
          "ref": "DCH-05.11",
          "title": "Audit Changes",
          "summary": "Does the organization audit changes to security and privacy attributes and respond to them in a timely manner?"
        },
        {
          "ref": "DCH-08",
          "title": "Physical Media Disposal",
          "summary": "Does the organization securely dispose of media when it is no longer required, using formal procedures?"
        },
        {
          "ref": "DCH-09",
          "title": "Digital Media Sanitization",
          "summary": "Does the organization sanitize media, both digital and non-digital, with the strength and integrity commensurate with the classification or sensitivity of the information prior to disposal, release out of organizational control or release for reuse?"
        },
        {
          "ref": "DCH-12",
          "title": "Removable Media Security",
          "summary": "Does the organization restrict removable media in accordance with data handling and acceptable usage parameters?"
        },
        {
          "ref": "DCH-18",
          "title": "Media & Data Retention",
          "summary": "Does the organization retain media and data in accordance with applicable statutory, regulatory and contractual obligations?"
        }
      ]
    },
    {
      "title": "Embedded Technology",
      "controls": [
        {
          "ref": "EMB-01",
          "title": "Embedded Technology Security Program",
          "summary": "Does the organization facilitate the implementation of embedded technology controls?"
        },
        {
          "ref": "EMB-02",
          "title": "Internet of Things (IOT)",
          "summary": "Does the organization proactively manage the cybersecurity and privacy risks associated with Internet of Things (IoT)?"
        },
        {
          "ref": "EMB-03",
          "title": "Operational Technology (OT)",
          "summary": "Does the organization proactively manage the cybersecurity and privacy risks associated with Operational Technology (OT)?"
        }
      ]
    },
    {
      "title": "Endpoint Security",
      "controls": [
        {
          "ref": "END-01",
          "title": "Endpoint  Security",
          "summary": "Does the organization facilitate the implementation of endpoint security controls?"
        },
        {
          "ref": "END-02",
          "title": "Endpoint Protection Measures",
          "summary": "Does the organization protect the confidentiality, integrity, availability and safety of endpoint devices?"
        },
        {
          "ref": "END-03",
          "title": "Prohibit Installation Without Privileged Status",
          "summary": "Does the organization prohibit user installation of software without explicitly assigned privileged status?"
        },
        {
          "ref": "END-04",
          "title": "Malicious Code Protection (Anti-Malware)",
          "summary": "Does the organization utilize antimalware technologies to detect and eradicate malicious code?"
        },
        {
          "ref": "END-04.1",
          "title": "Automatic Updates",
          "summary": "Does the organization automatically update antimalware technologies, including signature definitions?"
        },
        {
          "ref": "END-06",
          "title": "File Integrity Monitoring (FIM)",
          "summary": "Does the organization utilize File Integrity Monitor (FIM) technology to detect and report unauthorized changes to system files and configurations?"
        },
        {
          "ref": "END-08",
          "title": "Phishing & Spam Protection",
          "summary": "Does the organization utilize anti-phishing and spam protection technologies to detect and take action on unsolicited messages transported by electronic mail?"
        },
        {
          "ref": "END-08.1",
          "title": "Central Management",
          "summary": "Does the organization centrally-manage anti-phishing and spam protection technologies?"
        },
        {
          "ref": "END-08.2",
          "title": "Automatic Updates",
          "summary": "Does the organization automatically update anti-phishing and spam protection technologies when new releases are available in accordance with configuration and change management practices?"
        },
        {
          "ref": "END-10",
          "title": "Mobile Code",
          "summary": "Does the organization address mobile code / operating system-independent applications?"
        }
      ]
    },
    {
      "title": "Human Resources Security",
      "controls": [
        {
          "ref": "HRS-01",
          "title": "Human Resources Security Management",
          "summary": "Does the organization facilitate the implementation of personnel security controls?"
        },
        {
          "ref": "HRS-03",
          "title": "Roles & Responsibilities",
          "summary": "Does the organization define cybersecurity responsibilities for all personnel?"
        },
        {
          "ref": "HRS-05.1",
          "title": "Rules of Behavior",
          "summary": "Does the organization define acceptable and unacceptable rules of behavior for the use of technologies, including consequences for unacceptable behavior?"
        },
        {
          "ref": "HRS-07",
          "title": "Personnel Sanctions",
          "summary": "Does the organization sanction personnel failing to comply with established security policies, standards and procedures?"
        }
      ]
    },
    {
      "title": "Identification & Authentication",
      "controls": [
        {
          "ref": "IAC-01",
          "title": "Identity & Access Management (IAM)",
          "summary": "Does the organization facilitate the implementation of identification and access management controls?"
        },
        {
          "ref": "IAC-02",
          "title": "Identification & Authentication for Organizational Users",
          "summary": "Does the organization uniquely identify and authenticate organizational users and processes acting on behalf of organizational users?"
        },
        {
          "ref": "IAC-04",
          "title": "Identification & Authentication for Devices",
          "summary": "Does the organization uniquely identify and authenticate devices before establishing a connection?"
        },
        {
          "ref": "IAC-06",
          "title": "Multi-Factor Authentication (MFA)",
          "summary": "Does the organization require Multi-Factor Authentication (MFA) for remote network access?"
        },
        {
          "ref": "IAC-06.2",
          "title": "Network Access to Non-Privileged Accounts",
          "summary": "Does the organization utilize Multi-Factor Authentication (MFA) to authenticate network access for non-privileged accounts?"
        },
        {
          "ref": "IAC-07",
          "title": "User Provisioning & De-Provisioning",
          "summary": "Does the organization utilize a formal user registration and de-registration process that governs the assignment of access rights?"
        },
        {
          "ref": "IAC-07.1",
          "title": "Change of Roles & Duties",
          "summary": "Does the organization revoke user access rights following changes in personnel roles and duties, if no longer necessary or permitted?"
        },
        {
          "ref": "IAC-07.2",
          "title": "Termination of Employment",
          "summary": "Does the organization revoke user access rights in a timely manner, upon termination of employment or contract?"
        },
        {
          "ref": "IAC-08",
          "title": "Role-Based Access Control (RBAC)",
          "summary": "Does the organization enforce a Role-Based Access Control (RBAC) policy over users and resources?"
        },
        {
          "ref": "IAC-09",
          "title": "Identifier Management (User Names)",
          "summary": "Does the organization govern naming standards for usernames and systems?"
        },
        {
          "ref": "IAC-10",
          "title": "Authenticator Management (Passwords)",
          "summary": "Does the organization securely manage passwords for users and devices?"
        },
        {
          "ref": "IAC-10.1",
          "title": "Password-Based Authentication",
          "summary": "For password-based authentication, does the organization enforce password complexity to ensure strong passwords?"
        },
        {
          "ref": "IAC-10.8",
          "title": "Vendor-Supplied Defaults",
          "summary": "Does the organization ensure vendor-supplied defaults are changed as part of the installation process?"
        },
        {
          "ref": "IAC-15",
          "title": "Account Management",
          "summary": "Does the organization proactively govern account management of individual, group, system, application, guest and temporary accounts?"
        },
        {
          "ref": "IAC-15.2",
          "title": "Removal of Temporary / Emergency Accounts",
          "summary": "Are automated mechanisms used to disable or remove temporary and emergency accounts after an organization-defined time period for each type of account?"
        },
        {
          "ref": "IAC-16",
          "title": "Privileged Account Management (PAM)",
          "summary": "Does the organization restrict and control privileged access rights for users and services?"
        },
        {
          "ref": "IAC-21",
          "title": "Least Privilege",
          "summary": "Does the organization utilize the concept of least privilege, allowing only authorized access to processes necessary to accomplish assigned tasks in accordance with organizational business functions?"
        },
        {
          "ref": "IAC-22",
          "title": "Account Lockout",
          "summary": "Does the organization enforce a limit for consecutive invalid login attempts by a user during an organization-defined time period and automatically locks the account when the maximum number of unsuccessful attempts is exceeded?"
        },
        {
          "ref": "IAC-24",
          "title": "Session Lock",
          "summary": "Does the organization initiate a session lock after an organization-defined time period of inactivity, or upon receiving a request from a user, and retain the session lock until the user reestablishes access using established identification and authentication methods?"
        },
        {
          "ref": "IAC-25",
          "title": "Session Termination",
          "summary": "Are automated mechanisms used to log out users, both locally on the network and for remote sessions, at the end of the session or after an organization-defined period of inactivity?"
        },
        {
          "ref": "IAC-28",
          "title": "Identity Proofing",
          "summary": "Does the organization collect, validate and verify identity evidence of a user?"
        },
        {
          "ref": "IAC-28.1",
          "title": "Supervisor Authorization",
          "summary": "Does the organization require the registration process to receive supervisor or sponsor authorization for new accounts?"
        },
        {
          "ref": "IAC-28.2",
          "title": "Identity Evidence",
          "summary": "Does the organization require evidence of individual identification to be presented to the registration authority?"
        },
        {
          "ref": "IAC-28.3",
          "title": "Identity Evidence Validation & Verification",
          "summary": "Does the organization require that the presented identity evidence be validated and verified through organizational-defined methods of validation and verification?"
        }
      ]
    },
    {
      "title": "Incident Response",
      "controls": [
        {
          "ref": "IRO-01",
          "title": "Management of Security Incidents",
          "summary": "Does the organization facilitate the implementation of incident response controls?"
        },
        {
          "ref": "IRO-02",
          "title": "Incident Handling",
          "summary": "Doe incident handling processes cover preparation, detection and analysis, containment, eradication and recovery?"
        },
        {
          "ref": "IRO-03",
          "title": "Indicators of Compromise (IOC)",
          "summary": "Does the organization define specific Indicators of Compromise (IOC) that identify the potential impact of likely cybersecurity events?"
        },
        {
          "ref": "IRO-04",
          "title": "Incident Response Plan (IRP)",
          "summary": "Does the organization maintain and make available a current and viable Incident Response Plan (IRP) to all stakeholders?"
        },
        {
          "ref": "IRO-04.2",
          "title": "IRP Update",
          "summary": "Does the organization regularly update incident response strategies to keep current with business needs, technology changes and regulatory requirements?"
        },
        {
          "ref": "IRO-06.1",
          "title": "Coordination with Related Plans",
          "summary": "Does the organization coordinate incident response testing with organizational elements responsible for related plans?"
        },
        {
          "ref": "IRO-07",
          "title": "Integrated Security Incident Response Team (ISIRT)",
          "summary": "Does the organization establish an integrated team of cybersecurity, IT and business function representatives that are capable of addressing cybersecurity and privacy incident response operations?"
        },
        {
          "ref": "IRO-08",
          "title": "Chain of Custody & Forensics",
          "summary": "Does the organization perform digital forensics and maintain the integrity of the chain of custody?"
        },
        {
          "ref": "IRO-09",
          "title": "Incident Monitoring & Tracking",
          "summary": "Does the organization document, monitor and report cybersecurity and privacy incidents?"
        },
        {
          "ref": "IRO-10",
          "title": "Incident Reporting",
          "summary": "Does the organization report incidents:\n ▪ Internally to organizational incident response personnel within organization-defined time-periods; and\n ▪ Externally to regulatory authorities and affected parties, as necessary?"
        },
        {
          "ref": "IRO-10.2",
          "title": "Cyber Incident Reporting for Sensitive Data",
          "summary": "Does the organization report sensitive data incidents in a timely manner?"
        },
        {
          "ref": "IRO-10.4",
          "title": "Supply Chain Coordination",
          "summary": "Does the organization provide security and privacy incident information to the provider of the product or service and other organizations involved in the supply chain for systems or system components related to the incident?"
        },
        {
          "ref": "IRO-11.2",
          "title": "Coordination With External Providers",
          "summary": "Does the organization establish a direct, cooperative relationship between the organization's incident response capability and external service providers?"
        },
        {
          "ref": "IRO-13",
          "title": "Root Cause Analysis (RCA) & Lessons Learned",
          "summary": "Does the organization incorporate lessons learned from analyzing and resolving cybersecurity and privacy incidents to reduce the likelihood or impact of future incidents?"
        },
        {
          "ref": "IRO-14",
          "title": "Regulatory & Law Enforcement Contacts",
          "summary": "Does the organization maintain incident response contacts with applicable regulatory and law enforcement agencies?"
        }
      ]
    },
    {
      "title": "Information Assurance",
      "controls": [
        {
          "ref": "IAO-03.2",
          "title": "Adequate Security for Sensitive Data In Support of Contracts",
          "summary": "Does the organization protect sensitive data that is collected, developed, received, transmitted, used or stored in support of the performance of a contract?"
        }
      ]
    },
    {
      "title": "Maintenance",
      "controls": [
        {
          "ref": "MNT-01",
          "title": "Maintenance Operations",
          "summary": "Does the organization develop, disseminate, review & update procedures to facilitate the implementation of maintenance controls across the enterprise?"
        },
        {
          "ref": "MNT-02",
          "title": "Controlled Maintenance",
          "summary": "Does the organization conduct controlled maintenance activities throughout the lifecycle of the system, application or service?"
        },
        {
          "ref": "MNT-05",
          "title": "Non-Local Maintenance",
          "summary": "Does the organization authorize, monitor and control non-local maintenance and diagnostic activities?"
        }
      ]
    },
    {
      "title": "Mobile Device Management",
      "controls": [
        {
          "ref": "MDM-05",
          "title": "Remote Purging",
          "summary": "Does the organization remotely purge selected information from mobile devices?"
        }
      ]
    },
    {
      "title": "Network Security",
      "controls": [
        {
          "ref": "NET-01",
          "title": "Network Security Management",
          "summary": "Does the organization develop, govern & update procedures to facilitate the implementation of network security controls?"
        },
        {
          "ref": "NET-02",
          "title": "Layered Network Defenses",
          "summary": "Does the organization implement security functions as a layered structure that minimizes interactions between layers of the design and avoiding any dependence by lower layers on the functionality or correctness of higher layers?"
        },
        {
          "ref": "NET-02.1",
          "title": "Denial of Service (DoS) Protection",
          "summary": "Do mechanism exist to protect against or limit the effects of Denial of Service (DoS) attacks?"
        },
        {
          "ref": "NET-02.2",
          "title": "Guest Networks",
          "summary": "Does the organization implement and manage a secure guest network?"
        },
        {
          "ref": "NET-03",
          "title": "Boundary Protection",
          "summary": "Are boundary protection mechanisms utilized to monitor and control communications at the external network boundary and at key internal boundaries within the network?"
        },
        {
          "ref": "NET-03.1",
          "title": "Access Points",
          "summary": "Does the organization limit the number of external network connections that a system will simultaneously accept?"
        },
        {
          "ref": "NET-04",
          "title": "Data Flow Enforcement – Access Control Lists (ACLs)",
          "summary": "Does the organization design, implement and review firewall and router configurations to restrict connections between untrusted networks and internal systems?"
        },
        {
          "ref": "NET-06",
          "title": "Network Segmentation",
          "summary": "Does the organization logically or physically segment information flows to accomplish network segmentation?"
        },
        {
          "ref": "NET-08.1",
          "title": "DMZ Networks",
          "summary": "Does the organization require De-Militarized Zone (DMZ) network segments to separate untrusted networks from trusted networks?"
        },
        {
          "ref": "NET-14",
          "title": "Remote Access",
          "summary": "Does the organization define, control and review remote access methods?"
        },
        {
          "ref": "NET-17",
          "title": "Data Loss Prevention (DLP)",
          "summary": "Is Data Loss Prevention (DLP) used to protect sensitive information as it is stored, transmitted and processed?"
        },
        {
          "ref": "NET-18",
          "title": "Content Filtering",
          "summary": "Does the organization force Internet-bound network traffic through a proxy device for URL content filtering to limit a user's ability to connect to prohibited content?"
        },
        {
          "ref": "NET-18.1",
          "title": "Route Traffic to Proxy Servers",
          "summary": "Does the organization route internal communications traffic to external networks through organization-approved proxy servers at managed interfaces?"
        }
      ]
    },
    {
      "title": "Physical & Environmental Security",
      "controls": [
        {
          "ref": "PES-01",
          "title": "Physical & Environmental Protections",
          "summary": "Does the organization facilitate the operation of physical and environmental protection controls?"
        },
        {
          "ref": "PES-02",
          "title": "Physical Access Authorizations",
          "summary": "Does the organization maintain a current list of personnel with authorized access to organizational facilities (except for those areas within the facility officially designated as publicly accessible)?"
        },
        {
          "ref": "PES-02.1",
          "title": "Role-Based Physical Access",
          "summary": "Does the organization authorize physical access to facilities based on the position or role of the individual?"
        },
        {
          "ref": "PES-03",
          "title": "Physical Access Control",
          "summary": "Does the organization enforce physical access authorizations for all physical access points (including designated entry/exit points) to facilities (excluding those areas within the facility officially designated as publicly accessible)?"
        },
        {
          "ref": "PES-03.2",
          "title": "Lockable Physical Casings",
          "summary": "Does the organization protect system components from unauthorized physical access (e.g.?, lockable physical casings)?"
        },
        {
          "ref": "PES-04",
          "title": "Physical Security of Offices, Rooms & Facilities",
          "summary": "Are physical access controls designed and implemented for offices, rooms and facilities?"
        },
        {
          "ref": "PES-04.1",
          "title": "Working in Secure Areas",
          "summary": "Do physical access controls ensure that only authorized personnel are allowed access to secure areas?"
        },
        {
          "ref": "PES-05",
          "title": "Monitoring Physical Access",
          "summary": "Does the organization monitor for, detect and respond to physical security incidents?"
        },
        {
          "ref": "PES-12",
          "title": "Equipment Siting & Protection",
          "summary": "Does the organization locate system components within the facility to minimize potential damage from physical and environmental hazards and to minimize the opportunity for unauthorized access?"
        },
        {
          "ref": "PES-12.1",
          "title": "Access Control for Transmission Medium",
          "summary": "Does the organization protect power and telecommunications cabling carrying data or supporting information services from interception, interference or damage?"
        },
        {
          "ref": "PES-12.2",
          "title": "Access Control for Output Devices",
          "summary": "Does the organization restrict access to printers and other system output devices to prevent unauthorized individuals from obtaining the output?"
        },
        {
          "ref": "PES-13",
          "title": "Information Leakage Due To Electromagnetic Signals Emanations",
          "summary": "Does the organization protect the system from information leakage due to electromagnetic signals emanations?"
        }
      ]
    },
    {
      "title": "Privacy",
      "controls": [
        {
          "ref": "PRI-01",
          "title": "Privacy Program",
          "summary": "Does the organization facilitate the implementation and operation of privacy controls?"
        },
        {
          "ref": "PRI-01.1",
          "title": "Chief Privacy Officer (CPO)",
          "summary": "Does the organization appoints a Chief Privacy Officer (CPO) or similar role, with the authority, mission, accountability and resources to coordinate, develop and implement, applicable privacy requirements and manage privacy risks through the organization-wide privacy program?"
        },
        {
          "ref": "PRI-02",
          "title": "Notice",
          "summary": "Do mechanisms exist to:\n ▪ Make privacy notice(s) available to individuals upon first interacting with an organization and subsequently as necessary?\n ▪ Ensure that privacy notices are clear and easy-to-understand, expressing information about Personal Information (PI) processing in plain language?"
        },
        {
          "ref": "PRI-05",
          "title": "Use, Retention & Disposal",
          "summary": "Do mechanisms exist to: \n ▪ Retain Personal Information (PI), including metadata, for an organization-defined time period to fulfill the purpose(s) identified in the notice or as required by law;\n ▪ Disposes of, destroys, erases, and/or anonymizes the PI, regardless of the method of storage; and\n ▪ Uses organization-defined techniques or methods to ensure secure deletion or destruction of PI (including originals, copies and archived records)?"
        },
        {
          "ref": "PRI-06",
          "title": "Right of Access",
          "summary": "Does the organization provide individuals the ability to access their Personal Information (PI) maintained in organizational systems of records?"
        },
        {
          "ref": "PRI-06.1",
          "title": "Redress",
          "summary": "Does the organization establish and implement a process for:\n ▪ Individuals to have inaccurate Personal Information (PI) maintained by the organization corrected or amended; and\n ▪ Disseminating corrections or amendments of PI to other authorized users of the PI?"
        },
        {
          "ref": "PRI-06.4",
          "title": "User Feedback Management",
          "summary": "Does the organization implement a process for receiving and responding to complaints, concerns or questions from individuals about the organizational privacy practices?"
        },
        {
          "ref": "PRI-07.1",
          "title": "Privacy Requirements for Contractors & Service Providers",
          "summary": "Does the organization includes privacy requirements in contracts and other acquisition-related documents that establish privacy roles and responsibilities for contractors and service providers?"
        },
        {
          "ref": "PRI-12",
          "title": "Updating Personal Information (PI)",
          "summary": "Does the organization develop processes to identify and record the method under which Personal Information (PI) is updated and the frequency that such updates occur?"
        },
        {
          "ref": "PRI-14.1",
          "title": "Accounting of Disclosures",
          "summary": "Does the organization develop and maintain an accounting of disclosures of Personal Information (PI) held by the organization and make the accounting of disclosures available to the person named in the record, upon request?"
        }
      ]
    },
    {
      "title": "Project & Resource Management",
      "controls": [
        {
          "ref": "PRM-03",
          "title": "Allocation of Resources",
          "summary": "Does the organization identify and allocate resources for management, operational, technical and privacy requirements within business process planning for projects / initiatives?"
        },
        {
          "ref": "PRM-04",
          "title": "Security In Project Management",
          "summary": "Does the organization assess security and privacy controls in system project development to determine the extent to which the controls are implemented correctly, operating as intended and producing the desired outcome with respect to meeting the requirements?"
        },
        {
          "ref": "PRM-05",
          "title": "Security Requirements Definition",
          "summary": "Does the organization identify critical system components and functions by performing a criticality analysis for critical systems, system components or services at pre-defined decision points in the Secure Development Life Cycle (SDLC)?"
        },
        {
          "ref": "PRM-07",
          "title": "Secure Development Life Cycle (SDLC) Management",
          "summary": "Does the organization ensure changes to systems within the Secure Development Life Cycle (SDLC) are controlled through formal change control procedures?"
        }
      ]
    },
    {
      "title": "Risk Management",
      "controls": [
        {
          "ref": "RSK-01",
          "title": "Risk Management Program",
          "summary": "Does the organization facilitate the implementation of risk management controls?"
        },
        {
          "ref": "RSK-03",
          "title": "Risk Identification",
          "summary": "Does the organization identify and document risks, both internal and external?"
        },
        {
          "ref": "RSK-04",
          "title": "Risk Assessment",
          "summary": "Does the organization conduct an annual assessment of risk that includes the likelihood and magnitude of harm, from unauthorized access, use, disclosure, disruption, modification or destruction of the organization's systems and data?"
        },
        {
          "ref": "RSK-06",
          "title": "Risk Remediation",
          "summary": "Does the organization remediate risks to an acceptable level?"
        },
        {
          "ref": "RSK-08",
          "title": "Business Impact Analysis (BIA)",
          "summary": "Does the organization conduct a Business Impact Analysis (BIA)?"
        },
        {
          "ref": "RSK-09",
          "title": "Supply Chain Risk Management Plan",
          "summary": "Does the organization develop a plan for managing supply chain risks associated with the development, acquisition, maintenance and disposal of systems, system components and services?"
        },
        {
          "ref": "RSK-09.1",
          "title": "Supply Chain Risk Assessment",
          "summary": "Does the organization assess supply chain risks associated with systems, system components and services?"
        },
        {
          "ref": "RSK-10",
          "title": "Data Protection Impact Assessment (DPIA)",
          "summary": "Does the organization conduct a Data Protection Impact Assessment (DPIA) on systems, applications and services to evaluate privacy implications?"
        }
      ]
    },
    {
      "title": "Secure Engineering & Architecture",
      "controls": [
        {
          "ref": "SEA-01",
          "title": "Secure Engineering Principles",
          "summary": "Does the organization facilitate the implementation of industry-recognized security and privacy practices in the specification, design, development, implementation and modification of systems and services?"
        },
        {
          "ref": "SEA-01.1",
          "title": "Centralized Management of Cybersecurity & Privacy Controls",
          "summary": "Does the organization centrally-manage the organization-wide management and implementation of cybersecurity and privacy controls and related processes?"
        },
        {
          "ref": "SEA-02",
          "title": "Alignment With Enterprise Architecture",
          "summary": "Does the organization develop an enterprise architecture, aligned with industry-recognized leading practices, with consideration for cybersecurity and privacy principles that addresses risk to organizational operations, assets, individuals, other organizations?"
        },
        {
          "ref": "SEA-02.1",
          "title": "Standardized Terminology",
          "summary": "Does the organization standardize technology and process terminology to reduce confusion amongst groups and departments?"
        },
        {
          "ref": "SEA-07.2",
          "title": "Fail Secure",
          "summary": "Does the organization enable systems to fail to an organization-defined known-state for types of failures, preserving system state information in failure?"
        }
      ]
    },
    {
      "title": "Security Operations",
      "controls": [
        {
          "ref": "OPS-01",
          "title": "Operations Security",
          "summary": "Does the organization facilitate the implementation of operational security controls?"
        },
        {
          "ref": "OPS-01.1",
          "title": "Standardized Operating Procedures (SOP)",
          "summary": "Do Standardized Operating Procedures (SOP), or similar mechanisms, used to identify and document day-to-day procedures to enable the proper execution of assigned tasks?"
        },
        {
          "ref": "OPS-02",
          "title": "Security Concept Of Operations (CONOPS)",
          "summary": "Does the organization develop a security Concept of Operations (CONOPS) that documents management, operational and technical measures implemented to apply defense-in-depth techniques?"
        },
        {
          "ref": "OPS-03",
          "title": "Service Delivery",
          "summary": "Does the organization define supporting business processes and implement appropriate governance and service management to ensure appropriate planning, delivery and support of the organization's technology capabilities supporting business functions, workforce, and/or customers based on industry-recognized standards?"
        }
      ]
    },
    {
      "title": "Security Awareness & Training",
      "controls": [
        {
          "ref": "SAT-01",
          "title": "Security & Privacy-Minded Workforce",
          "summary": "Does the organization facilitate the implementation of security workforce development and awareness controls?"
        },
        {
          "ref": "SAT-02",
          "title": "Security & Privacy Awareness",
          "summary": "Does the organization provide all employees and contractors appropriate awareness education and training that is relevant for their job function?"
        },
        {
          "ref": "SAT-03",
          "title": "Security & Privacy Training",
          "summary": "Does the organization provide role-based security-related training: \n ▪ Before authorizing access to the system or performing assigned duties; \n ▪ When required by system changes; and \n ▪ Annually thereafter?"
        },
        {
          "ref": "SAT-03.1",
          "title": "Practical Exercises",
          "summary": "Does the organization include practical exercises in security and privacy training that reinforce training objectives?"
        },
        {
          "ref": "SAT-03.5",
          "title": "Privileged Users",
          "summary": "Does the organization provides specific training for privileged users to ensure privileged users understand their unique roles and responsibilities"
        }
      ]
    },
    {
      "title": "Technology Development & Acquisition",
      "controls": [
        {
          "ref": "TDA-08",
          "title": "Separation of Development, Testing and Operational Environments",
          "summary": "Does the organization manage separate development, testing, and operational environments to reduce the risks of unauthorized access or changes to the operational environment and to ensure no impact to production systems?"
        }
      ]
    },
    {
      "title": "Third-Party Management",
      "controls": [
        {
          "ref": "TPM-01",
          "title": "Third-Party Management",
          "summary": "Does the organization facilitate the implementation of third-party management controls?"
        },
        {
          "ref": "TPM-02",
          "title": "Third-Party Criticality Assessments",
          "summary": "Does the organization identify, prioritize and assess suppliers and partners of critical systems, components and services using a supply chain risk assessment process?"
        },
        {
          "ref": "TPM-03",
          "title": "Supply Chain Protection",
          "summary": "Does the organization evaluate security risks associated with the services and product supply chain?"
        },
        {
          "ref": "TPM-05",
          "title": "Third-Party Contract Requirements",
          "summary": "Does the organization identify, regularly review and document third-party confidentiality, Non-Disclosure Agreements (NDAs) and other contracts that reflect the organization’s needs to protect systems and data?"
        },
        {
          "ref": "TPM-06",
          "title": "Third-Party Personnel Security",
          "summary": "Does the organization control personnel security requirements including security roles and responsibilities for third-party providers?"
        },
        {
          "ref": "TPM-11",
          "title": "Third-Party Incident Response & Recovery Capabilities",
          "summary": "Does the organization ensure response/recovery planning and testing are conducted with critical suppliers/providers?"
        }
      ]
    },
    {
      "title": "Threat Management",
      "controls": [
        {
          "ref": "THR-01",
          "title": "Threat Awareness Program",
          "summary": "Does the organization implement a threat awareness program that includes a cross-organization information-sharing capability?"
        },
        {
          "ref": "THR-03",
          "title": "Threat Intelligence Feeds",
          "summary": "Does the organization maintain situational awareness of evolving threats?"
        }
      ]
    },
    {
      "title": "Vulnerability & Patch Management",
      "controls": [
        {
          "ref": "VPM-01",
          "title": "Vulnerability & Patch Management Program (VPMP)",
          "summary": "Does the organization facilitate the implementation and monitoring of vulnerability management controls?"
        },
        {
          "ref": "VPM-02",
          "title": "Vulnerability Remediation Process",
          "summary": "Does the organization ensure that vulnerabilities are properly identified, tracked and remediated?"
        },
        {
          "ref": "VPM-03",
          "title": "Vulnerability Ranking",
          "summary": "Does the organization identify and assign a risk ranking to newly discovered security vulnerabilities using reputable outside sources for security vulnerability information?"
        },
        {
          "ref": "VPM-04",
          "title": "Continuous Vulnerability Remediation Activities",
          "summary": "Does the organization address new threats and vulnerabilities on an ongoing basis and ensure assets are protected against known attacks?"
        },
        {
          "ref": "VPM-05",
          "title": "Software Patching",
          "summary": "Does the organization conduct software patching for all deployed operating systems, applications, and firmware?"
        },
        {
          "ref": "VPM-06",
          "title": "Vulnerability Scanning",
          "summary": "Does the organization detect vulnerabilities and configuration errors by recurring vulnerability scanning of systems and web applications?"
        },
        {
          "ref": "VPM-10",
          "title": "Red Team Exercises",
          "summary": "Does the organization utilize \"red team\" exercises to simulate attempts by adversaries to compromise systems and applications in accordance with organization-defined rules of engagement? "
        }
      ]
    },
    {
      "title": "Web Security",
      "controls": [
        {
          "ref": "WEB-01",
          "title": "Web Security",
          "summary": "Does the organization facilitate the implementation of an enterprise-wide web management policy, as well as associated standards, controls and procedures?"
        },
        {
          "ref": "WEB-02",
          "title": "Use of Demilitarized Zones (DMZ)",
          "summary": "Does the organization utilize a Demilitarized Zone (DMZ) to restrict inbound traffic to authorized devices on certain services, protocols and ports?"
        },
        {
          "ref": "WEB-03",
          "title": "Web Application Firewall (WAF)",
          "summary": "Does the organization deploy Web Application Firewalls (WAFs) to provide defense-in-depth protection for application-specific threats?"
        }
      ]
    }
  ]
}